import { PPJSON } from "./../types/Macro";
import { cleanMacro, getZoneIDByZoneName } from "../store/macro";
import { ZoneIdInfo } from "../types/Macro";
export const defaultMacro: { zoneId: ZoneIdInfo } = {
  zoneId: {
    "1003": [
      {
        Name: "P1S被窝",
        Type: "macro",
        Text: cleanMacro(`
          /p 【基本八方】|【P1锁链换位】同色标点
          /p D3 MT D4    | MTD3 STD2 H1D1 H2D4
          /p H1  ◎   H2   |【冰火侵蚀】
          /p D1  ST  D2   |MT和D3第二次固定换颜色
          /p                         |第三次根据颜色站位
          /p 【四连锁】
          /p 红3                 红8
          /p              紫3
          /p     紫18 ◎ 紫8
          /p             紫13
          /p 红18              红13
          /p 【定时锁链】
          /p 人群：红 点名：白
  `),
      },
      {
        Name: "P1S WayMark",
        Type: "place",
        Place: {
          A: { X: 100.0, Y: 0.0, Z: 96.0, ID: 0, Active: true },
          B: { X: 104.0, Y: 0.0, Z: 100.0, ID: 1, Active: true },
          C: { X: 100.0, Y: 0.0, Z: 104.0, ID: 2, Active: true },
          D: { X: 96.0, Y: 0.0, Z: 100.0, ID: 3, Active: true },
          One: { X: 90.0, Y: 0.0, Z: 90.0, ID: 4, Active: true },
          Two: { X: 110.0, Y: 0.0, Z: 90.0, ID: 5, Active: true },
          Three: { X: 110.0, Y: 0.0, Z: 110.0, ID: 6, Active: true },
          Four: { X: 90.0, Y: 0.0, Z: 110.0, ID: 7, Active: true },
        },
      },
    ],
    "1005": [
      {
        Name: "P2S被窝",
        Type: "macro",
        Text: cleanMacro(`
          /p 【跳跃分摊】
          /p    原地：MTH1D1D3
          /p    水路：ST H2D2D4
          /p 【麻将】
          /p    紫三角1234→【1234】（无连线）
          /p    蓝方块13：对面 蓝方块24：原地（有连线）
          /p 【第二次对冲】
          /p 非对冲的H固定站污水地板对角，其余人灵性分散
          /p 【多重刻印&污水】←T 分摊 DPS→
          /p 【多重刻印&俯冲】DPS：角落 T：边上
          /p 【散开→接线】T：对面 人群：原地
  `),
      },
      {
        Name: "P2S WayMark",
        Type: "place",
        Place: {
          A: { X: 87.5, Y: 0.5, Z: 87.5, ID: 0, Active: true },
          B: { X: 112.5, Y: 0.5, Z: 87.5, ID: 1, Active: true },
          C: { X: 112.5, Y: 0.5, Z: 112.5, ID: 2, Active: true },
          D: { X: 87.5, Y: 0.5, Z: 112.5, ID: 3, Active: true },
          One: { X: 100.0, Y: 0.0, Z: 90.0, ID: 4, Active: true },
          Two: { X: 110.0, Y: 0.0, Z: 100.0, ID: 5, Active: true },
          Three: { X: 100.0, Y: 0.0, Z: 110.0, ID: 6, Active: true },
          Four: { X: 90.0, Y: 0.0, Z: 100.0, ID: 7, Active: true },
        },
      },
    ],
    "1007": [
      {
        Name: "P3S魔法少女",
        Type: "macro",
        Text: cleanMacro(`
          /p ┌───■暗之炎────┬─■十字地火─┐
          /p │　⑴　│●大球：　　　│
          /p │　⑷　　　　　　　⑵　│　　　北西　　│
          /p │　⑶　│●小球：　　　│
          /p │※顺时针击杀暗之炎　　│　　　11/1点  │
          /p ├───────────┴───────┤
          /p ├─────■俯冲─────┬─■灵泉─┤
          /p │【两侧发光】│【中央发光】│塔：　　　│
          /p │↓　　　　↓│西　↓↓　东│　西北│
          /p │　　│　│　东南│
          /p │　　├──────┘　　　　　│
          /p │　　│点名：→→　│
          /p │　　│　　　→→　│
          /p └──────┴────────────┘
          /p ┌─■炎暗劫火分散─┬─■火龙卷站位──┐
          /p │　　　　　│　　　　　　│
          /p │　　　　　│　　　　　　　　│
          /p │　　　　　│　　★　　│
          /p │　　　　　│　　　　　　│
          /p ├─────────┴─────────┤
          /p ├■火龙卷三穿一分散┬■火龙卷击退后分散┤
          /p │　　　　　　　　　│　　　　黑　　　　│
          /p │　　　　　│　　　　　　　　　│
          /p │　　　　　│　　　　　│
          /p │　　　　★　　　　│　　　　　│
          /p │　　　　　│　　　　　│
          /p │　　　　　│　　　　　　　│
          /p │　　　　　　　　　│　　　　　│
          /p └─────────┴─────────┘
  `),
      },
      {
        Name: "P3S WayMark 魔法少女",
        Type: "place",
        Place: {
          A: { X: 100.0, Y: 0.0, Z: 80.0, ID: 0, Active: true },
          B: { X: 120.0, Y: 0.0, Z: 100.0, ID: 1, Active: true },
          C: { X: 100.0, Y: 0.0, Z: 120.0, ID: 2, Active: true },
          D: { X: 80.0, Y: 0.0, Z: 100.0, ID: 3, Active: true },
          One: { X: 100.0, Y: 0.0, Z: 94.0, ID: 4, Active: true },
          Two: { X: 106.0, Y: 0.0, Z: 100.0, ID: 5, Active: true },
          Three: { X: 100.0, Y: 0.0, Z: 106.0, ID: 6, Active: true },
          Four: { X: 94.0, Y: 0.0, Z: 100.0, ID: 7, Active: true },
        },
      },
      {
        Name: "P3S WayMark 被窝",
        Type: "place",
        Place: {
          A: { X: 100.0, Y: 0.0, Z: 91.19, ID: 0, Active: true },
          B: { X: 108.81, Y: 0.0, Z: 100.277, ID: 1, Active: true },
          C: { X: 100.0, Y: 0.0, Z: 108.81, ID: 2, Active: true },
          D: { X: 91.19, Y: 0.0, Z: 100.0, ID: 3, Active: true },
          One: { X: 93.966, Y: 0.007, Z: 93.921, ID: 4, Active: true },
          Two: { X: 105.988, Y: 0.007, Z: 93.938, ID: 5, Active: true },
          Three: { X: 106.035, Y: 0.008, Z: 106.026, ID: 6, Active: true },
          Four: { X: 93.989, Y: 0.008, Z: 105.995, ID: 7, Active: true },
        },
      },
    ],
    "1009": [
      {
        Name: "P4S被窝门神",
        Type: "macro",
        Text: cleanMacro(`
          /p 【P1拉线 + P3踩塔】     |【踩塔时拉线】
          /p    D1/MT　　 D2/ST     |     H1/D3
          /p                     ◎                    |     MT/D1
          /p    D3/H1  [1]  D4/H2   |     ST/D2
          /p                                             |     H2/D4
          /p 接毒顺序：D1D2D3D4/MTSTH1H2
          /p 【剧场分散】雷火为6点|【撞球】
          /p             MT    ST                |D3 MT H2
          /p   D3    D1◎D2    D4     |D1 ◎  D2
          /p             H1    H2               |H1 ST  D4
          /p 【剧场分摊】                   |同组一起顺时针连撞两个
          /p   前：MTH1D1D3         |D1D3→A开始 D2D4→C开始
          /p   后： STH2D2D4          |MTH2→B开始 STH1→D开始
          /p 【死刑】MT无敌→ST无敌→换T（战士无敌）
  `),
      },
      {
        Name: "P4S被窝本体",
        Type: "macro",
        Text: cleanMacro(`
          /p          【一运】    | 【三运】MTD4引导
          /p  D3　　　  D4  | H1                    |                     MT
          /p   　MT　ST        | D3        D1      |        H1      D1
          /p   　　   ◎            |              ◎ ST  →   D3◎
          /p   　D1　D2       | D4       D2       |        H2      D2
          /p  H1　　　H2    | H2                    |                     ST
          /p 【二运】以第一次A/B的安全区为12点
          /p 无T：11点钟拉线→12点钟踩塔→3点钟分摊  红T：12点钟分摊→3点钟分摊
          /p 紫H：5点钟拉线→6点钟踩塔→3点钟踩塔   红H：6点钟分摊→9点钟踩塔
          /p 红D：12点钟分摊→9点分摊[D1234]3点分摊 绿D：6点钟分摊→9点钟分摊
          /p 【五运】D3　D1　　　ST　H2
          /p 　　           荆棘         ◎        荆棘
          /p                 D4    D2            MT   H1
          /p 【四运】顺时针，蓝三紫一【六运】DPS：10s TH：5s
  `),
      },
      {
        Name: "P4S WayMark 被窝门神",
        Type: "place",
        Place: {
          A: { X: 100.0, Y: 0.0, Z: 85.0, ID: 0, Active: true },
          B: { X: 115.0, Y: 0.0, Z: 100.0, ID: 1, Active: true },
          C: { X: 100.0, Y: 0.0, Z: 115.0, ID: 2, Active: true },
          D: { X: 85.0, Y: 0.0, Z: 100.0, ID: 3, Active: true },
          One: { X: 100.0, Y: 0.0, Z: 102.5, ID: 4, Active: true },
          Two: { X: 100.0, Y: 0.0, Z: 107.5, ID: 5, Active: true },
          Three: { X: 0.0, Y: 0.0, Z: 0.0, ID: 6, Active: false },
          Four: { X: 0.0, Y: 0.0, Z: 0.0, ID: 7, Active: false },
        },
      },
      {
        Name: "P4S WayMark 被窝本体",
        Type: "place",
        Place: {
          A: { X: 99.058, Y: 0.0, Z: 81.135, ID: 0, Active: true },
          B: { X: 119.352, Y: 0.0, Z: 99.316, ID: 1, Active: true },
          C: { X: 100.747, Y: 0.0, Z: 119.114, ID: 2, Active: true },
          D: { X: 80.574, Y: 0.0, Z: 101.415, ID: 3, Active: true },
          One: { X: 105.052, Y: 0.0, Z: 84.859, ID: 4, Active: true },
          Two: { X: 114.869, Y: 0.0, Z: 104.923, ID: 5, Active: true },
          Three: { X: 95.007, Y: 0.0, Z: 114.873, ID: 6, Active: true },
          Four: { X: 85.0, Y: 0.0, Z: 95.019, ID: 7, Active: true },
        },
      },
      {
        Name: "P4S WayMark Melee Uptime",
        Type: "place",
        Place: {
          A: { X: 102.5, Y: 0.0, Z: 90.0, ID: 0, Active: true },
          B: { X: 110.0, Y: 0.0, Z: 102.5, ID: 1, Active: true },
          C: { X: 97.5, Y: 0.0, Z: 110.0, ID: 2, Active: true },
          D: { X: 90.0, Y: 0.0, Z: 97.5, ID: 3, Active: true },
          One: { X: 97.0, Y: 0.0, Z: 82.0, ID: 4, Active: true },
          Two: { X: 118.0, Y: 0.0, Z: 97.0, ID: 5, Active: true },
          Three: { X: 103.0, Y: 0.0, Z: 118.0, ID: 6, Active: true },
          Four: { X: 82.0, Y: 0.0, Z: 103.0, ID: 7, Active: true },
        },
      },
    ],
    "1082": [
      {
        Name: "P5S game8",
        Type: "macro",
        Text: cleanMacro(`
          /p 【基本散開】　　　【十字毒塔】STフリー
          /p D3 MT D4　　　　　　MT(無敵)
          /p H1　　H2　　　H1D3　　 H2D4
          /p D1 ST D2　　　　　　 D1D2
          /p 【毒塔（近接内側 / 遠隔外側）】
          /p MTST / H1D3：12時から反時計回り
          /p D1D2 / H2D4：1時から時計回り
          /p 【ベノムサージ(東西受け)/スプラッシュ】
          /p 西/内壁：MTH1D1D3 東/外壁：STH2D2D4
          /p 【毒沼 + ベノムスコール】
          /p 　　毒D1H1D3外
          /p 　　　　MT
          /p 　　　　☆
          /p 　　　　ST
          /p 　外D4H2D2毒　※毒が逆位置の場合反転
          /p MT組：マーカー1or4に出た毒に合わせて移動
          /p ST組：マーカー2or3に出た毒に合わせて移動
          /p AOEは外周に捨ててMT/STの位置で頭割り
          /p 【4部屋ベノムスプラッシュ：3個部屋の対角】
  `),
      },
      {
        Name: "P5S WayMark",
        Type: "place",
        Place: {
          A: { X: 100.0, Y: -300.0, Z: 93.0, ID: 0, Active: true },
          B: { X: 107.0, Y: -300.0, Z: 100.0, ID: 1, Active: true },
          C: { X: 100.0, Y: -300.0, Z: 107.0, ID: 2, Active: true },
          D: { X: 93.0, Y: -300.0, Z: 100.0, ID: 3, Active: true },
          One: { X: 112.5, Y: -300.0, Z: 87.5, ID: 4, Active: true },
          Two: { X: 112.5, Y: -300.0, Z: 112.5, ID: 5, Active: true },
          Three: { X: 87.5, Y: -300.0, Z: 112.5, ID: 6, Active: true },
          Four: { X: 87.5, Y: -300.0, Z: 87.5, ID: 7, Active: true },
        },
      },
    ],
    "1084": [
      {
        Name: "P6S game8",
        Type: "macro",
        Text: cleanMacro(`
          /p ※MT組：MTH1D1D3 ST組：STH2D2D4
          /p 　【基本散開】　　【カヘキシー1回目】
          /p MT/D3　ST/D4 　 　 8　　 　 　8
          /p 　　 　 ★　　 　 　12　20 ★ 20　12
          /p H1/D1　H2/D2　　16 　 　 　 16
          /p 【 頭割り+扇範囲 】｜ 【4：4頭割り】
          /p 西：MT組 東：ST組｜西側→MT組 東側→ST組
          /p ※時計回りで頭割り｜※内周4マスを使用
          /p 【サイコロ】　　 　｜【チェンジバースト2回目】
          /p 西：奇数　　　　　｜西→T・H 東→DPS
          /p 東：偶数　　　　　｜※AOEも上記方向に捨てる
          /p 【カヘキシー2回目】
          /p 西：紫デバフ　東：緑デバフ
          /p 北・南外周マス→AoE　内周マス→頭割り
  `),
      },
      {
        Name: "P6S WayMark",
        Type: "place",
        Place: {
          A: { X: 100.071, Y: 0.0, Z: 90.053, ID: 0, Active: true },
          B: { X: 110.043, Y: 0.0, Z: 99.861, ID: 1, Active: true },
          C: { X: 99.954, Y: 0.0, Z: 110.023, ID: 2, Active: true },
          D: { X: 89.937, Y: 0.0, Z: 99.946, ID: 3, Active: true },
          One: { X: 109.937, Y: 0.0, Z: 90.068, ID: 4, Active: true },
          Two: { X: 109.992, Y: 0.0, Z: 109.859, ID: 5, Active: true },
          Three: { X: 89.9, Y: 0.0, Z: 109.926, ID: 6, Active: true },
          Four: { X: 89.969, Y: 0.0, Z: 90.134, ID: 7, Active: true },
        },
      },
    ],
    "1086": [
      {
        Name: "P7S game8",
        Type: "macro",
        Text: cleanMacro(`
          /p MT組：MTH1D1D3　ST組：STH2D2D4
          /p 　【基本散開】　　　　　【ノックバック+鳥】
          /p MT/D1　ST/D2　　　　 D1　　 　 　 D2
          /p 　　 　 ★　　　　　　D3　 MT　 　ST　 D4
          /p H1/D3　H2/D4　　　　通路 　 　 　 通路
          /p 　　　　　　　　　　　H1　　　　　　　H2
          /p 【生命の果実：頭割り】　│【魔印創成：散開】
          /p 北側：MT組　南側：ST組 │基本散開※頭割りと被ったら通路
          /p 【エクサ+頭割り】　 　 　 │【鳥誘導＋塔】
          /p 西：MT組　東：ST組　　 │基本散開準拠でズレたら時計回り
          /p 【魔印創成：獄】
          /p 　 ▼西島▼　　　　　　　 　 ▼東島▼
          /p 頭割り　MT/D1 　 　 　 MT/D1　頭割り
          /p ST/D2　H2/D4　通路　H2/D4　ST/D2
          /p 　　　　H1/D3　 　　　H1/D3
  `),
      },
      {
        Name: "P7S WayMark",
        Type: "place",
        Place: {
          A: { X: 114.29, Y: 0.0, Z: 83.0, ID: 0, Active: true },
          B: { X: 121.87, Y: 0.0, Z: 87.38, ID: 1, Active: true },
          C: { X: 121.87, Y: 0.0, Z: 96.13, ID: 2, Active: true },
          D: { X: 114.29, Y: 0.0, Z: 100.5, ID: 3, Active: true },
          One: { X: 85.71, Y: 0.0, Z: 83.0, ID: 4, Active: true },
          Two: { X: 78.13, Y: 0.0, Z: 87.38, ID: 5, Active: true },
          Three: { X: 78.13, Y: 0.0, Z: 96.13, ID: 6, Active: true },
          Four: { X: 85.71, Y: 0.0, Z: 100.5, ID: 7, Active: true },
        },
      },
    ],
    "1088": [
      {
        Name: "P8S game8门神",
        Type: "macro",
        Text: cleanMacro(`
          /p ■テトラオクタ/誘導/蛇2　 ■基本散会
          /p 　MT/D3　→　ST/D4　　　D3 MT D4
          /p 　　↑　　 ☆　　↓　 　　　H1(H2) ST
          /p 　H1/D1　←　H2/D2 　　D1 H2 D2
          /p ■イントゥシャドウ(1回目)
          /p 　蛇：北から時計回りMTD1>STD2>H1D3>H2D4
          /p ■フェイタルストンプ
          /p 　1,3回目→1(北西)　2,4回目→中央　待機→A(北)
          /p ■幻影創造
          /p ◎竜竜×散開　　　　 │◎フェニ×散開
          /p 　　　　D3　　　 　 │　D3 MT D4
          /p 　　　　MT　ST　D4│　H1 ☆ ST
          /p 　　H1 D1　D2　　 │　D1 H2 D2
          /p 　　　　　　 H2　　 │
          /p ■四重炎嵐(縦横) ｜■四重炎嵐(角)
          /p 　　　 MT　　　│　　中央　※MT組：西優先
          /p 　 D1 ST D2 　　｜T　近
          /p 　D3 H1 H2 D4 │遠　H
          /p ◎頭割り：近H位置(MTD1/STD2/H1D3/H2D4)
          /p ■イントゥシャドウ(2回目) 4:4頭割り
          /p 　デバフ持ち：北西>MT/D1>ST/D2>H1/D3>H2/D4>南東
          /p 　無職：北西TH/南東DPS
          /p ■テトラ/ディフレア
          /p 　テトラ：(ボス)MT/D1>ST/D2>H1/D3>H2/D4
          /p 　ディフレア：(ボス)MTH1D1D2>STH2D3D4
  `),
      },
      {
        Name: "P8S game8本体",
        Type: "macro",
        Text: cleanMacro(`
          /p 【術式1回目(頭割は西)】【術式炎氷(TH西 DPS東) 】
          /p 　 　★　　　紫 　 ST│ ▼炎:中央前詰め　▼氷誘導
          /p D1 MT D2　　 MT　│ MT>ST >H1>H2 西 D1>ST
          /p H1　　H2　H1　D2│ D1>D2>D3>D4 東MT>D2
          /p D3 S T D4　 　 D1　│【術式2回目散開 】
          /p 　※左安置は　H2　D3│　STMT 紫 D3D1
          /p 　　左右反転→　 D4 　│　　 H1H2D4D2
          /p 【概念1回目①】　　【概念1回目②】
          /p 　　　　早α　　 　 │　　　遅α
          /p 複/遅α　　　　　　│
          /p 　　　　　　 早β 　│ 生物　　　　遅β
          /p 重/遅βγ　　　　　 │
          /p 　　　　早γ　　 　 │　　　遅γ
          /p ※4塔：遅αβγ→北で合成
          /p 　 　 　 複/重/早余り→南で合成
          /p 【万象灰燼：はいじあ/ビジョン式】
          /p 　　MT　　D1
          /p ST　 +　　　+　D2　※1,3番塔は前+で範囲捨て
          /p H1　+　　　+　D3　※2,4番塔は後+で範囲捨て
          /p 　 　H2　　D4
          /p 【概念2回目①】 　 　【概念2回目②】
          /p 　　 無/早α　　　 │　　　　遅α
          /p 単　　　　　 　 　 │ 生物
          /p 　　　　　　早β　│ ｲﾌ ｲﾌ　　　　遅β
          /p 複/遅　　　　　　 │ 生物
          /p 　　　 早γ 　　 　 │　　　　遅γ
          /p ※4塔：遅αβ→北で合成　遅γ/早余り→南で合成
          /p 【支配者の一撃】　　　　　【塔優先度】
          /p 　MTH1 D3 D1　西>MTSTH1H2D4D3D2D1>東
          /p 　ST H2 D4 D2
  `),
      },
      // {
      //   Name: "P8S WayMark",
      //   Type: "place",
      //   Place: {
      //     A:{ X: 100.0, Y: 0.0, Z: 85.0, ID: 0, Active: true },
      //     B:{ X: 115.0, Y: 0.0, Z: 100.0, ID: 1, Active: true },
      //     C:{ X: 100.0, Y: 0.0, Z: 115.0, ID: 2, Active: true },
      //     D:{ X: 85.0, Y: 0.0, Z: 100.0, ID: 3, Active: true },
      //     One:{ X: 110.0, Y: 0.0, Z: 90.0, ID: 4, Active: true },
      //     Two:{ X: 110.0, Y: 0.0, Z: 110.0, ID: 5, Active: true },
      //     Three:{ X: 90.0, Y: 0.0, Z: 110.0, ID: 6, Active: true },
      //     Four:{ X: 90.0, Y: 0.0, Z: 90.0, ID: 7, Active: true },
      // },
      // },
    ],
    "968": [
      {
        Name: "莫古力P1",
        Type: "macro",
        Text: cleanMacro(`
          /p P1锁链点名 索尼 ｜ 白球冲锋：骑士12点，下半场躲避
          /p    △H  ×T   □T   ｜ 深仁厚泽打断：ST→远敏→MT
          /p    ○D          ○D   ｜ 钢铁：全维空间/月环：无维空间
          /p    □D  ×H  △D   ｜ P1.5引导：奶→远→近→T
          /p                              右 左 右 左
      `),
      },
      {
        Name: "莫古力P2",
        Type: "macro",
        Text: cleanMacro(`
          /p 一运雷分散   ｜ 二运分组：D12补位
          /p         奶          ｜ MTH1       STH2
          /p    近  T  远     ｜  D1D3       D2D4
          /p  3C4D-MT组 |     2刀            1刀
          /p  1A2B-ST组  |     脚下           对面
          /p ————————————————
          /p              MTD1             ｜ 固定AC陨石整组换位（除非BD正好出现陨石）
          /p  H1D3            H2D4  ｜ 第一次踩塔：陨石＞DPS＞TN，对应塔：场外中左右＞场内左手
          /p              STD2              ｜ 第二次踩塔：陨石＞DPS＞TN，按换位后的组同色标点塔正＞斜
      `),
      },
      {
        Name: "莫古力P3",
        Type: "macro",
        Text: cleanMacro(`
          /p 【莫古力龙诗站位宏P3】
          /p 牙尾的连旋：分摊-钢铁-月环
          /p 尾牙的连旋：分摊-月环-钢铁
          /p ————————————————
          /p 【麻将阶段】预站位｜【麻将阶段】小抄 
          /p               A               ｜  注意麻将组内点名，B上D下
          /p       4②       ②1       ｜ 处理麻将时请注意钢铁月环
          /p           ③③③           ｜ ①C：放塔-回人群-分摊-踩3塔-引导
          /p   B①          ①D    ｜  ①BD：放塔-回人群-踩2塔-引导-回人群-分摊
          /p       3      ①     2       ｜  ② BD：分摊-连旋-放塔-回人群-分摊-踩3塔-引导
          /p                C               ｜  ③BCD：分摊-踩1塔-引导-连旋-放塔-回人群
          /p ————————————————
          /p 【8人4塔阶段】 ｜ 4近战负责补塔，顺序：左→右→中
          /p MTD3      STD4 ｜组内只有1座塔，补位；组内超过2座塔，不动
          /p H1D1      H2D2｜死刑：MT接本体，ST接分身，本体/分身脚下处理
      `),
      },
      {
        Name: "莫古力P4~P7",
        Type: "macro",
        Text: cleanMacro(`
          /p 【P4撞球阶段】      ｜【陨石流】D12→D34→第一轮点名
          /p 场中换色，DPS先撞｜ 左上角开始顺、逆时针数的第一个点名
          /p         MT    ST          ｜  MT       ST
          /p D12蓝      红D34    ｜       人群（蓝龙眼）
          /p         H1    H2         ｜  H2       H1
          /p ————————————————
          /p  【P5死宣+锁链】｜ 【P7接刀】D12→D34→H12
          /p   △无  X无  □无   ｜ 【死亡轮回/狂暴】BOSS面向！
          /p   ○死           ○死  ｜ H1D3D1           H2D4D2
          /p   □死  X无  △死   ｜                  MTST
          /p 【P6传毒】DTTDD最后一次原地，其他全部场中处理
          /p 【P6十字火阶段↓】｜ 【P6光翼死刑】MT固定中，ST找位置
          /p V字放地火，从场边跑到场中时的面向处理点名
          /p 攻击1 2 3 4 ←o→ 锁链2禁止2 锁链1禁止1
          /p 【P6双龙俯冲+P7地火左右出】MT去左，ST去右
      `),
      },
      {
        Name: "莫古力减伤宏",
        Type: "macro",
        Text: cleanMacro(`
          /p 【莫古力龙诗减伤宏P1~P7】只安排目标减伤，场地减伤请队内自行沟通
          /p P1至圣：MT雪仇、D1牵制                     ｜P2古代爆震：MT雪仇、D1牵制、D4昏乱
          /p P1锁链点名：ST雪仇、D2牵制、D4昏乱｜P2碎屏斩：ST雪仇、D2牵制、D4昏乱
          /p ————————————————
          /p P3第一次连旋：MT雪仇、D1牵制               ｜P4陨石流：给不给都可以
          /p P3第二次连旋：ST雪仇、D2牵制、D4昏乱 ｜P4.5纯洁心灵：ST雪仇、D2牵制、D4昏乱
          /p ————————————————
          /p P5第一次古代爆震：MT雪仇、D1牵制              ｜P6两次血量检测：MT雪仇
          /p P5第二次古代爆震：ST雪仇、D2牵制、D4昏乱｜P6死亡轮回：ST雪仇、D1牵制、D4昏乱
          /p ————————————————
          /p 转场，超大AOE注意减伤嗷！别好不容易要进P7了结果噶了嗷！MTST给D34减伤，H12D12开特色减伤，龙骑找奶妈要
          /p ————————————————
          /p P7第一次死亡轮回：MT雪仇、D1牵制、D4昏乱  ｜P7第一次陨石：ST雪仇、D2牵制
          /p P7第二次死亡轮回：MT雪仇                 ｜P7第二次陨石：ST雪仇  、D1牵制、D4昏乱
          /p P7第三次死亡轮回：别看了！有什么给什么！留着过年吗？
          （如果觉得第二次死亡轮回的压力过大，可以考虑2死亡轮回D2牵制）
      `),
      },
      {
        Name: `陨石逃课宏 需要连打+锁60帧 ${getSource("https://docs.qq.com/doc/DSkpLTVNTT2doT2Rz")}`,
        Type: "macro",
        Text: cleanMacro(`
          /mlock
          /merror off
          /automove on <wait.1>
          /automove off
          /echo
          /echo
          /echo
          /echo
          /echo
          /echo
          /echo
          /echo
          /echo
          /echo
          /echo
      `),
      },
      {
        Name: "陨石宏 @竹取辉夜姬",
        Type: "macro",
        Text: cleanMacro(`
          /automove on <wait.1>
          /automove off
      `),
      },
      {
        Name: "黑色分散buff-攻击标",
        Type: "macro",
        Text: cleanMacro(`
          /macrolock
          /macroicon attack1 marking
          /mk attack <me>
          /wait 1
      `),
      },
      {
        Name: "白色分摊buff-锁链标",
        Type: "macro",
        Text: cleanMacro(`
          /macrolock
          /macroicon bind1 marking
          /mk bind <me>
          /wait 1
      `),
      },
      {
        Name: "无buff-禁止标",
        Type: "macro",
        Text: cleanMacro(`
          /macrolock
          /macroicon stop1 marking
          /mk stop <me>
          /wait 1
      `),
      },
      {
        Name: "一键清除标记",
        Type: "macro",
        Text: cleanMacro(`
          /mk attack1 <attack1>
          /mk attack2 <attack2>
          /mk attack3 <attack3>
          /mk attack4 <attack4>
          /mk attack5 <attack5>
          /mk bind1 <bind1>
          /mk bind2 <bind2>
          /mk bind3 <bind3>
          /mk stop1 <stop1>
          /mk stop2 <stop2>
      `),
      },
      {
        Name: "P1 门神",
        Type: "place",
        Place: {
          A: { X: 94.265, Y: 0.0, Z: 90.057, ID: 0, Active: true },
          B: { X: 105.559, Y: 0.0, Z: 89.944, ID: 1, Active: true },
          C: { X: 105.687, Y: 0.0, Z: 109.95, ID: 2, Active: true },
          D: { X: 94.363, Y: 0.0, Z: 109.892, ID: 3, Active: true },
          One: { X: 89.994, Y: 0.0, Z: 94.231, ID: 4, Active: true },
          Two: { X: 110.13, Y: 0.0, Z: 94.36, ID: 5, Active: true },
          Three: { X: 110.003, Y: 0.0, Z: 105.871, ID: 6, Active: true },
          Four: { X: 90.049, Y: 0.0, Z: 105.51, ID: 7, Active: true },
        },
      },
      {
        Name: `P2 @竹取辉夜姬 ${getSource("https://nga.178.com/read.php?tid=31807681")}`,
        Type: "place",
        Place: {
          A: { X: 100.0, Y: 0.0, Z: 86.8, ID: 0, Active: true },
          B: { X: 113.2, Y: 0.0, Z: 100.0, ID: 1, Active: true },
          C: { X: 100.0, Y: 0.0, Z: 113.2, ID: 2, Active: true },
          D: { X: 86.8, Y: 0.0, Z: 100.0, ID: 3, Active: true },
          One: { X: 109.333809, Y: 0.0, Z: 90.66619, ID: 4, Active: true },
          Two: { X: 109.333809, Y: 0.0, Z: 109.333809, ID: 5, Active: true },
          Three: { X: 90.66619, Y: 0.0, Z: 109.333809, ID: 6, Active: true },
          Four: { X: 90.66619, Y: 0.0, Z: 90.66619, ID: 7, Active: true },
        },
      },
    ],
    "1036": [
      {
        "Name": "天然要害沙斯塔夏溶洞",
        "Type": "macro",
        "Text":
          "15溶洞\n沿途：地图直走的笔记文字提示了老一需要打开的机关的颜色。贝壳不用打。\n开完机关之后出现BOSS，打就行了。\n沿途需击杀门口小怪捡钥匙\n最后出洞窟之后需要贴左侧前进,尽量不拉到右侧小怪",
        "Editable": false,
      },
    ],
    "1037": [
      {
        "Name": "地下灵殿塔姆·塔拉墓园",
        "Type": "macro",
        "Text":
          "16墓园\n击杀虚无魂魔之后 取下祭坛上的宝珠\n第三个祭坛有封印结界 要玩家一直前进 在最深处击杀所有小怪取得念珠解除结界.\n最终BOSS 主宰者 加尔梵斯没有特别需要注意的技能 当它与其他小怪连线时 BOSS会变为无敌 需要DPS优先击杀被连线的小怪.",
        "Editable": false,
      },
    ],
    "1038": [
      {
        "Name": "封锁坑道铜铃铜山",
        "Type": "macro",
        "Text":
          "17铜山\n老一愤怒的科托斯 没有任何难度 \n坐电梯下行之后 击杀“爆破爆弹怪” 后捡起掉落的火药 \n老二怒水腐液 需要T拉住粘液胶 其他人启动机关 T同时拉住出现的爆弹怪和粘液胶 让爆弹怪把粘液胶炸碎。魔石精 需要DPS击杀 粘液胶被炸碎3次之后 就可以正常击杀\n老三强腕的居格斯 直接打BOSS即可",
        "Editable": false,
      },
    ],
    "162": [
      {
        "Name": "魔兽领域日影地修炼所",
        "Type": "macro",
        "Text":
          "20修炼所\n老一炽热火丛 直接打BOSS即可\n击杀老一之后点击火堆中的“魔力的奔流”传送\n 道中需要沿途打开“绞车锁链” \n老二霹雳雷蛟脚下是一个雷池 T把BOSS拉到场边的斜坡上 每过一段时间 BOSS就会返回雷池中央无敌 并召唤小怪 此时雷池带电 请不要踩雷池…清理小怪后继续攻击BOSS \n老三兽斗士 坦伽塔 T把BOSS放在中场 T拉住小怪 只击杀最后一只毒火即可 \n当BOSS脚下出现火圈时会无敌 需要转火火元精  ",
        "Editable": false,
      },
    ],
    "1039": [
      {
        "Name": "监狱废墟托托·拉克千狱",
        "Type": "macro",
        "Text":
          "24千狱\n路上需要捡拾4个“魔导感光器” \n抵达第二个房间时身上应该有3个感光器 此时左转 在愚者大厅下方会有第4个感光器 \n老三霸星蛛蝎 BOSS血量下降到一定程度之后 会出现尾刺\n需要DPS立刻集中攻击尾刺 场中刷新的小怪需要由T拉住 奶妈如果是小怪第一仇恨 请把小怪带到T身边 ",
        "Editable": false,
      },
    ],
    "1040": [
      {
        "Name": "名门府邸静语庄园",
        "Type": "macro",
        "Text":
          "28庄园\n进门之后沿左侧前进 在第一间屋子里能捡到小钥匙 沿途女仆的读条AOE可以使用眩晕技能打断\n老一 随从女工 没有特别需要注意的\n打完老一捡了钥匙要原地向后,转开门后不走楼梯 直接跳下去\n下楼之后最后一间房子(地图左下角)里有BOSS房间的钥匙 \n老二 庄园的小丑总管 打就完了\n打完老二之后需要使用通用技能“返回” 然后前行上楼梯 \n老三阿芒迪娜女士 打BOSS就行，如果新人较多可以考虑关灯、打大眼睛小怪。",
        "Editable": false,
      },
    ],
    "1041": [
      {
        "Name": "休养胜地布雷福洛克斯野营地",
        "Type": "macro",
        "Text":
          "32营地\n进门之后在布雷福洛克斯监视小屋的跟哥布林说话拿到钥匙\n老一大黄鹈鹕 T拉住小怪和BOSS 奶妈注意驱散DEbuff\n沿途的怪能不打就不打 直接去BOSS房\n老二狱炎火蛟每隔一段时间会追一段时间哥布林，无视仇恨，不必慌张。\n老三水栖蝾螈 奶妈注意驱散淤泥DEBUFF 出水泡打水泡\n最终BOSS阿杰特 出啥躲啥 BOSS会随机点名一名玩家吐一摊毒 BOSS站在毒里会回血 需要T将其带离毒潭",
        "Editable": false,
      },
    ],
    "163": [
      {
        "Name": "古代遗迹喀恩埋没圣堂",
        "Type": "macro",
        "Text":
          "35圣堂\nDPS第一时间集火圣堂峰，不然会读条能秒杀T的大伤害技能“终结针”\n老一巨齿牛头魔会读条技能“致命射线” 同时屏幕提示“巨齿牛头魔发出了诡异的咆哮！”\n此时需要所有人找到发光的石板踩上去解除buff\n路上遇到的“常衡石面”需要把它放在石板上击杀 石板不发光说明位置正确\n老二圣堂守卫 DPS要先集火巨像兵的魂石 把魂石打掉之后 才能攻击本体 \n老三审判化身 石面同样要在石板上击杀 BOSS会唤权杖，可以无视，也可以打掉。",
        "Editable": false,
      },
    ],
    "170": [
      {
        "Name": "流沙迷宫樵鸣洞",
        "Type": "macro",
        "Text":
          "38樵鸣洞\n打掉蚂蚁、跳进流沙 \n老一灵蚁禁军公主 出啥打啥\n沿途一路狂奔 不要回头 不要摸怪 跑到流沙之后迅速下潜即可 \n老二巨型地道蠕虫 奶妈注意驱散debuff \nBOSS下潜后 所有人贴边躲开伤害范围即可\n老三奇美拉 读条雷电咆哮接近BOSS 读条寒冰咆哮远离BOSS 被点名者远离人群",
        "Editable": false,
      },
    ],
    "1042": [
      {
        "Name": "对龙城塞石卫塔",
        "Type": "macro",
        "Text":
          "41石卫塔\n小怪A人巨疼!\n老一丘都尤都 当BOSS突然离开走向场边或角落时 请立刻跟过去 躲到他身侧或身后\n老二柯西切 T把BOSS拉到门口 面冲外 奶妈站到场地内侧\n当屏幕提示“足枷冰龙从天而降”时 可以开对应位置的炮打断。\n老三足枷冰龙 BOSS血量降低到一定程度之后会上天 对场地进行俯冲 被俯冲的地面会变白 所有人注意躲避 \n第二次俯冲后注意躲开冰圈\n俯冲结束之后 所有人远离T BOSS降落时会对周围造成一定的伤害 ",
        "Editable": false,
      },
    ],
    "171": [
      {
        "Name": "山中战线泽梅尔要塞",
        "Type": "macro",
        "Text":
          "44要塞\n小怪拉到水晶纱帐里面打\n老一全视之眼平时是无敌的 需要拉进水晶纱帐\n老二 躲好AOE\n老三巴特拉尔 BOSS血量下降到一定程度时 会和场边的水晶连线并变为无敌 需要转火水晶",
        "Editable": false,
      },
    ],
    "172": [
      {
        "Name": "毒雾洞窟黄金谷",
        "Type": "macro",
        "Text":
          "47黄金谷\n贴着左边走!\n老一锁匠花 会每隔一段时间全屏上buff buff会让玩家持续掉血 2层吃果子解buff \n老二数币巨人 十吨横扫” 需要T穿过BOSS躲避；“百吨回转” 吃到即死 所有人远离\n老三守财夫人 2层buff就要吃果子 注意转火花苞",
        "Editable": false,
      },
    ],
    "361": [
      {
        "Name": "财宝传说破舰岛",
        "Type": "macro",
        "Text":
          "50破舰岛\n老一大脚巨猿 当BOSS开始全屏AOE时 需要调查场边的树 让BOSS吃掉掉下来的香蕉\n沿途的宝箱都要开 有些会出拟态怪 开箱子或者拟态怪会掉石板 需要凑齐4个石板才能开门 \n老二肖鲁姆 开场BOSS会在场周召唤一堆水泡 不要离得太近 会被吸进去 当BOSS偶潜入地底 出现大漩涡时 需要钻到水泡里躲避\n老三克拉肯 每个岛上会出2只腕足 还有2只触手 触手请优先击杀\nBOSS会随机点一名玩家 头上出现绿色的小石头 需要跳到隔壁没人的岛上 等陨石消失并出现漩涡后 才能返回",
        "Editable": false,
      },
    ],
    "350": [
      {
        "Name": "恶灵府邸静语庄园",
        "Type": "macro",
        "Text":
          "50庄园\n老一庄园的小丑 T拉住小怪 DPS集火即可\n老二阿修 BOSS有顺劈 正面不要有人 注意躲避AOE和旋转剑 小怪出场请转火\n老三哈利卡纳苏斯 小怪请第一时间转火 否则会有灭团级AOE 第二次小怪刷新后 DPS酌情停手等第三波刷新后击杀",
        "Editable": false,
      },
    ],
    "1063": [
      {
        "Name": "幻龙残骸密约之塔",
        "Type": "macro",
        "Text":
          "50幻龙\n老一独爪妖禽 T把BOSS放在场边 请打飞水箱 DPS和H注意身后和四周也不要有水箱\n老二魔导炮艇 BOSS会随机点名一名玩家飞过去并沿途扔一堆火圈 被点名的玩家最好前往场边引导火圈的位置 \n老三尘世幻龙 场地上有两条小龙 BOSS血量下降到一定程度后就会复活小龙 第一条龙需要远离BOSS 而第二条龙需要接近BOSS \n小龙打到一定程度后 会刷新一个魔导机器 第一时间集火 场地上出现全场蓝色的范围AOE时 打开魔导屏障发生器 并且躲进去",
        "Editable": false,
      },
    ],
    "1062": [
      {
        "Name": "凛冽洞天披雪大冰壁",
        "Type": "macro",
        "Text":
          "50大冰壁\n老一冰锥万迪尔 “风雪”之后2~4s会出现暴风雪，保持移动或跳跃可以避免被叠buff。爆弹怪爆炸也会叠buff，4层就会被冻住，并持续掉血。\n中间有暴风雪的区域，不要站在里面，会持续掉血。\n老二大脚雪人，需要T把BOSS拉到场边，并面向场中。场上会刷两种小怪，魔石精不打，BOSS会读条超大范围扇形攻击，把魔石精冻成雪球。当BOSS读条全屏AOE时，需要打一下雪球将其推向BOSS打断。DPS第一时间击杀小怪。\n沿途注意打断的异端者读条“龙血”\n老三芬里尔 偶数次冰柱掉下来之后，躲在仅剩的一根冰柱之后。\n",
        "Editable": false,
      },
    ],
    "160": [
      {
        "Name": "领航明灯天狼星灯塔",
        "Type": "macro",
        "Text":
          "50灯塔\n老一不沉者 西蒙德 出啥打啥\n老二祖 别碰鸟蛋 鸟蛋过一段时间就会孵化 先打公的\nBOSS上天后所有人远离T\n老三暴君 直接打即可\n塞壬 T开怪后把BOSS放在场中央背对人群 优先击杀 爬行小怪\nBOSS读条“死者之歌”后 奶妈需要奶满有BUFF的玩家 注意躲避俯冲",
        "Editable": false,
      },
    ],
    "349": [
      {
        "Name": "骚乱坑道铜铃铜山",
        "Type": "macro",
        "Text":
          "50铜山\n老一百臂主脑巨人 T把BOSS带走到没有火的地方 刷新爆弹怪需要DPS第一时间击杀\n老二比吉 需要DPS启动装置 捡起炸弹 并放在BOSS脚下 炸弹炸几次之后 BOSS就会从石头人上下来 此时全员攻击BOSS即可\n老三复仇者 乌拉诺斯 开场T把BOSS拉到场地边缘 屏幕提示“沙虫在找吃的”时 奶妈或者远程DPS把水晶搬到沙地上 \nDPS优先击杀小怪",
        "Editable": false,
      },
    ],
    "367": [
      {
        "Name": "苏醒遗迹喀恩埋没圣堂",
        "Type": "macro",
        "Text":
          "50圣堂\n老一受损的审判化身 开战后不久 会有某个部位发光 集火该部位即可\n途中的蛇会石化需要注意\n老二仙人刺女皇 BOSS读条“十万针刺”时 需要集火攻击打断咏唱 场上出现“仙人掌守卫” 先打掉守卫接下来马上集火BOSS\n老三审理神代言者 四周会升起棺材 里面会跑出木乃伊 躲开它的直线前进方向 BOSS读条“怨恨的斩击” 是对随机一名玩家的直线范围AOE \nBOSS还会随机连线一名玩家 被连线的人远离BOSS 绕场狂奔",
        "Editable": false,
      },
    ],
    "434": [
      {
        "Name": "冰雪废堡暮卫塔",
        "Type": "macro",
        "Text":
          "51暮卫塔\n老一角牙古象 出啥躲啥\n沿途走过去就有很多怪会爬起来打你\n老二寒光剑 尤埃尔默里克  BOSS每使用一次全屏AOE，就会随机复活2只小怪，小怪站起来后，会立刻读条对它周围的怪释放增益buff。当发现小怪在BOSS身边复活时，T要注意把BOSS带走。\n沿途有暴风雪的地方会对全团施加不断掉血的伤害。\n老三狮身巨鹰，场地上会有2~4块石头，当BOSS跳回场地中央读条“回转牢狱”时，所有人立刻就近找石头躲避，否则会被吸入中间的龙卷风里并造成大量伤害。BOSS的凛冬之风会摧毁石块。",
        "Editable": false,
      },
    ],
    "1064": [
      {
        "Name": "天山绝顶索姆阿尔灵峰",
        "Type": "macro",
        "Text":
          "53灵峰\n一优先击杀龙毒草。打完后远程点掉途中的毒粉块。吃到爆炸会中毒\n老一破锁花王 直接打BOSS，无视蜜蜂。\n沿途会有大龙突然降落。冰柱和冰元精都可以无视。\n老二迈斯龙，隔一段时间会出现一大堆粘液，红色分摊蓝色单吃，绿色粘液读条会对全团造成大伤害。\n老三刁曼 头顶出现绿色彗星之后，被点彗星的玩家远离人群放下彗星，然后迅速返回。打到一半后，BOSS会停在场中央不断放AOE，全员攻击两个翅膀。",
        "Editable": false,
      },
    ],
    "1066": [
      {
        "Name": "圣教中枢伊修加德教皇厅",
        "Type": "macro",
        "Text":
          "55教皇厅\n老一光辉剑 阿代尔斐尔 满场乱窜留下光球，光球过一会就会炸开\n老二战争狂 格里诺 正面有顺劈，要注意。T把BOSS放中场，BOSS会点名一名玩家方向放黑洞，接近黑洞就会被连线并持续掉血。当BOSS气泡说要把你们都吹飞时，玩家会被击飞。\n老三圣骑士沙里贝尔 被连线的两名玩家需要向相反方向移动扯断(只有一个人跑是扯不断的)，场地北边会刷新棋子士兵，注意溜缝躲避。当BOSS消失之后所有人一起输出场上刷出来的“圣火”。",
        "Editable": false,
      },
    ],
    "1065": [
      {
        "Name": "邪龙王座龙巢神殿",
        "Type": "macro",
        "Text":
          "55龙巢\n老一琅妲巫龙 当发现自己被BOSS连线时，跑到石柱附近，把线传递给石柱即可。\n沿途会遇到大龙+两只小龙，T只把小龙带走就行了，大龙不必招惹。\n老二格亚斯库图斯 爆弹怪吃掉两三层气体后，注意转火打掉爆弹怪。\n老三尼德霍格，BOSS会转身向玩家吐火球，注意发现BOSS面冲自己就要及时躲闪(不会有提示)，BOSS偶尔会点名玩家“漆黑之珠”，因为BOSS会顺劈，所以请T不要乱动，由另一名DPS和奶妈打掉珠子解救。BOSS上天后，所有小龙都要及时击杀。如果DPS太慢，奶妈酌情给大师兄(NPC)加一加血。最后一条小龙击杀后，大师兄会开启一个罩子，躲里面等BOSS回来即可。",
        "Editable": false,
      },
    ],
    "416": [
      {
        "Name": "学识宝库迦巴勒幻想图书馆",
        "Type": "macro",
        "Text":
          "59图书馆\n老一恶魔书墙 注意躲开地上黑色的伤害。当BOSS合上之后，跑到书背后去。\n沿途会遇到64页优先击杀。\n老二比布鲁斯 BOSS回到场地中央后，打落在场上的书，打掉之后书会与一名玩家连线，这名玩家带着线穿过BOSS，让连线的球与BOSS相撞，就可以解除BOSS的无敌。\n老三永世珍本 点名跑到场边放球，当BOSS回到场中央并开始读条时，场地四周的圆阵也会发光，需要所有人去踩灭光点。每个阵N个点，所以需要N名玩家同时去踩才行。",
        "Editable": false,
      },
    ],
    "430": [
      {
        "Name": "博物战舰无限回廊",
        "Type": "macro",
        "Text":
          "60战舰\n老一 幻影光 出啥躲啥。BOSS会释放连续1/4场面积的AOE，建议远程职业也接近BOSS，方便躲避。\n沿途大鸟人会AOE旋风比较疼，奇美拉冰远离雷接近优先击杀。\n老二 弥诺陶洛斯 横扫绕背侧，回转远离。当BOSS开始横冲直撞之后，注意关注BOSS最后停下的位置和面向，它会立刻使用正面小扇形巨疼AOE，需要绕侧背躲避。当BOSS读条全屏AOE时(场地变蓝)，随手开一个培养皿打断读条…DPS击杀小怪。\n老三 博物总管 远离地上的红圈地雷不要碰到。BOSS会给玩家身上挂炸弹buff，需要奶妈驱散，否则会炸到队友。场边出现警报小怪时，需要转火击杀。",
        "Editable": false,
      },
    ],
    "511": [
      {
        "Name": "草木庭园圣茉夏娜植物园",
        "Type": "macro",
        "Text":
          "60植物园舰\n老一玫瑰园 这个BOSS会放出几个小魔界花苗，然后大大小小一家子一起喷，BOSS会一边喷一边转，但是不会喷满一圈，所以找到BOSS的方向，转到它喷的末点就不用跑了。场上出现名为果实的气球的时候，注意转火击杀(不打的话会炸掉，不过也没有很疼)。\n老二鹰蜂女王，平时场边会有很多蜜蜂飞来飞去打人也挺疼。BOSS读攻击指令时，出啥躲啥即可。BOSS读防御指令时，周围的蜜蜂会来到场地中央与BOSS连线，此时要打掉所有蜜蜂。BOSS读协作指令时，场周围的蜜蜂会4只一组并排，此时要离开蜜蜂连面对的方向，它们会向场地内放无提醒的十字或X形的AOE，所有人贴场边站在两组蜜蜂中间即可回避。\n老三剧毒美人 没啥特别的，出啥躲啥，有啥躲啥，眼睛记得背对",
        "Editable": false,
      },
    ],
    "557": [
      {
        "Name": "黑涡传说破舰岛",
        "Type": "macro",
        "Text":
          "60EX破舰岛\n牛和长须豹会在脚下放buff圈，所有人优先击杀，T注意把怪带出buff圈。\n老一红血圣女团 一堆小怪，长须豹请优先击杀。其他出啥躲啥。\n老二尤弥尔，被点名一万伏特的玩家踩水，连线扯断。\n老三爱因扎尔·斯拉菲尔辛正漩将 变身后会在场周围的宝箱里放入药和炸弹，注意观察哪些是解药，并在箱子关闭后走到那个箱子附近解毒。BOSS还会点名一名玩家并读条，这名玩家需要远离其他人，治疗注意准备驱散这名玩家身上的减速buff。",
        "Editable": false,
      },
    ],
    "615": [
      {
        "Name": "坚牢铁壁巴埃萨长城",
        "Type": "macro",
        "Text":
          "60长城\n浮空装甲会随机连线并持续攻击，弓箭手小怪会无视仇恨给玩家上毒，拉多了非常容易团灭。\n老一魔导猎手 出啥打啥出啥躲啥。\n老二武装重甲，BOSS会隔一段时间读条“运动物体探知干扰器”，读条结束后会给所有玩家上buff“慎行警告”，所有人立刻停手，不要移动、转视角，近战和物远请按ESC直到弹出系统对话框。等buff倒计时结束后就可以移。\n老三铁面公卿，他会突然跑到场地一边对大半场放AOE，所以所有人尽量接近中场站以方便躲避。当天降一堆刀并出现满场AOE时，所有人打中间那把刀即可制造躲避的空间。其他的出啥打啥有啥躲啥。",
        "Editable": false,
      },
    ],
    "420": [
      {
        "Name": "空中神域不获岛",
        "Type": "macro",
        "Text":
          "60不获岛\n进门跟NPC拿东西开传送点\n老一奴涅努克怪鸟 出啥打啥，出啥躲啥。BOSS消失需要玩家找到“奴涅努克之影”，站在怪圈里面才能攻击到它，打掉后浓雾就会散去。\n老二卡努瓦努 当发现黑圈里有图腾时，需要玩家把圈内的图腾搬出去。\n老三招雷巨蛇 场第四周会掉下去而且不能救。BOSS会点名一名玩家放一个水泡，被点名的人站到BOSS身下。出风元精尽快打掉，击杀后BOSS会立刻读条吹飞并且变得可以被攻击，不要被吹下去",
        "Editable": false,
      },
    ],
    "578": [
      {
        "Name": "秘本宝库迦巴勒幻想图书馆",
        "Type": "macro",
        "Text":
          "60图书馆\n老一 书中恶魔 出啥躲啥。\n老二液态火焰 被连线冲锋的远离，BOSS变为火龙卷时会点名正负极，和BOSS同极接近，异极远离；变为手掌时攻击上升。头顶出现太阳月亮徽章，找同色地板躲避。\n老三博学林鸮 爆震之章→随便踩一本浮空；龙卷之章→踩黑色的圈；河童之章→变成河童之后踩绿色的圈。BOSS扔完一圈书之后会召唤贝爷，如果DPS不够的话记得注意在陨石后面躲噶哦哦。",
        "Editable": false,
      },
    ],
    "519": [
      {
        "Name": "神圣遗迹无限城市街古迹",
        "Type": "macro",
        "Text":
          "60EX无限城\n老一阿卡莫特 BOSS读条“幻惑鳞粉”时，所有人都要转身面向场外，这个技能会制造玩家的幻象，并放出超大范围的AOE攻击\n沿途会遇到巨大的光圈照在地上，T注意把怪都放进去。\n老二双翼飞狮 出啥打啥，尤其BOSS身下的球，优先打掉。地上会出现土风圈，玩家会被上耐性降低的buff，土降低的踩风，风降低的踩土\n老三基路伯 死了还会复活的渣渣。第二次复活之后优先击杀连线小怪。它还会读条圣疗，并在脚下出个魔法阵，站进去的人越多，伤害越少。",
        "Editable": false,
      },
    ],
    "555": [
      {
        "Name": "天龙宫殿忆罪宫",
        "Type": "macro",
        "Text":
          "60忆罪宫\n老一长老莫古灵 优先击杀即可护卫团长莫古森。如果团队DPS较高，可以无视剩下两个小怪。另外BOSS也会召唤复活圈，注意把小怪推出去。\n老二卜奇喇吉 T把BOSS放在场地一头，BOSS过一会就会起飞，记得找墙做掩护。BOSS读条类星射电源和雷云都是会破坏墙的，发现这两个技能的时候尽量找没墙的地方站。\n老三圣龙子嗣 场地是一个3X3的石台，有小旋风作为传送点。有单点一名玩家的连续攻击，预兆大概是全屏白光一闪，当你发现自己身上有白色光柱哐哐哐砸的时候，就是被点名了，注意换个地方。BOSS隔一段时间会起飞并俯冲，当出现俯冲的黑绿光之后，离开台子即可。台子上的圣元精可以提供大量LB，如果台子上有记得顺手击杀。",
        "Editable": false,
      },
    ],
    "617": [
      {
        "Name": "天山深境索姆阿尔灵峰",
        "Type": "macro",
        "Text":
          "60EX灵峰\n地上会喷气儿，把怪放在那个喷气孔附近可以获得易伤buff。\n老一莱顿瓦德 它会在地上扔孢囊，躲开即可，大号的孢囊是全屏伤害距离衰减。\n老二高牢怪龙 抬手是打T，抬尾巴可能是扫尾，也有可能扫一圈(没事不要站屁股后)，侧身单肩下垂是冲刺，双手抱胸是吐火球或喷火(躲开正面)。BOSS血量下降到一定程度后，BOSS会变红，抬手横扫一片带旋风，扫尾变大回旋，并附带承疗减低效果，注意躲避。\n第一时间击杀圣山之血，如果有两只就由T标号依序集火击杀，这个读条可以击晕打断。治疗注意抬血。\n老三熔岩蝎 “飞跃重压”会让场上出现巨大的熔岩地带，被点名的玩家注意尽量站到场边。BOSS读条“呼唤”会召唤小怪，优先打红的，第二次呼唤时会召唤4只小怪，远程DPS可以预读LB",
        "Editable": false,
      },
    ],
    "572": [
      {
        "Name": "险峻峡谷塞尔法特尔溪谷",
        "Type": "macro",
        "Text":
          "60溪谷\n地上的AOE圈对小怪同样有伤害，但不必强求\n老一飞天枪 奴扎尔·怀罗克，BOSS升天后，会出现小怪和气球炮塔，打掉气球炮塔后需要到BOSS身下，等着气球爆炸。气球的气浪会帮你把BOSS戳下来。然后出啥打啥，有啥躲啥。\n猩猩会120°AOE…注意不要站太远，地刺是有伤害的。沿途有猪笼\n老二旋风扇 德托里·西罗克，被点名的玩家尽量把点名的风放在两个挡板之间，BOSS读条“大扇风”的时候，自己找有挡板的位置站好等着被吹飞 。BOSS读条“身轻如燕”后使用的技能非常快。\n沿途会看到气球载着一大堆鸟人飘过来，气球要第一优先击杀，如果没有打掉，它就会回去载第二批鸟人。\n老三晴天霹雳 托佐尔·法托特尔，出啥躲啥，分散集合。",
        "Editable": false,
      },
    ],
    "516": [
      {
        "Name": "星海空间颠倒塔",
        "Type": "macro",
        "Text":
          "60颠倒塔\n老一歌圣 兹罗·罗格，呱呱爱唱歌，眩晕可驱散，解救T爱他，水泡要躲开，变呱打呱呱。\n老二瑞吉 场地上出现大石头和不断扩大的AOE圈时，不要害怕，赶紧打掉石头然后再找安全的地方躲避即可。被连线的玩家要躲在石头后面，并与石头保持一段距离防止受伤。\n老三卡尔克布莉娜 进门6个娃娃都没仇恨，快速抽掉即可。合体后变成一个大娃娃。当玩家被点名大眼睛技能时，BOSS会对这名玩家施加扇形AOE，背对即可。当它读条抱头防御后，所有人(包括法系)都只能站在它正面输出，否则就会被弹飞。当有人变成娃娃后，记得及时解救(尤其记得救奶妈…)",
        "Editable": false,
      },
    ],
    "438": [
      {
        "Name": "血战苍穹魔科学研究所",
        "Type": "macro",
        "Text":
          "60研究所\n老一 雷古拉·范·休著斯 出啥打啥，出啥躲啥\n沿途路上会遇到一个球卡在台子上的怪，会放全场AOE电疗，DPS优先击杀，四周的培养皿会刷新小怪，T注意拉住小怪\n老二 赫鲁玛奇斯 蛇就是疼，奶妈注意抬血。第二个会读条石化需要背对，另外会随机点名扔火圈。脚下出现一个金色小圈圈需要另外一个人站在里面(一共2个人)，否则被定身的人会受到高额伤害。头顶出现红色细线需要分摊。\n老三 拉哈布雷亚和以格约姆 随便先打哪个都行。冰球一炸，就往原来冰球的地方跑…BOSS血量下降到一定程度后，会合体来到场中央，并连线一冰一火两个球，优先打冰球。当BOSS读条“法则改变”的时候，所有人躲到黑洞里躲避即可(黑洞只能容纳1人)。",
        "Editable": false,
      },
    ],
    "626": [
      {
        "Name": "漂流海域妖歌海",
        "Type": "macro",
        "Text":
          "61妖歌海\n一波小怪拉到右舷莉塞的位置，她会帮你放一些AOE。\n老一 卢加特 出啥躲啥，记得分摊。\n老二 狱长 出啥躲啥。DPS被抓后立刻远离BOSS扯断身上的影子。\nBOSS前的守门怪读条“诱惑啸声”时，请使用眩晕打断，否则接下来会容易受到大量伤害。\n老三罗蕾莱，它会读条让玩家强制前进或后退，当发现BOSS读条时，看清方向，调整面向，避免自己走进蓝圈里即可。",
        "Editable": false,
      },
    ],
    "616": [
      {
        "Name": "海底宫殿紫水宫",
        "Type": "macro",
        "Text":
          "63紫水宫\n老一切网虾蛄 打掉切网虾蛄的脚，BOSS就会肚肚向上…出现小怪后优先击杀小怪，头顶蓝色圆球时跟其他人分散。\n老二红玉公主 当BOSS读条诱惑时，前往BOSS四个角落的箱子里变成老朽…就不会被诱惑了。BOSS使用海底火山后，会有大伤害技能追着被点名玩家跑，请狂奔回避。\n老三紫水妖妃 BOSS下水之后会出现3个祸泡，为玩家叠3层掉血buff，打掉一个减一层。打掉泡泡之后，注意水面的波纹，躲开BOSS即将出现的地方。",
        "Editable": false,
      },
    ],
    "623": [
      {
        "Name": "试炼行路巴儿达木霸道",
        "Type": "macro",
        "Text":
          "65霸道\n熊和牛打人都非常疼，建议慎重拉怪。\n老一加鲁拉 冲锋伤害为距离衰减\n老二巴儿达木巨像 真·出啥躲啥\n老三胡鹰 出啥躲啥，大眼睛背对。小怪阶段，BOSS会出现在场外并向场内冲锋，小怪出现在哪，冲锋就从哪里开始，注意躲避。BOSS第二次上天并落地后，所有人集火双翼。",
        "Editable": false,
      },
    ],
    "660": [
      {
        "Name": "解放决战多玛王城",
        "Type": "macro",
        "Text":
          "67多玛\n小怪很疼。\n老一 魔导后卫 出啥躲啥\n老二魔导六轮装甲 注意踩塔，不要撞电网，宁可炸塔也不要变成弹珠。\n老三强化格林瓦特 BOSS读条“链锯”后，T挪一步离开原位即可躲避。当发现自己成为落点中心的时候，远离人群找个角落，等落点确认后返回人群集合即可。BOSS扫射是单独点一名玩家支线AOE，不可回避，尽量不要牵连到其他人。",
        "Editable": false,
      },
    ],
    "661": [
      {
        "Name": "巨炮要塞帝国白山堡",
        "Type": "macro",
        "Text":
          "69白山堡\n老一魔导机车大魔 当BOSS开始冲锋时，打掉炮塔旁边的帝国兵，并趁BOSS规划路径时开炮即可\n老二024号 踩完塔后BOSS会读条“护盾转换”，并喊话“XX属性以太充能中……护盾转换！”，未被充能的属性即是它的弱点，去踩对应颜色的圈再攻击BOSS即可，如果属性不对，对BOSS的攻击就会被反弹。\n老三炼狱炎魔 基本上是出啥躲啥有啥打啥，但是在战斗中BOSS会经过强化，被强化后的BOSS打人更疼。发现流血buff记得及时驱散。",
        "Editable": false,
      },
    ],
    "689": [
      {
        "Name": "鏖战红莲阿拉米格",
        "Type": "macro",
        "Text":
          "70阿拉米格\n老一守卫机蝎 出啥躲啥\n老二奥卢斯·玛尔·亚希纳 BOSS核心技能会让你灵魂出窍，需要找回身体。碰到激光会被眩晕，而碰到浮游爪会被推远\n老三 芝诺斯·耶·加尔乌斯 和BOSS连线的人接近BOSS，并向场外或无人的方向引导BOSS的扇形AOE。风断一闪接近风球等待被吹飞，雷切一闪远离，妖刀一闪分散引导直线AOE。偶尔会有连线+风闪的情况，请保持站在风球与被连线NPC之间，接近风球的位置引导躲避。打到一定程度后，BOSS会拔出3把妖刀，DPS请火力全开集火妖刀，打的越快，接下来AOE伤害越低。另外打刀的同事，BOSS还会释放3种一闪，注意应对。",
        "Editable": false,
      },
    ],
    "731": [
      {
        "Name": "沉没神殿斯卡拉遗迹",
        "Type": "macro",
        "Text":
          "70斯卡拉\n老一 凯尔派 开打后场边会变红，不能踩进去。“鱼雷”是死刑。“水平面上升”是AOE，BOSS会读条“水力吸引”或“水力推行”，所有人吸引远离推行接近。另外BOSS还会点名一个红圈，需要玩家把它放在场边，放下后立刻远离，这个球会跟着玩家走(如果撞上被连线玩家则会持续掉血)。\n老二 旧日灵偶 BOSS隔一段时间会无敌并连线若干个灵偶分身，第一次需要玩家打掉，第二次开始，玩家会被变身为魔石精，技能栏变为放炸弹。需要用炸弹把分身都炸死\n沿途平台之间有深沟，需要击倒所有小怪后，站在魔法阵上，就会获得一个变身buff，并变成赞比托飘过去。\n老三 直言不讳 赫罗德里克 抬手/抬起尾巴，则需要躲开正面/背面。当BOSS出现抱胸蓄力的动作时，注意躲开BOSS正面",
        "Editable": false,
      },
    ],
    "662": [
      {
        "Name": "恶党孤城黄金阁",
        "Type": "macro",
        "Text":
          "70黄金阁\n老一瑞光丸 被小怪连线的玩家接近场边，或与另一只小怪接近击杀，方便躲避小怪自爆。别的没啥要注意的。\n沿途遇到会通灵术的忍者请第一时间击杀。\n老二道顺丸 出啥躲啥\n老三 保镖 打到一半，场外老板就开始撒钱，在BOSS的狗捡完钱之前把钱捡完即可，否则剩的钱越多，AOE越疼。天上落下蝴蝶之后，先站外侧躲避，再前往内场躲避即可。龙头不打也没事，但会妨碍捡钱。",
        "Editable": false,
      },
    ],
    "768": [
      {
        "Name": "风水灵庙岩燕庙",
        "Type": "macro",
        "Text":
          "70岩燕庙\n老一 大天狗 BOSS会召唤全场火球，撞上一次火球会叠一层易伤。看到BOSS身上有个大眼睛的话记得转身。\n老二 大太法师 推荐所有人接近BOSS站位，当BOSS抬手时，立刻到反方向躲避。DPS发现自己身上出现点名时，注意保持移动(会连续5次从地下扎出石柱)。当BOSS把场中央砸出一滩水之后，所有人注意尽量在前半场活动，防止扇形AOE无处可躲，那一滩水会逐渐扩大，不要踩进去。\n老三 齐天大圣 当BOSS读条如意大旋风并伸长金箍棒时，所有人注意观察棒子，若棒子巨长而且带火花闪电，则接近BOSS；如果棒子不是特别长并且没有特效，则远离BOSS。后半场BOSS会一分为二并同时使用这个技能，注意找棒子带有电光的大圣身下躲避。",
        "Editable": false,
      },
    ],
    "743": [
      {
        "Name": "疯狂战舰无限回廊",
        "Type": "macro",
        "Text":
          "70EX战舰\n米诺陶回转攻击(读条远离)，奇美拉的冰雷(冰远离雷接近，可以打断)需要注意。\n老一浮游炮主板 大部分时候是出什么躲什么，当魔导浮游炮并列一列的时候，注意要躲到炮筒后面去。\n老二究极战士 平时会有蓄力正面直线AOE，有读条和非常明显的蓄力绿球。女神的技能是黑白圈，需要被点名黑白圈的人重叠站位。鬼神的技能则是冰焰之纹，踩颜色相同的圈。魔神的技能是点名玩家到场边放点名，点名的球会慢慢变大，注意不要踩到。其他出啥打啥\n沿途会有米诺陶撞墙\n老三究极神兽 BOSS抬手远离BOSS，BOSS起立到身下躲避。BOSS会随机点名一名玩家释放8方向箭头的波动炮攻击，其他人注意远离。当T身上出现白色向外的箭头时，其他人要注意远离T(伤害随距离衰减)。",
        "Editable": false,
      },
    ],
    "742": [
      {
        "Name": "红玉火山狱之盖",
        "Type": "macro",
        "Text":
          "70红玉火山\n老一 大岳丸 经典技能百吨回转注意远离BOSS。BOSS会把自己手中的武器丢到场上，然后点名一名玩家追着他吐岩浆，被点名玩家注意绕场奔跑，不要被呕吐物砸到。另外所有人也要注意远离BOSS丢在地上的武器，BOSS吐完会捡起武器接着打。\n老二镰鼬，远程也稍微接近BOSS站，BOSS会使用半屏AOE，如果站的太远可能来不及躲避。BOSS上天之后注意一边躲避场上的各种风、线一边打小怪，BOSS会沿着连线的顺序冲刺，务必当心。\n老三玄武，基本上是出啥躲啥，有圈分散。特殊的技能是迷潮，场地上的六边形地砖会出现箭头的形状，并且其中一块地砖上有一个水球，水球会按照地砖上的箭头所指的方向前进。观察水球的位置和地砖上的箭头来回避水球的行进路线。",
        "Editable": false,
      },
    ],
    "789": [
      {
        "Name": "死亡大地终末焦土",
        "Type": "macro",
        "Text":
          "70终末焦土\n道中会有落石\n老一 赫德提特 被点名的玩家要躲到柱子后面，全屏AOE也要躲到柱子后面；点名所有玩家不要让圈罩上柱子\n老二 次品无人机 被点名的玩家去场边放毒，当BOSS从侧面消失后，冒着烟那条跑道就是安全的。\n老三雾龙 被蓝色标记点名的玩家注意尽可能往场边站，治疗准备驱散+抬血，非常疼。BOSS雾散之后会出现3只小怪，此时攻击BOSS就会直接被冻住。\nBOSS使用浓雾之后会消失，玩家开启疾跑沿场边奔跑寻找雾龙",
        "Editable": false,
      },
    ],
    "788": [
      {
        "Name": "污染庭园圣茉夏娜植物园",
        "Type": "macro",
        "Text":
          "70EX植物园\n老一 泥口花 放180°范围的AOE是多次判定的，不要提早回去。\n老二 拉哈穆 核心技能滑坡，场地上会出现箭头传送带，读条结束后击退。\n沿途有水闸，可以放水洗怪\n老三 枯腐泥妖 当地面下污泥涌动时，所有人站在绿色实地板上。当BOSS读条污泥并出现点名范围圈时，所有人站在网格地板上。BOSS召唤泥丸子小怪，这个小怪会被玩家的任意有初始伤害的技能击飞，需要由玩家把它打到绿色实地板上，不要让下面喷出来的泥，或者上面点名掉下来的泥碰到它，也不要让BOSS或者小怪的攻击打到它。",
        "Editable": false,
      },
    ],
    "663": [
      {
        "Name": "修行古刹星导寺",
        "Type": "macro",
        "Text":
          "70星导寺\n老一凶豹所闻，凶豹所忆，刚开场的时候只有一只，在打到一定程度后第二只才会登场，T注意及时拉怪。后出现的红豹子会用扇形AOE，比较麻烦，需要关注。\n沿途小怪不要放在机关上打，近战会感谢你。\n老二额部陀，BOSS会使用“前后双斩”和“左右双斩”，斩前后躲两侧，斩两侧躲前后即可。BOSS读条“预判”后，会立刻出现动画效果，3面护盾，只有一面可以攻击，注意方向(法系也要注意)。头顶太阳月亮标记时，找同色发光地板即可。\n老三双豹伊沃恩，被点名的玩家会遭到一次巨大伤害，奶妈注意抬血，由于固定点名距离最远的玩家，所以如果有远程DPS的话可以适当引导。当BOSS与场上斗气连线时，所有玩家去撞球，全部撞掉则AOE伤害较小。",
        "Editable": false,
      },
    ],
    "885": [
      {
        "Name": "哈迪斯孤念歼灭战",
        "Type": "macro",
        "Text":
          "极哈迪斯\n■P1散开　　 　　　■陨石(塔)処理\nD3　MT　D4　　　北→东：MT　南→西：ST\nST　◎　　D2　　 　■牢狱\nH1　D1　H2　　　西北H1　东南H2\n■分摊 ←MT/D1/D3/H1 　ST/D2/D4/H2→\n■接线 北：T 南：H\n■法则改变　　　 　■殉教者的记忆\n　　D4/MT　　　　　　D1　D2\nD3H1 ◎ H2D2　　 ST/H1 ◎  H2/MT\n　　D1/ST　　　　　 　D3　D4\n(※TH站点上（地标线○的交点）)\n■魔法记述阵 圆：没有的缺口\n镜子：没有的缺口对向的缺口/中央镜子背面的缺口\n■深淵　←ST/D1/H1| ↑ | ↑ | MT/D2/H2→ (分摊)\n　　　　　　　  ← D3 (放球) D4 → ",
        "Editable": false,
      },
    ],
    "373": [
      {
        "Name": "惨剧灵殿塔姆·塔拉墓园",
        "Type": "macro",
        "Text":
          "EX墓园\n老一证婚人，不要打任何小怪，不要用任何AOE技能，站在一起等BOSS放技能打掉小怪即可。\n沿途要把的怪都打掉才行。调查棺材会眩晕开棺材的人并读条AOE，需要眩晕打断\n老二备用的躯体，黑洞需要玩家去撞掉，无减伤裸吃的话最多吃2个，奶妈要注意加血。大球建议2~3名玩家一起去撞。BOSS会点名淤泥，T注意带位，自己不要站进去，给DPS留出输出空间。中间的NPC不能死，如果血量过低可以考虑奶妈加血。\n老三雄壮的OOO，中央发黑的区域不要去，会持续掉血。过一段时间场周围会出现一堆小怪，需要所有人迅速击杀，小怪爬到场中央后会点亮符文，一般点亮4~5个之后就很容易团灭了。",
        "Editable": false,
      },
    ],
    "362": [
      {
        "Name": "纷争要地布雷福洛克斯野营地",
        "Type": "macro",
        "Text":
          "EX野营地\n老一青蓝之手指挥官 连线可以传递 注意躲好十字雷 \n老二3号哥布林装甲 出啥躲啥 有随机点名冲锋 躲开路径即可 \n老三6号哥布林坦克 BOSS打一会就会绕场旋转 转火小怪 \n接下来BOSS会往场里扔炸弹 需要用技能把炸弹打到场边去",
        "Editable": false,
      },
    ],
    "363": [
      {
        "Name": "腐坏遗迹无限城市街古迹",
        "Type": "macro",
        "Text":
          "EX无限城\n老一腐坏贪吃鬼 BOSS每过一段时间会吞下一名玩家 需要剩下的人集火贪婪大口\n老二阿里奥克 开场只有小怪 需要由T独自击杀小怪 DPS尽量不要碰小怪\n老三迪亚波罗斯 开场场边会有8个门 开怪之后门上会出现标记 相同图案两两一组 一共4组 \n门上的图案过几秒就会消失 正攻需要除了T的3名玩家使用游戏的目标标点功能 对门做标记以作应对 \n“噩梦”需要打断 “破灭预兆”需要打开图案相同的两扇门 以躲避接下来的巨大伤害 ",
        "Editable": false,
      },
    ],
    "365": [
      {
        "Name": "激战城塞石卫塔",
        "Type": "macro",
        "Text":
          "EX石卫塔\n老一格里尼奇恶龙，当BOSS跑到场边的时候，立刻到身后\n沿途“激昂异端者”会读条“龙血”，需要使用眩晕打断\n老二库卡龙龟 当BOSS读条变硬时，会反弹弩炮的攻击。当BOSS读条全场AOE的时候，需要使用弩炮的第二个技能“雷弹”打断(平时不要使用)。\n老三吉鲁维伽诺斯。BOSS抬手是正面顺劈，抬屁股是背面顺劈，双手抱胸离开正面方向，单手护胸侧身是直线冲刺，还会无提示喷火。",
        "Editable": false,
      },
    ],
    "360": [
      {
        "Name": "剑斗领域日影地修炼所",
        "Type": "macro",
        "Text":
          "EX修炼所\n老一皮拉刻蒙 BOSS读条百吨横扫时 T穿背躲避 百吨回转所有人远离BOSS\n当场地变蓝时 点BOSS身后的装置 所有人去吃魔法人偶身边的buff\n老二卡托布莱帕斯 当BOSS读条“恶魔之瞳” 吃场边的幽暗珠 出现“不净的魔眼”需尽快击杀魔眼\n老三退位主教 穆穆埃珀 T拉好开场小怪 主教会随机定身2名玩家 需要自由的玩家触摸咒具解开束缚\n请务必去救人",
        "Editable": false,
      },
    ],
    "387": [
      {
        "Name": "逆转要害沙斯塔夏溶洞",
        "Type": "macro",
        "Text":
          "EX溶洞\n老一真红龙虾 所有人稍微分散一些站位，被吐痰的玩家需要奶妈驱散。BOSS还会读条螺旋尾对目标玩家造成巨大伤害(大约90%)，可以打断。\n沿途 水泡接触到XX怪会给XX怪加很多血。\n老二麦迪逊原船长 当BOSS标记一名玩家并射击的时候，需要集火BOSS打断。召唤的小怪打人并不疼，注意先打地上爬的就可以了(它会定身)。\n沿途的大怪会召唤一大堆小怪\n老三克拉肯 打腕足，腕足都打掉之后再打本体即可，触手可以不打。",
        "Editable": false,
      },
    ],
    "188": [
      {
        "Name": "武装圣域放浪神古神殿",
        "Type": "macro",
        "Text":
          "EX冬贝利\n老一折角骑士 寇黑加 老一每隔一会就会往地上扔一把标枪 注意及时转火打掉标枪 \n老二湿皮妖师 佐尔加 会满地插图腾 图腾有4个效果：变蛙、伤害增加、火耐性降低和加重\n颜色和效果的对应每次进本都是随机的 需要找到伤害图腾且踩掉\n老三光鳞兄弟 莫拉加加 当BOSS插战旗时 T要带着BOSS离开战旗范围 而插祭器时 需要DPS集火打掉祭器 \nBOSS会随机点名玩家死亡宣告 需要奶妈为该玩家加满血",
        "Editable": false,
      },
    ],
    "159": [
      {
        "Name": "神灵圣域放浪神古神殿",
        "Type": "macro",
        "Text":
          "PT冬贝利\n老一圣地守护者 出啥躲啥 \n打倒冬贝利之后 拾取灯油 开机关用 第四个机关一般由T开疾跑冲过去引怪/冬贝利 奶妈开疾跑跟着过去开\n老二巨大奶冻怪 小怪及时转火清理即可 \n老三冬贝利王 无视小怪直接打BOSS即可 ",
        "Editable": false,
      },
    ],
    "167": [
      {
        "Name": "邪教驻地无限城古堡",
        "Type": "macro",
        "Text":
          "PT无限城\n小怪会读条召唤妖异 眩晕/沉默打断即\n老一夺神魔  出啥打啥\n老二恶魔墙 地板变黑请立刻躲避 躲完黑地板后移动到中央 BOSS会读条击退\n老三阿难塔波嘉 这个BOSS有超巨大范围的扫尾技能 T请侧过来拉\nBOSS读条“天灾降临”时 需要所有玩家躲避到石像之后躲避 ",
        "Editable": false,
      },
    ],
    "142": [
      {
        "Name": "艾玛吉娜杯斗技大会决赛",
        "Type": "macro",
        "Text":
          "艾玛吉娜杯斗技大会决赛\nBOSS各种吹飞，所有人别被吹下去\n拉提丰的T，不要离场边太近\n提丰和章鱼一人一个背对背拉好，先打章鱼\n被变河童之后，去章鱼正面吃泡泡\n会获得湿润，当提丰去场中央放超鼻息的时候\n河童对着老师用河童拳，1层愉悦打一层buff\n打掉8层就能打断BOSS读条\n第二次BOSS会旋转喷气，注意躲避\n拉章鱼的T不要乱跑，继续让河童被洗\n不要被BOSS喷气喷到，会直接掉下台子\n没有河童以后，鼻息所有人往场中央的BOSS跑\n其他的出啥躲啥",
        "Editable": false,
      },
    ],
    "394": [
      {
        "Name": "奥丁歼灭战",
        "Type": "macro",
        "Text":
          "奥丁歼灭战\n出啥打啥，有啥躲啥，解限不躲也死\n减速圈治疗注意驱散\nBOSS 15%以下血读条斩铁剑，LB大招死劲撸",
        "Editable": false,
      },
    ],
    "189": [
      {
        "Name": "邪念妖地无限城古堡",
        "Type": "macro",
        "Text":
          "炒冷饭无限城\n老一安可哈格 T开场注意不要让BOSS面对任何一个石像 当某名玩家被点名时 请立刻躲到石像后 等BOSS伤害连线消失后再出来 \n老二夜魔人 当BOSS隐身时 攻击场上的“幻光球” 踩一下留下光圈获得含光的buff 带有这个buff玩家去找隐身的BOSS 把BOSS炸出来 \n老三弗迪亚 当BOSS回到中场并有小怪连线时 要注意迅速击杀小怪 当玩家被一个粘液胶一样的玩意儿定身时 也请注意解救",
        "Editable": false,
      },
    ],
    "366": [
      {
        "Name": "大桥上的决斗",
        "Type": "macro",
        "Text":
          "大桥上的决斗\n变成青蛙的绕着场边跑，出啥躲啥\n第二阶段某人逃跑后，BOSS会随机点名混乱\n治疗加满血，即可驱散",
        "Editable": false,
      },
    ],
    "369": [
      {
        "Name": "海德拉讨伐战",
        "Type": "macro",
        "Text":
          "海德拉讨伐战\nT别拉在中场，所有人远离中场\nBOSS放恐惧迷雾，所有人去BOSS圈内躲避即可\n小怪ST拉住，打不打都行，小怪远离BOSS\n如果打的慢，小龙记得转火，近战DPS远离正面",
        "Editable": false,
      },
    ],
    "758": [
      {
        "Name": "白虎诗魂战",
        "Type": "macro",
        "Text": "极白虎\n[紫圈]\n　　　     Aー坦克\n　Bー治疗　    CーDPS",
        "Editable": false,
      },
    ],
    "378": [
      {
        "Name": "希瓦歼殛战",
        "Type": "macro",
        "Text":
          "极冰神\n场上结冰请不要进行任何移动！真的会死！\n剑分摊,杖分散,弓背后集合\nST拉小怪,转场完换T\n九连环当前MT开减伤硬吃,不要动！\n分散时,T和近战去前半场,奶妈远程去后半场\n冰河怒击全体远离正面,冰弓点名全体背后集合",
        "Editable": false,
      },
    ],
    "297": [
      {
        "Name": "迦楼罗歼殛战",
        "Type": "macro",
        "Text":
          "极风神\n螺旋气流躲背后,寒风之歌躲石柱后\n羽毛击杀顺序:柔羽—>刚羽,刺羽St挑衅走,请不要打\n分身处理方法:MT拉美翼本体去最北面,ST拉妙翅去最南面\n击杀顺序:妙翅->美翼",
        "Editable": false,
      },
    ],
    "638": [
      {
        "Name": "祖尔宛歼殛战",
        "Type": "macro",
        "Text":
          "极鬼神\n                 ■飞翔一■                                    ■飞翔二■\n                   |      T                                     \\    T\n       D1       |                                     D1     \\                D2\n                   |                 D2                             )一一一一一一\n      D3         |  \\                              D3      /              D4\n                      |     \\      D4                   /      奶妈\n       奶妈       |      \\\n【小怪阶段】读条陨石快速击杀 注意回避恐惧\n【南十字座】人群[除了MT]→右   MT→左\n【蓝色点名】BOSS左侧 右侧打身位",
        "Editable": false,
      },
    ],
    "677": [
      {
        "Name": "须佐之男歼殛战",
        "Type": "macro",
        "Text":
          "极豪神\n■强袭:死刑 ■祸泡:停手\n■八尺镜+晴岚+断海:击退后回来分摊\n■雷云出现后断海不要形成三点一线\n■P2 一T接刀，另一T开减伤撞球，其余人打罩子\n■海岚斩:死刑换T\n■闪电:被点名者跑到场地另一侧\n■石牢点名:集火攻击仇恨列表BOSS上一个的石牢",
        "Editable": false,
      },
    ],
    "295": [
      {
        "Name": "伊弗利特歼殛战",
        "Type": "macro",
        "Text":
          "极火神\n奶妈:灼热咆哮注意点名,灼热去场边,无事站中间\nT:BOSS拉东边,三灼伤快换T\nDPS:先打柱子后打怪,三层易伤快停手\n全体:链子接近,远离灼热奶妈,炎柱至多吃一片",
        "Editable": false,
      },
    ],
    "375": [
      {
        "Name": "拉姆歼殛战",
        "Type": "macro",
        "Text":
          "极雷神\n吃三个电球后扛BOSS,buff到时间补一红,另一个T找机会吃三个电球换T\n被点名混乱去A点集合,其他人分一个人去用电圈电醒\n场上留三个电球,多余的由奶和st收取(每人每次最多两个)\n被连线不要放技能,吃三个电球解除连线\n出小怪集火小怪\n不要和MT站 不要站水里",
        "Editable": false,
      },
    ],
    "720": [
      {
        "Name": "吉祥天女歼殛战",
        "Type": "macro",
        "Text":
          "极美神\n■ 开场先杀左侧小怪\n■ 死刑: 光之奔流  ■ 蓝球: 点名二仇波动炮\n■ 诱惑之腕: 场边放置\n■ 完全拒绝: 接近BOSS ■完全引诱: 远离BOSS\n■ P2小怪需均匀削血，留一点HP\n等待小怪开启以太后立即击杀\n击杀小怪后开启以太防护\n■P3后吃地面球可以增加一次以太使用机会",
        "Editable": false,
      },
    ],
    "524": [
      {
        "Name": "萨菲洛特歼殛战",
        "Type": "macro",
        "Text":
          "极魔神\n【P1分摊】\n左ST治疗　右DPS \n单绿圈接近诱导\n【绿紫圈、巨人化后散开位置共通】\n　 　　BOSS\n　　　  紫(orA标记)\n近1　MT　ST　近2\n　远1　　　　远2\n　 　学　　 白\n小怪大MT　小ST　顺序→小大小小大小\n【巨人化】\n塔(Debuff有)　左坦克治疗　右DPS\n塔(Debuff无)　左MT　右ST\n撼地　左TH　右DPS\nLB（物理远程＞法系）",
        "Editable": false,
      },
    ],
    "364": [
      {
        "Name": "莫古力贤王歼殛战",
        "Type": "macro",
        "Text":
          "极莫古力\n奶妈关注全队状态栏,及时驱散怒发冲冠debuff和莫古乱乱乱debuff\nMT拉壁去左下角,ST拉斧去右下角,小怪3层buff挑衅BOSS换T\n全体小怪平均削血,没事别站中间",
        "Editable": false,
      },
    ],
    "577": [
      {
        "Name": "索菲娅歼殛战",
        "Type": "macro",
        "Text":
          "极女神\n信徒阶段2→3→1。魔枪背对人群. 猛突进一人承伤。\n▼▼　不平衡之罚散开　▼▼\n　　　 　MT/D1\nH1/D2　▲女神▲ H2/D3\n　　　 　ST/D4\n两边连线相差0条去蓝色对面+大倾斜\n两边连线相差1条去线多那边+小倾斜\n两边连线相差2条去线多那边+大倾斜\n睿智之秤(绿色的气息预兆)时换T。",
        "Editable": false,
      },
    ],
    "448": [
      {
        "Name": "圆桌骑士幻想歼灭战",
        "Type": "macro",
        "Text":
          "极骑神\nP1龙眼之邪背对\n天踵 死刑减伤\nP2冲刺和人群站场边花纹根部\np2小怪: MT右 ST左 先打剑姿\n穿天 南→北→南\n龙眼之光后MT将BOSS拉到龙眼处\n圣盾猛击 被点名的奶站最后面,ST最前面,除MT其他人站中间 MT不参与",
        "Editable": false,
      },
    ],
    "825": [
      {
        "Name": "青龙诗魂战",
        "Type": "macro",
        "Text":
          "极青龙\n《菓子系列》极青龙专用宏\n——————————————\n◆ 升龙踩塔\n——————————————\n　　 　　 \ue071\n　MT/D1　ST/D2\n\ue074　 　 　\ue0bf　 　 　\ue072\n H1/D3 H2/D4\n　　 　　 \ue073\n——————————————\n◆ 截线：MT左、ST右\n◆ 沉默：MT → ST\n◆ 顺序：小大小大小\n◆ 分摊：A方向H1、坦克\n　　 　　C方向H2、DPS",
        "Editable": false,
      },
    ],
    "1048": [
      {
        "Name": "究极神兵破坏作战",
        "Type": "macro",
        "Text": "极神兵\nT:三层炸弹debuff换T,第三次以太波动读条开LB\n全体:以太波动集体撞球,分摊伤害,必要时开疾跑",
        "Editable": false,
      },
    ],
    "730": [
      {
        "Name": "神龙梦幻歼灭战",
        "Type": "macro",
        "Text":
          "极神龙\n《菓子系列》极神龙专用宏\n——————————————————\n　　MT ST　　　|■ 连线+分摊\nD1　　　　D2　| MT/D1　ST/D2\n　D3　　D4　　| 　　 　 A\n H1　 H2　　| H1/D3 H2/D4\n——————————————————\n■ 放尾巴\n【奶右下 → DPS左下 → T左上or中间】\n■ 死亡轮回\n【分摊 → MT无敌 → ST无敌 → 分摊】\n■ 钻石星辰：H2滑冰\n■ 大地吐息：奶妈=左、DPS=右\n■ 小怪阶段：MT=中间大龙、ST=其他",
        "Editable": false,
      },
    ],
    "359": [
      {
        "Name": "利维亚桑歼殛战",
        "Type": "macro",
        "Text":
          "极水神\n奶妈驱散减速,多用再生和能力,少叠水镜\nT头尾各一人拉,魔法鱼人记得下踢,不要站在人群方向\nDPS远敏近战打尾巴,法师打头\n全体出泡泡集火泡泡,BOSS下水迅速开以太防护罩,拍地板开防击退",
        "Editable": false,
      },
    ],
    "296": [
      {
        "Name": "泰坦歼殛战",
        "Type": "macro",
        "Text":
          "极泰坦\n躲冲拳 躲冲拳 躲冲拳\n石牢:dps场中,H→南\n先打场中,击退后等冲拳结束打奶\nMT将BOSS拉最北侧,ST→小怪→东\n炸弹岩石尽量躲,如果躲不掉站石头上,不要吃两次爆炸\n3层易伤换T",
        "Editable": false,
      },
    ],
    "848": [
      {
        "Name": "无瑕灵君歼殛战",
        "Type": "macro",
        "Text": "极完美神\n◆ 中场小怪： \n　ＭT - 西（9点） \n　ST - 东（3点） \n◆ 晶石引爆安全点：场地4点方向",
        "Editable": false,
      },
    ],
    "446": [
      {
        "Name": "罗波那歼殛战",
        "Type": "macro",
        "Text": "极武神\n光焰序远离,光焰破去背后\n突进找第一个分身,按分身出现方向走\n冲天击找栅栏,白圈来分摊",
        "Editable": false,
      },
    ],
    "566": [
      {
        "Name": "尼德霍格传奇征龙战",
        "Type": "macro",
        "Text":
          "极邪龙\n小怪击杀顺序法拉克ＳＴ→布罗宾雅克ＭＴ→变种龙(学诱导)\nＳＴ远离贴边处理线伤害\n          塔散开\n　｜   Ａ 　 ↑　    　↑   H2 Ｂ\n　｜  　   [D1]  　  [D2] MT ↓\n  ｜　\n　｜　  ST [D3]  Ｃ  [D4]\n　｜    ↑H1   ↓　   　↓　\n      燃烧之翼后散开\n　｜ＡSt　　　　　　 MtＢ\n　｜D1　　　　　　　　 D2\n　｜\n　｜D3　　　 Ｃ　       D4\n　｜ H1　　　　　　 H2\n燃烧之翼\n不可视AOE,以BOSS为中心直线范围安全,两侧伤害\n燃烧之尾\n不可视AOE,以BOSS为中心直线范围伤害,两侧安全",
        "Editable": false,
      },
    ],
    "858": [
      {
        "Name": "缇坦妮雅歼殛战",
        "Type": "macro",
        "Text":
          "极妖灵王\n◆ 踩水圈 \nH1　MT      H2 \n 　 ST    D2 \nD3    D1      D4  \n◆ 火分摊\n西1点：ST  H1 D1 D3\n东2点：MT H2 D2 D4 \n◆ 荆棘扯线\n西北：TH     东南：D    ※顺时针旋转\n◆ 雷截线\n西1点：D1→D2→D3→D4→H1→ST\n◆ 小怪\n西：ST     北：MT",
        "Editable": false,
      },
    ],
    "779": [
      {
        "Name": "月读幽夜歼灭战",
        "Type": "macro",
        "Text":
          "极月读\n《菓子系列》极月读专用宏\n—————————————————\n■ 铳弹分摊：BOSS背后\n■ 长矛分散：BOSS面向为基准\n　　　 T\n　   H  ●\n　　　 D\n—————————————————\n■ 月读陨石\n坦克：A（月牙角上）\n奶妈：B或D（月牙对面）\nDPS：C（月牙角上）",
        "Editable": false,
      },
    ],
    "447": [
      {
        "Name": "俾斯麦歼殛战",
        "Type": "macro",
        "Text":
          "极云神\n打BOSS的壳和核心时记得上背！\nMT拉左侧蛇,ST拉右侧蛇\n雷雨天不打水泡分散站位,其他天气打水泡中间集合",
        "Editable": false,
      },
    ],
    "811": [
      {
        "Name": "朱雀诗魂战",
        "Type": "macro",
        "Text":
          "极朱雀\n《菓子系列》极朱雀专用宏\n———————————————————————\n◆羽毛X型/小鸟复活｜◆羽毛十型/P3踩塔\n———————————————————————\n　MT/D1　ST/D2　 ｜　 　　MT/D1\n　　　 　　　 　　 　 ｜H1/D3　　　ST/D2\n H1/D3 H2/D4　｜　 　 H2/D4",
        "Editable": false,
      },
    ],
    "294": [
      {
        "Name": "迦楼罗歼灭战",
        "Type": "macro",
        "Text":
          "PT迦楼罗\n开场拉在12点背对人群，其他人远离4个柱子\nBOSS 读条螺旋气流，MT穿过BOSS躲避\nBOSS第一次上天，所有人柱子后面躲避\nBOSS读完寒风啸后，就可以出来了\nBOSS召唤小羽毛，第一时间打掉，会炸掉柱子\nBOSS喊话四分五裂，根据柱子剩余情况掉血，注意抬血\n爆炸后MT前往7-8点方向等BOSS（可以事先提前标记位置）\n旋风躲好，小怪杀掉，先杀绿色的，红的ST拉住，打不打随意\n打的慢的话，出现柔羽及时打掉，MT暴风技能一步一步的躲好",
        "Editable": false,
      },
    ],
    "374": [
      {
        "Name": "拉姆歼灭战",
        "Type": "macro",
        "Text":
          "PT拉姆\n进门陆地6点方向标A，核心技能混乱冲击\n尽量去A点集合用电击圈电醒。电圈躲好\n留下的电球回收好，电球越多AOE越疼\n开场电球MT可以考虑吃3个获得BUFF，其他人随时注意远离MT\n小怪阶段一定先打小怪，打BOSS太多血，会团灭\nP3阶段读条滚雷，并且连线两名玩家\n这个阶段的电球尽量留下3个以上，被连线的任意玩家连吃3个即可解除\n",
        "Editable": false,
      },
    ],
    "281": [
      {
        "Name": "利维亚桑歼灭战",
        "Type": "macro",
        "Text":
          "PT利维亚桑\n开场左侧（长边）中央标A，头尾有仇恨，分别拉\nDPS法系打头，物理打尾\n治疗站中央，彼此适度分开\n真神跳水不会掉下去，但建议掌握观察方法\n（第一次下潜，观察长边即A点，出水柱往反方向跑\n之后下潜，看短边，如果短边出水柱，就往没水柱的半场跑\n如果长边（甲板两侧）出水柱，就转身往后面跑\n如果有声音但没水柱，往前跑到甲板边）\n吹水泡，第一时间击杀。提示可以使用魔法壁障，BOSS下潜后\n打开壁障抵御巨浪，不然会团灭\n要注意BOSS血量30%，如果属性转换以太不足30，则无法打开壁障\n小怪波齿鱼人不能打断，优先击杀",
        "Editable": false,
      },
    ],
    "1067": [
      {
        "Name": "莫古力贤王歼灭战",
        "Type": "macro",
        "Text":
          "PT莫古力\nP1 出啥打啥，P2 背口诀 “力音愈壁斧弓障”\nP2BOSS出现，MT带到场边，ST带力和斧去另外一边\n其他不管，按照口诀快速击杀\n小怪不死别碰BOSS！注意！",
        "Editable": false,
      },
    ],
    "426": [
      {
        "Name": "那布里亚勒斯讨伐战",
        "Type": "macro",
        "Text":
          "那布里亚勒斯\nBOSS读条二重/三重之后，会接电火花\n治疗注意提前预读加血，T在三重接电火花的时候记得开减伤\nBOSS之后去中央，所有人撞球，一红一黑的撞\n不要撞到同一颜色，撞多了会死，尽量把球撞光\n出现的小怪顺路打掉即可\nBOSS20%血后，会去中央放裂缝\n所有人先远离，上好各种BUFF，比如骑士可以开无敌\nDPS开爆发，开好后进入裂缝，BUFF会延时10倍时间\n进去后会掉陨石，注意踩圈\n打完裂缝，直接撸",
        "Editable": false,
      },
    ],
    "368": [
      {
        "Name": "死化奇美拉讨伐战",
        "Type": "macro",
        "Text": "死化奇美拉讨伐战\nT把奇美拉拉出洞，拉到山顶\n寒冰咆哮打断，其他出啥躲啥\n不拉出山洞，治疗压力大\n",
        "Editable": false,
      },
    ],
    "293": [
      {
        "Name": "泰坦歼灭战",
        "Type": "macro",
        "Text":
          "PT泰坦\n躲好直线技能，躲好流沙，不要太分散\n雷分两种，圆圈雷和川字雷\n圆圈雷中央集合，等外圈第一个炸了以后立刻跑过去躲\n川字雷先去旁边，中央炸了后去中央躲避\n场地会越来越小，注意别掉下去\nBOSS随机点名花刚牢狱，建议走到BOSS附近方便集火打掉\n打掉后治疗注意驱散他的debuff\nMT注意BOSS用另外的手打你，之后就是掀桌\n掀桌要开减伤！",
        "Editable": false,
      },
    ],
    "396": [
      {
        "Name": "无限城的死斗",
        "Type": "macro",
        "Text":
          "无限城的死斗\n两个怪拉开先打鸟人，这个副本的连线是靠近，是靠近，是靠近！\n被变鸡的人去踩风，其他人注意躲开风\nP2点名一个治疗，读条捕获，发现读条时，治疗远离BOSS\nDPS解救治疗，如果治疗和BOSS太近，会越难打，T注意太近拉开\n其他出啥打啥，出啥躲啥",
        "Editable": false,
      },
    ],
    "377": [
      {
        "Name": "希瓦歼灭战",
        "Type": "macro",
        "Text":
          "PT希瓦\nMT穿越BOSS躲好冰河怒击技能\nBOSS说严冰之刃将守护我的兄弟，MT开好减伤\n地上的圈尽力躲，躲不开硬吃一个，别多吃\n小怪不及时打会团灭，但小怪刚出BOSS就起飞了\n说明打BOSS太快，下次慢点打",
        "Editable": false,
      },
    ],
    "292": [
      {
        "Name": "伊弗利特歼灭战",
        "Type": "macro",
        "Text":
          "PT伊芙利特\n一定转火契，BOSS冲锋时，3只12点顺时针方向依次冲锋，尽力躲\n别慌张，实在不行吃一个，1个不会死，3个必死\n三阶段BOSS读条光辉炎柱，T注意打断，掉血很多",
        "Editable": false,
      },
    ],
    "837": [
      {
        "Name": "遇袭集落水滩村",
        "Type": "macro",
        "Text":
          "71水滩村\n老一 会在场地上召唤一些光球，光球会使用十字AOE，蓝色方形AOE是冲锋，后面会接扇形AOE。“颈手枷”注意减伤和回复。\n老一到老二\n路上的小怪会给MT上减速，注意驱散。\n老二 头顶出现1~4饼的图案，所有人4方向分散围住BOSS即可。处理完分摊之后，地面会出现冰圈\n老三 斐利亚 “钟摆”是双重距离衰减伤害，T贴场边放点名，其他人反方躲避。BOSS会随机捆绑一名玩家，其他人注意转火解救队友，“左/右鞭打”是左右连续施放的(均有读条)，要注意。最后的“激烈捶打”，BOSS会按照箭头方向使用技能并旋转，只有在BOSS两侧是安全的。它会旋转使用多次，注意躲避。",
        "Editable": false,
      },
    ],
    "821": [
      {
        "Name": "水妖幻园多恩美格禁园",
        "Type": "macro",
        "Text":
          "73水妖本\n老一之前：注意打断“浇水”。\n老一美眼 因克·佐恩，“水脉乱打”水塘砸一次会变成小喷泉，第三次就会喷发，注意回避。\n老一到老二，注意打断“浇水”。\n老二格里奥勒，需要所有人一人挡住一根线，拦截营养。剩下的出啥躲啥有啥打啥。\n老三乐圣 因克·佐恩，“痛打”对MT死刑，残酷狂想曲”是全屏AOE。\n“青蛙歌唱队”正面施放120°变呱光线，穿背躲避。\n “独木桥幻想曲”，会把所有玩家击退到场边，并在场地中央出现一个独木桥，如果掉下去的话就会回到起点重来，前进到BOSS身下，打掉梦幻的弦乐器就可以阻止“终章”的咏唱，终章咏唱结束就会团灭。\nBOSS使用自身变异幻想曲之后，会变为另一种形态，如果发现BOSS突然转身，注意躲避正面；发现BOSS四只触脚抬起，注意躲开触脚下方。",
        "Editable": false,
      },
    ],
    "823": [
      {
        "Name": "文明古迹奇坦那神影洞",
        "Type": "macro",
        "Text":
          "75神影洞\n老一之前：被连线的石像会发出激光，需要所有人找石板躲避。\n老一洛查特尔洛查特尔，读条“洛查特尔的骂声”，场地北面的石像会发动半场AOE，所有人躲避到没发光半场。“赤热化”BOSS会随机转向并使用半场AOE，所有人注意躲避。这两个技能同时出现时，必定会有1/4场地是安全的，冷静观察躲避即可。\n老二大脚野蝠，“亚音速”全场AOE附带天上掉石头AOE，最后天上会掉下来两根大钟乳石，BOSS的“声波”读条会推到这些钟乳石，往场边躲避是比较安全的(石柱一定会倒向场内)。\n老三艾洛斯，被连线的玩家需要远离BOSS。BOSS使用吸气+吐息时，会先把玩家吸引过去，然后沿场地箭头方向击退，注意避开场地上的毒潭。BOSS读条“信仰宣言”之后，如果是分摊，请在BOSS正中央分摊，如果是红圈点名，请分散到BOSS两侧躲避。",
        "Editable": false,
      },
    ],
    "836": [
      {
        "Name": "避暑离宫马利卡大井",
        "Type": "macro",
        "Text":
          "77大井\n老一 大犰狳，“大回旋”是近身360度回转攻击。“重锤碎击”需要先远离，再靠近，同时伴有小AOE，冷静躲避即可。\n老二 水陆两用塔罗斯，技能“钻井”，先远离躲避AOE，之后场地会出现喷泉，紧接着“高压”全屏击退(防击退有效)，不要被击退到水里。\n“强制排水”，周身出现旋转箭头，一边使用范围技能一边旋转，躲在BOSS身后跟着它转即可安全回避。\n老三 斯托尔戈BOSS读条“异端十字叉”，同时身边出现4个三角形白光，站在三角底边交点处的地方即安全。“碎轮”站在BOSS圈内安全。召唤的4个羽毛和BOSS本体会轮流发动上述两个技能，注意观察，冷静寻找安全点。",
        "Editable": false,
      },
    ],
    "822": [
      {
        "Name": "伪造天界格鲁格火山",
        "Type": "macro",
        "Text":
          "79火山\n老一得到宽恕的残忍，“流明无限”躲开正面。“台风之翼”，同时身下出现3个风球，需要站在2个风球之间躲避。\n第三次台风之翼开始，所有人需要远离BOSS同时远离场边的风球。\n老二得到宽恕的无常，当BOSS转完了之后，有脸的格子对应我方场地上就会出现AOE。在后半程除了有脸之外，场地上还会出现2个光球，光球会用环形AOE。\n“审判日”是场地上出现光圈，需要有玩家站在里面，直到天上的球落下。\n老三得到宽恕的猥亵读条“神削弱”，同时出现自身脚下范围AOE，躲避时请紧贴范围圈躲避，BOSS强化之后的这个技能在外圈会再多加一层AOE。\nBOSS周身出现金色圆形，需要躲开BOSS正面及金色圆形正面。BOSS使用“羽制傀儡”会召唤4个傀儡，本体头顶会有金光，同时会复读上述2个技能。",
        "Editable": false,
      },
    ],
    "912": [
      {
        "Name": "红宝石神兵狂想作战",
        "Type": "macro",
        "Text":
          "极红玉神兵\n《地面液化》\n　　 　　ST\n　　 D1　　　D2\n　 H1　　　　 H2\n　　 D3　　　D4\n　　　　 MT\n☆掘地雷：顺时针方向放置\n《利爪突进》\n　　 D1　　　D2\n　 H1　　　　 H2\n　 D3　　　　　D4\n　　 MT　　　ST\n☆陨石1：以北为起始点，顺时针放置\n☆陨石2：MT西南/ST东北",
        "Editable": false,
      },
    ],
    "923": [
      {
        "Name": "光之战士幻耀歼灭战",
        "Type": "macro",
        "Text":
          "极光战\n■基本站位　　 　　　　■LB3/塔8连/战士引导/忍者(防击退)\nD3　MT　 D4　　　　　　 　MT/D3\n H1　 ★ 　 H2　　　　　H1/D1 ★ H2/D4\n D1　 ST 　D2　　　 　　　　ST/D2\n―――――――――――――――――――\n■巴哈线/暗四角　 　　■LB1/诗人距离衰减(中央分摊)\n MT/D3　　H2/D4　　　　　   T\n　　　　　　　　　　　　　  H　　 H\n H1/D1 　　ST/D2　　　　　 DPS\n―――――――――――――――――――\n■LB2/小怪(线TH塔DPS)\n　西：MTH1D1D3　　东：STH2D2D4\n―――――――――――――――――――\n※※【陨石十字】【忍者防击退】※※",
        "Editable": false,
      },
    ],
    "913": [
      {
        "Name": "博兹雅堡垒追忆战",
        "Type": "macro",
        "Text":
          "极老屁股\n    【基本分散】       I           【分摊】\n  H1　MT　D4       I\n                             　  I MT/H1          ST/H2　\n  D1　　  　D2       I D1/D3          D2/D4\n 　　　        　     　 I\n  D3　 ST  H2　  I  ※南北(顺时针转)\n ーーーーーーーーーーーーーーーーーーーー\n    【魔导电火花】   I           【更强】 \n  MT                   ST   I   ①基本分散\n    H1               H2    |   ②内侧移动\n       D1         D2       I   ③顺时针移动\n            D3 D4          I   ④逆时针移动",
        "Editable": false,
      },
    ],
    "930": [
      {
        "Name": "希瓦幻巧战",
        "Type": "macro",
        "Text":
          "幻希瓦\n◆ X型分散　｜◆ 十型分散\n———————————————————\nD3　　　D4  ｜　 　 D3\n 　MT　ST　 ｜　 　 MT\n 　 　　 　 ｜H1 D1　　ST D4\n 　D1　D2　 ｜　 　 D2\nH1　　　H2  ｜　 　 H2\n———————————————————",
        "Editable": false,
      },
    ],
    "436": [
      {
        "Name": "俾斯麦歼灭战",
        "Type": "macro",
        "Text":
          "PT云神\n打BOSS的壳和核心时记得上背！\n一蓝一绿两只小怪记得拉开\n胖鸟的aoe会把人推下平台\n掉下去无法复活！",
        "Editable": false,
      },
    ],
    "437": [
      {
        "Name": "圆桌骑士歼灭战",
        "Type": "macro",
        "Text":
          "PT骑神\n出啥躲啥，P1“龙眼之邪”需要转身背对\n中间有一个阶段会从地面冒出塔来，记得踩塔。\nP2结束之后转场记得往BOSS方向移动，会有一个持续击退",
        "Editable": false,
      },
    ],
    "559": [
      {
        "Name": "尼德霍格征龙战",
        "Type": "macro",
        "Text": "PT邪龙\n出啥躲啥，被点名不要重合\n小怪按“四腿蜥蜴龙→蛇形龙→变种龙”的顺序打",
        "Editable": false,
      },
    ],
    "637": [
      {
        "Name": "祖尔宛歼灭战",
        "Type": "macro",
        "Text": "PT鬼神\n出啥躲啥\n小怪先打“智慧”，然后“意志”然后其他\n踩同属性的塔，冰踩冰，火踩火",
        "Editable": false,
      },
    ],
    "576": [
      {
        "Name": "索菲娅歼灭战",
        "Type": "macro",
        "Text":
          "PT女神\n暴风(钢铁)后接暴雷(月环)\n小怪尽快打掉，不然会团灭，顺序231\n倾斜天平之前向线少,或没线的方向移动，以免掉下去\nP2后会有随机四名成员被点黑白圈，2黑2白，黑+白靠近即可解除",
        "Editable": false,
      },
    ],
    "719": [
      {
        "Name": "吉祥天女歼灭战",
        "Type": "macro",
        "Text":
          "PT美神\n核心机制“元气”，在你的技能栏上方会有一个小技能栏，蓝色的图标\n可以通过场上出现的蓝色小球补充\n转阶段时使用的“”魅惑拥抱”请开启“元气”处理",
        "Editable": false,
      },
    ],
    "679": [
      {
        "Name": "神龙歼灭战",
        "Type": "macro",
        "Text":
          "PT神龙\n神龙普攻会同时打两个T\n场地随机一个方向出现水柱，迅速靠近水柱，或者防击退以免被冲下平台死亡。\n巨浪之后，会出现几个水圈，踩上去减少所受火属性伤害，增加所受雷属性伤害",
        "Editable": false,
      },
    ],
    "778": [
      {
        "Name": "月读歼灭战",
        "Type": "macro",
        "Text":
          "PT月读\n黄泉的铁尖：读条技能，BOSS前方的可见范围的扇形Aoe，走位回避\n黄泉的铳弹：读条技能，点名随机1人释放的直线分摊，请集合分摊\nP1会出现两团互相连线的烟雾，请集火打掉\nP3场地会变成黑白两色区域，长时间在一个颜色的区域站着会直接死亡\nP4读条“月刀左斩&月刀右斩”去相反方向躲避",
        "Editable": false,
      },
    ],
    "838": [
      {
        "Name": "末日暗影亚马乌罗提",
        "Type": "macro",
        "Text":
          "80末日暗影\n沿途会有小怪给队友连线，被连线的玩家会中火属性耐性降低或治疗魔法效果降低的debuff，建议优先击杀。\n老一第一之兽，“流星群”会点名DPS玩家一个巨大的黑圈和红色点名，请互相分散(但不要过于贴边)，点名消失后离开原位，在原位会有陨石落下(附带范围AOE)，之后BOSS读条“末日流星”的时候，需要躲在陨石后才能回避。其他的出啥躲啥就行。\n老二到老三 和前面一样，有连线的小怪需要打掉。\n老二终末的指引，都是小怪。\n老三至大灾兽，读条“启示录”，需要到场地两侧的耳台躲避，注意发紫光的耳台会碎，不能站人，激光时间很长。距离衰减AOE“灾兽冲锋”会伴随BOSS向前挺进。场地两侧出现人头时，会随机一侧发出激光，激光是持续伤害，一侧结束后另一侧发出激光。另外BOSS还会单点1名玩家发射直线激光，注意躲避。",
        "Editable": false,
      },
    ],
    "840": [
      {
        "Name": "异界遗构希尔科斯孪晶塔",
        "Type": "macro",
        "Text":
          "80孪晶塔\n老一扎戈斧龙：“预兆”是一个无范围预警扇形AOE。玩家头顶出现刀形状的点名时，BOSS会按照刀数量的顺序使用直线AOE，互相不要重叠，不要打到两侧的罩子。巨大绿色圆圈点名分散以及集合分摊同理，如果小怪被打出来了，记得优先处理小怪。\n老二米特里达梯，场地上出现的雷球需要适当远离，其他的出啥躲啥。\n老三泰空，读条“魔导交叉激光”时，身体前后左右会出现一个光点，远离光点，这里会发射激光，站在两个光点之间略靠外躲避。激光发射出来之后，会出现暂停的紫粉色伤害区域，不要撞进去，时间结束后会发展为直线AOE。\n另外还有从场边发射激光的“魔导防护激光”，和前面同理，会有激光炮蓄力的光点。\n“人造重力”读条后，地上出现红黑色的小圆点，这个小圆点会扩大，注意寻找安全区。",
        "Editable": false,
      },
    ],
    "841": [
      {
        "Name": "创造机构阿尼德罗学院",
        "Type": "macro",
        "Text":
          "80创造机构\n老一之前：没什么特别的\n老一裂口鲨 和 原祖鲨，蓝色的鲨鱼会释放近身圆形AOE，红的会释放扇形AOE。当一只鲨鱼跳下水后，另外一个颜色的鲨鱼会来到台上挨揍，水下的鲨鱼会绕着台子游，当它停下的时候，会在原位向场内放自己的AOE(蓝色是圆形AOE，红的是扇形AOE)，如果水下是蓝色鲨鱼，只要远离蓝鲨鱼所在半场即可，如果水下是红鲨鱼，则需要靠近鲨鱼并贴场地两侧躲避扇形AOE。双方会不断交换，直到结束。\n老一到老二 没什么特别的\n老二侯爵魔界花，出啥躲啥，当魔界花4只脚抬起的时候，需要站在两只脚之间躲避，它会一边转一边抬脚砸地5次，在最后一次砸地后，还会释放正面AOE，因此所有人需要在BOSS的侧面/背面躲避跺脚。在后半程战斗中，还有部分草地场地会变紫，远程可以站在环形无毒地板上输出，需要同时注意紫色有毒地板和BOSS抬脚砸地。\n老二到老三 恶魔装甲会读条“新烈光”(全屏AOE)，可打断。\n老三克察尔科亚特尔，出啥躲啥，BOSS会点名玩家和场地随机放雷圈，场地雷圈在点名之后会留下一个电球，撞球吃球可以获得伤害提高的buff，不吃球的话会导致BOSS伤害提高，因此玩家需要尽可能回收场地上的雷球。另外BOSS还会跳到场边并击飞玩家，AOE后T尽可能把BOSS带回场地中央，以便处理后续机制。",
        "Editable": false,
      },
    ],
    "884": [
      {
        "Name": "魔法宫殿宇宙宫",
        "Type": "macro",
        "Text":
          "80宇宙宫\n老一之前：小怪会从周围的墙上、画上跑下来。T注意不要闷头跑过头了。\n老一宫殿的隐者，碰到扫帚会被击飞，并获得1层受伤加重，注意不要吃太多层。\n老二凉南希，玩家需要在“育芽之谣”读条结束之前，把种子从草地方块搬到荒地方块上，否则种子就会发芽变成小怪。第二次播种之后会吹风，吹风会把种子按照箭头方向吹1格距离。\n老三卢格斯，“左/右炎狱斩”，BOSS会转身，注意看好BOSS面向再躲。“鬼炎斩”，玩家头顶会出现红色点名，会留下一个中等范围的十字AOE，切记不要让十字AOE打到场边的家具。“必灭之炎”，玩家需要把蓝点名的火焰传递给场边的家具。“炎狱杀”，会依次点名4名玩家并出现连线，玩家需要远离到连线变为紫色，BOSS会按顺序冲向玩家，并立刻使用扇形顺劈AOE，所有人远离的同时身后不要有家具。",
        "Editable": false,
      },
    ],
    "845": [
      {
        "Name": "缇坦妮雅歼灭战",
        "Type": "macro",
        "Text":
          "PT妖精王\n“幻之符文”根据AOE范围提示决定靠近还是远离\n“魔之符文”对MT扇形AOE+大伤害。\n“水之符文”水圈需要一人站一个\n“火之符文”水塘里分摊即可\n“根之符文”植物的根会沿着预警方向伸长。\n“冰之符文”和冰神希瓦的九连环是完全一样的，如果实在不会就原地硬吃一层。\n小怪阶段，2个T分别拉住西场的豌豆花和北场的帕克，其他人全力进攻3点的芥子，由于T负责的小怪有正面顺劈死刑，所以推荐原地拉住即可，不要带着跑来跑去。打掉芥子之后再转火另外2只小怪。\n全部打掉小怪复活变大，再来一次。\n小怪全部打掉之后会进入转场动画，可以适当布置减伤，动画结束之后进入P3。P3的基本技能在P1都见过了。",
        "Editable": false,
      },
    ],
    "846": [
      {
        "Name": "无瑕灵君歼灭战",
        "Type": "macro",
        "Text":
          "PT无瑕灵君\n开场后不久BOSS就会召唤小怪，T全部拉住即可，小怪会读条AOE。小怪打掉之后场上会出现4个圈，需要踩圈+背对BOSS处理。\n“断罪飞翔”有两种效果，一个是召唤2根雷柱，释放3根AOE伤害，需要钻缝隙躲避；一种是召唤电风扇AOE，需要顺着AOE弯曲的方向前进。\n“断罪回旋”BOSS放出的剑会停留在场地外缘，翻转180°再飞回来，因此不要急于移动位置，否则有可能吃到第二次伤害。\n小怪阶段请按照蓝色连线的顺序击杀，打掉所有小怪之后，BOSS会发动转场技能，如果身上叠了超过1层的斩击耐性降低debuff，请务必大量布置减伤，否则极易团灭。\n接下来就是各种躲AOE，当BOSS前往场边的时候，需要按照AOE范围预警提示的流动方向，尽可能往远离BOSS的两侧躲避。重复几次就过了。",
        "Editable": false,
      },
    ],
    "847": [
      {
        "Name": "哈迪斯歼灭战",
        "Type": "macro",
        "Text":
          "PT哈迪斯\n死刑是范围AOE，不要随便靠近MT\n“失信”，在没有箭头的方向躲避\n天上会掉下蓝色发光的魔法阵，注意远离\n小怪阶段中途会出现分摊+圆圈点名的标记，被点名圆圈的玩家注意远离，剩下的玩家场中分摊\n“暗影流”，向场地两侧躲避。“双重强袭”是对当前仇恨前2的玩家点名大伤害，ST注意保持二仇\n当BOSS伸出1只手，需要走到手臂外侧\n当BOSS伸出2只手，需要停留在场地中央\n“囚禁”被点名的玩家需要远离其他人\n场地变黑并所有人附加死亡宣告时，需要所有人踩亮地上的光环\n场地上出现箭头流动的时候，需要走到箭头起源的方向\n头顶出现金色点名的玩家，BOSS会向该方向释放扇形AOE，引导到场边。\n锁链捆绑之后提示“动态演练”，脸滚键盘即可解除\n最后BOSS会使用“黑暗侵蚀”造成全场AOE，每5次是一次大伤害，同时场地外周会被侵蚀。",
        "Editable": false,
      },
    ],
    "174": [
      {
        "Name": "水晶塔 古代人迷宫",
        "Type": "macro",
        "Text":
          "50水晶塔1\nBOSS1 骸骨龙 出啥躲啥和人群站一起\n道中 三个岔路口从左到右分别对应ABC三队，等人齐了再进！等人齐了再进！等人齐了再进！\nBOSS2 塔纳托斯 身上有星极体buff的才能攻击BOSS，其他没被连线的人可以打小怪 连线顺序是A队-B队-C队\n道中 三个沙瓦克一队负责一个，沙瓦克打完再击杀中间的爆弹怪。\nBOSS3 贝希摩斯王 铁巨人由DPS尽快击杀。绿色点名的放在场地内。  BOSS 读条黄道陨石的时候躲到彗星背面。\nBOSS4 提坦 T拉到中央偏六点方向，BOSS回场中读条古代核爆时所有人立刻回到本队标点的台子上。",
        "Editable": false,
      },
    ],
    "372": [
      {
        "Name": "水晶塔 希尔科斯塔",
        "Type": "macro",
        "Text":
          "50水晶塔2\nBOSS1 妖艳无比的六兽妖 连线紫球撞场边柱子。蓝色连线不用管被冻住后等红色连线的人撞你。boss读条古代核爆就站在解冻后的水里\nBOSS2 金刚不坏的守护者，打就行。\nBOSS3 才思敏捷的亚蒙 第一时间击杀魔科学物质66，被紫球连线的去撞库姆库姆使他变小，变小后击杀，变青蛙的注意躲蛇，青蛙可以救解冻的人但记得留点冰块躲后面的核爆\nBOSS4 始皇帝赞德 黑圈需要分摊 所有人都集中在boss身下就行，别一个人跑出去",
        "Editable": false,
      },
    ],
    "144": [
      {
        Name: "喷风相对安全点",
        Type: "place",
        Place: {
          A: { "X": 0.0, "Y": 0.0, "Z": 0.0, "ID": 0, "Active": false },
          B: { "X": 0.0, "Y": 0.0, "Z": 0.0, "ID": 1, "Active": false },
          C: { "X": 0.0, "Y": 0.0, "Z": 0.0, "ID": 2, "Active": false },
          D: { "X": 0.0, "Y": 0.0, "Z": 0.0, "ID": 3, "Active": false },
          One: { "X": 67.3074951, "Y": -4.4768095, "Z": -24.3381348, "ID": 4, "Active": true },
          Two: { "X": 0.0, "Y": 0.0, "Z": 0.0, "ID": 5, "Active": false },
          Three: { "X": 0.0, "Y": 0.0, "Z": 0.0, "ID": 3, "Active": false },
          Four: { "X": 0.0, "Y": 0.0, "Z": 0.0, "ID": 3, "Active": false },
        },
      },
    ],
  },
};

(
  [
    [
      "亚历山大绝境战",
      {
        "Name": "亚历山大绝境战",
        "MapID": 694,
        "A": { "X": 100.003, "Y": 0.0, "Z": 80.801, "ID": 0, "Active": true },
        "B": { "X": 119.115, "Y": 0.0, "Z": 99.922, "ID": 1, "Active": true },
        "C": { "X": 99.995, "Y": 0.0, "Z": 113.659, "ID": 2, "Active": true },
        "D": { "X": 86.131, "Y": 0.0, "Z": 99.805, "ID": 3, "Active": true },
        "One": { "X": 106.833, "Y": 0.0, "Z": 99.988, "ID": 4, "Active": true },
        "Two": { "X": 100.026, "Y": 0.0, "Z": 111.451, "ID": 5, "Active": true },
        "Three": { "X": 116.01, "Y": 0.0, "Z": 98.394, "ID": 6, "Active": true },
        "Four": { "X": 116.008, "Y": 0.0, "Z": 101.664, "ID": 7, "Active": true },
      },
    ],
    [
      "究极神兵绝境战",
      {
        "Name": "绝神兵",
        "MapID": 539,
        "A": { "X": 100.8771, "Y": 9.536743e-7, "Z": 82.41628, "ID": 0, "Active": true },
        "B": { "X": 118.813377, "Y": 9.536743e-7, "Z": 98.87351, "ID": 1, "Active": true },
        "C": { "X": 99.95222, "Y": 0.0, "Z": 118.287018, "ID": 2, "Active": true },
        "D": { "X": 82.2875, "Y": 0.0, "Z": 99.7309647, "ID": 3, "Active": true },
        "One": { "X": 100.186066, "Y": 0.0, "Z": 99.2162247, "ID": 4, "Active": true },
        "Two": { "X": 0.0, "Y": 0.0, "Z": 0.0, "ID": 5, "Active": false },
        "Three": { "X": 0.0, "Y": 0.0, "Z": 0.0, "ID": 6, "Active": false },
        "Four": { "X": 0.0, "Y": 0.0, "Z": 0.0, "ID": 7, "Active": false },
      },
    ],
    [
      "究极神兵绝境战",
      {
        "Name": "绝神兵三连桶",
        "MapID": 539,
        "A": { "X": 100.563751, "Y": -1.90734863e-6, "Z": 93.5459, "ID": 0, "Active": true },
        "B": { "X": 106.757942, "Y": -3.81469727e-6, "Z": 99.5804443, "ID": 1, "Active": true },
        "C": { "X": 100.4052, "Y": -3.81469727e-6, "Z": 105.739433, "ID": 2, "Active": true },
        "D": { "X": 92.96501, "Y": 7.62939453e-6, "Z": 99.20858, "ID": 3, "Active": true },
        "One": { "X": 100.186066, "Y": 0.0, "Z": 99.2162247, "ID": 4, "Active": true },
        "Two": { "X": 0.0, "Y": 0.0, "Z": 0.0, "ID": 5, "Active": false },
        "Three": { "X": 0.0, "Y": 0.0, "Z": 0.0, "ID": 6, "Active": false },
        "Four": { "X": 0.0, "Y": 0.0, "Z": 0.0, "ID": 7, "Active": false },
      },
    ],
    [
      "巴哈姆特绝境战",
      {
        "Name": "巴哈P1",
        "MapID": 280,
        "A": { "X": -0.211925328, "Y": 0.0, "Z": -23.8155136, "ID": 0, "Active": true },
        "B": { "X": -0.0276765823, "Y": -9.536743e-7, "Z": -7.898926, "ID": 1, "Active": true },
        "C": { "X": -7.373253, "Y": 0.0, "Z": 3.969863, "ID": 2, "Active": true },
        "D": { "X": 8.005841, "Y": -1.90734863e-6, "Z": 4.147682, "ID": 3, "Active": true },
        "One": { "X": 0.07961208, "Y": -1.90734863e-6, "Z": 0.0431003571, "ID": 4, "Active": true },
        "Two": { "X": 0.072705254, "Y": -4.76837158e-7, "Z": 9.053114, "ID": 5, "Active": true },
      },
    ],
    [
      "巴哈姆特绝境战",
      {
        "Name": "巴哈p3+p5",
        "MapID": 280,
        "A": { "X": -0.07233447, "Y": -9.536743e-7, "Z": -22.2067833, "ID": 0, "Active": true },
        "B": { "X": 21.9503174, "Y": -9.536743e-7, "Z": 0.206903815, "ID": 1, "Active": true },
        "C": { "X": 0.0709118545, "Y": 4.76837158e-7, "Z": 22.0522575, "ID": 2, "Active": true },
        "D": { "X": -21.9782677, "Y": 0.0, "Z": -0.287322283, "ID": 3, "Active": true },
        "One": { "X": 0.07961208, "Y": -1.90734863e-6, "Z": 0.0431003571, "ID": 4, "Active": true },
        "Two": { "X": 0.01625178, "Y": 9.536743e-7, "Z": 8.986297, "ID": 5, "Active": true },
      },
    ],
    [
      "巴哈姆特绝境战",
      {
        "Name": "巴哈p4",
        "MapID": 280,
        "A": { "X": -0.186353147, "Y": -9.536743e-7, "Z": -23.1870365, "ID": 0, "Active": true },
        "B": { "X": 0.0, "Y": 0.0, "Z": 0.0, "ID": 1, "Active": false },
        "C": { "X": 9.838067, "Y": -1.90734863e-6, "Z": -6.76200962, "ID": 2, "Active": true },
        "D": { "X": 0.0, "Y": 0.0, "Z": 0.0, "ID": 3, "Active": false },
        "One": { "X": 0.07961208, "Y": -1.90734863e-6, "Z": 0.0431003571, "ID": 4, "Active": true },
        "Two": { "X": 0.0, "Y": 0.0, "Z": 0.0, "ID": 5, "Active": false },
      },
    ],
    [
      "巴哈姆特绝境战",
      {
        "Name": "倒三角",
        "MapID": 280,
        "A": { "X": -0.07233447, "Y": -9.536743e-7, "Z": -22.2067833, "ID": 0, "Active": true },
        "B": { "X": 8.039988, "Y": 1.90734863e-6, "Z": -3.37868881, "ID": 1, "Active": true },
        "C": { "X": 0.290453434, "Y": -3.81469727e-6, "Z": 9.521973, "ID": 2, "Active": true },
        "D": { "X": -7.49105072, "Y": -1.90734863e-6, "Z": -3.033144, "ID": 3, "Active": true },
        "One": { "X": 0.07961208, "Y": -1.90734863e-6, "Z": 0.0431003571, "ID": 4, "Active": true },
        "Two": { "X": 0.104299545, "Y": 0.0, "Z": -9.92495, "ID": 5, "Active": true },
      },
    ],
    [
      "巴哈姆特绝境战",
      {
        "Name": "绝巴哈倒三角p3+p5",
        "MapID": 280,
        "C": { "X": 0.0709118545, "Y": 4.76837158e-7, "Z": 22.0522575, "ID": 0, "Active": true },
        "D": { "X": -21.9782677, "Y": 0.0, "Z": -0.287322283, "ID": 1, "Active": true },
        "A": { "X": -0.07233447, "Y": -9.536743e-7, "Z": -22.2067833, "ID": 2, "Active": true },
        "B": { "X": 21.9503174, "Y": -9.536743e-7, "Z": 0.206903815, "ID": 3, "Active": true },
        "One": { "X": 0.07961208, "Y": -1.90734863e-6, "Z": 0.0431003571, "ID": 4, "Active": true },
        "Two": { "X": 0.104299545, "Y": 0.0, "Z": -9.92495, "ID": 5, "Active": true },
      },
    ],
    [
      "伊甸零式希望乐园 再生之章4",
      {
        "Name": "E12S",
        "MapID": 759,
        "A": { "X": -0.051, "Y": 75.0, "Z": -84.346, "ID": 0, "Active": true },
        "B": { "X": 9.639, "Y": 75.0, "Z": -75.061, "ID": 1, "Active": true },
        "C": { "X": -0.019, "Y": 75.0, "Z": -65.039, "ID": 2, "Active": true },
        "D": { "X": -9.623, "Y": 75.0, "Z": -75.007, "ID": 3, "Active": true },
        "One": { "X": 7.124, "Y": 75.0, "Z": -82.047, "ID": 4, "Active": true },
        "Two": { "X": 7.079, "Y": 75.0, "Z": -68.021, "ID": 5, "Active": true },
        "Three": { "X": -7.198, "Y": 75.0, "Z": -68.006, "ID": 6, "Active": true },
        "Four": { "X": -7.006, "Y": 75.0, "Z": -82.012, "ID": 7, "Active": true },
      },
    ],
    [
      "伊甸零式希望乐园 再生之章3",
      {
        "Name": "E11S",
        "MapID": 752,
        "A": { "X": 100.022, "Y": 0.0, "Z": 90.173, "ID": 0, "Active": true },
        "B": { "X": 109.805, "Y": 0.0, "Z": 99.85, "ID": 1, "Active": true },
        "C": { "X": 100.064, "Y": 0.0, "Z": 110.009, "ID": 2, "Active": true },
        "D": { "X": 90.066, "Y": 0.0, "Z": 100.047, "ID": 3, "Active": true },
        "One": { "X": 106.875, "Y": 0.0, "Z": 92.82, "ID": 4, "Active": true },
        "Two": { "X": 106.885, "Y": 0.0, "Z": 106.837, "ID": 5, "Active": true },
        "Three": { "X": 93.119, "Y": 0.0, "Z": 107.076, "ID": 6, "Active": true },
        "Four": { "X": 93.154, "Y": 0.0, "Z": 92.941, "ID": 7, "Active": true },
      },
    ],
    [
      "伊甸零式希望乐园 再生之章2",
      {
        "Name": "E10S",
        "MapID": 748,
        "A": { "X": 99.951, "Y": 0.0, "Z": 85.696, "ID": 0, "Active": true },
        "B": { "X": 114.055, "Y": 0.0, "Z": 99.873, "ID": 1, "Active": true },
        "C": { "X": 100.035, "Y": 0.0, "Z": 113.913, "ID": 2, "Active": true },
        "D": { "X": 85.976, "Y": 0.0, "Z": 100.091, "ID": 3, "Active": true },
        "One": { "X": 114.408, "Y": 0.0, "Z": 85.232, "ID": 4, "Active": true },
        "Two": { "X": 114.333, "Y": 0.0, "Z": 114.398, "ID": 5, "Active": true },
        "Three": { "X": 85.747, "Y": 0.0, "Z": 114.304, "ID": 6, "Active": true },
        "Four": { "X": 86.266, "Y": 0.0, "Z": 86.21, "ID": 7, "Active": true },
      },
    ],
    [
      "伊甸零式希望乐园 再生之章1",
      {
        "Name": "E9S",
        "MapID": 750,
        "A": { "X": 99.848, "Y": 0.0, "Z": 81.259, "ID": 0, "Active": true },
        "B": { "X": 118.795, "Y": 0.0, "Z": 99.783, "ID": 1, "Active": true },
        "C": { "X": 99.984, "Y": 0.0, "Z": 118.863, "ID": 2, "Active": true },
        "D": { "X": 81.267, "Y": 0.0, "Z": 100.201, "ID": 3, "Active": true },
        "One": { "X": 111.671, "Y": 0.0, "Z": 87.924, "ID": 4, "Active": true },
        "Two": { "X": 111.868, "Y": 0.0, "Z": 111.561, "ID": 5, "Active": true },
        "Three": { "X": 88.489, "Y": 0.0, "Z": 111.755, "ID": 6, "Active": true },
        "Four": { "X": 88.4, "Y": 0.0, "Z": 87.633, "ID": 7, "Active": true },
      },
    ],
    [
      "伊甸零式希望乐园 共鸣之章4",
      {
        "Name": "E8S内DD",
        "MapID": 729,
        "A": { "X": 99.982, "Y": 0.0, "Z": 83.858, "ID": 0, "Active": true },
        "B": { "X": 116.107, "Y": 0.0, "Z": 100.05, "ID": 1, "Active": true },
        "C": { "X": 99.849, "Y": 0.0, "Z": 115.99, "ID": 2, "Active": true },
        "D": { "X": 83.868, "Y": 0.0, "Z": 100.243, "ID": 3, "Active": true },
        "One": { "X": 94.216, "Y": 0.0, "Z": 105.596, "ID": 4, "Active": true },
        "Two": { "X": 105.674, "Y": 0.0, "Z": 105.697, "ID": 5, "Active": true },
        "Three": { "X": 94.392, "Y": 0.0, "Z": 94.402, "ID": 6, "Active": true },
        "Four": { "X": 105.68, "Y": 0.0, "Z": 94.413, "ID": 7, "Active": true },
      },
    ],
    [
      "伊甸零式希望乐园 共鸣之章4",
      {
        "Name": "E8S",
        "MapID": 729,
        "A": { "X": 99.982, "Y": 0.0, "Z": 83.858, "ID": 0, "Active": true },
        "B": { "X": 116.107, "Y": 0.0, "Z": 100.05, "ID": 1, "Active": true },
        "C": { "X": 99.849, "Y": 0.0, "Z": 115.99, "ID": 2, "Active": true },
        "D": { "X": 83.868, "Y": 0.0, "Z": 100.243, "ID": 3, "Active": true },
        "One": { "X": 88.461, "Y": 0.0, "Z": 111.284, "ID": 4, "Active": true },
        "Two": { "X": 111.292, "Y": 0.0, "Z": 111.234, "ID": 5, "Active": true },
        "Three": { "X": 88.517, "Y": 0.0, "Z": 88.768, "ID": 6, "Active": true },
        "Four": { "X": 111.538, "Y": 0.0, "Z": 88.907, "ID": 7, "Active": true },
      },
    ],
    [
      "伊甸零式希望乐园 共鸣之章3",
      {
        "Name": "E7S",
        "MapID": 727,
        "A": { "X": 94.971, "Y": 0.0, "Z": 81.107, "ID": 0, "Active": true },
        "B": { "X": 119.297, "Y": 0.0, "Z": 94.201, "ID": 1, "Active": true },
        "C": { "X": 105.09, "Y": 0.0, "Z": 118.921, "ID": 2, "Active": true },
        "D": { "X": 80.79, "Y": 0.0, "Z": 104.581, "ID": 3, "Active": true },
        "One": { "X": 98.935, "Y": 0.0, "Z": 98.541, "ID": 4, "Active": true },
        "Two": { "X": 101.153, "Y": 0.0, "Z": 101.152, "ID": 5, "Active": true },
        "Three": { "X": 108.988, "Y": 0.0, "Z": 91.111, "ID": 6, "Active": true },
        "Four": { "X": 0.0, "Y": 0.0, "Z": 0.0, "ID": 7, "Active": false },
      },
    ],
    [
      "伊甸零式希望乐园 共鸣之章2",
      {
        "Name": "E6S",
        "MapID": 720,
        "A": { "X": 100.34, "Y": 0.0, "Z": 87.646, "ID": 0, "Active": true },
        "B": { "X": 113.004, "Y": 0.0, "Z": 100.46, "ID": 1, "Active": true },
        "C": { "X": 99.54, "Y": 0.0, "Z": 113.13, "ID": 2, "Active": true },
        "D": { "X": 86.71, "Y": 0.0, "Z": 99.536, "ID": 3, "Active": true },
        "One": { "X": 95.152, "Y": 0.0, "Z": 95.508, "ID": 4, "Active": true },
        "Two": { "X": 105.858, "Y": 0.0, "Z": 95.713, "ID": 5, "Active": true },
        "Three": { "X": 105.54, "Y": 0.0, "Z": 106.498, "ID": 6, "Active": true },
        "Four": { "X": 95.513, "Y": 0.0, "Z": 106.422, "ID": 7, "Active": true },
      },
    ],
    [
      "伊甸零式希望乐园 共鸣之章1",
      {
        "Name": "E5S",
        "MapID": 716,
        "A": { "X": 89.901, "Y": 0.0, "Z": 89.616, "ID": 0, "Active": true },
        "B": { "X": 109.807, "Y": 0.0, "Z": 89.888, "ID": 1, "Active": true },
        "C": { "X": 109.872, "Y": 0.0, "Z": 109.909, "ID": 2, "Active": true },
        "D": { "X": 90.357, "Y": 0.0, "Z": 109.704, "ID": 3, "Active": true },
        "One": { "X": 95.97, "Y": 0.0, "Z": 94.666, "ID": 4, "Active": true },
        "Two": { "X": 104.077, "Y": 0.0, "Z": 94.714, "ID": 5, "Active": true },
        "Three": { "X": 104.035, "Y": 0.0, "Z": 104.712, "ID": 6, "Active": true },
        "Four": { "X": 96.008, "Y": 0.0, "Z": 104.818, "ID": 7, "Active": true },
      },
    ],
    [
      "伊甸零式希望乐园 觉醒之章4",
      {
        "Name": "E4S",
        "MapID": 0,
        "A": { "X": 89.25536, "Y": 0.0, "Z": 88.5073242, "ID": 0, "Active": true },
        "B": { "X": 110.960938, "Y": 1.90734863e-6, "Z": 88.38228, "ID": 1, "Active": true },
        "C": { "X": 89.05167, "Y": 9.536743e-7, "Z": 111.250984, "ID": 2, "Active": true },
        "D": { "X": 110.799, "Y": 9.536743e-7, "Z": 111.164795, "ID": 3, "Active": true },
        "One": { "X": 91.20058, "Y": 1.90734863e-6, "Z": 93.7162552, "ID": 4, "Active": true },
        "Two": { "X": 90.92575, "Y": 9.536743e-7, "Z": 107.869553, "ID": 5, "Active": true },
      },
    ],
    [
      "伊甸零式希望乐园 觉醒之章3",
      {
        "Name": "E3S",
        "MapID": 683,
        "A": { "X": 90.69979, "Y": 0.0, "Z": 81.42189, "ID": 0, "Active": true },
        "B": { "X": 108.98317, "Y": 9.536743e-7, "Z": 81.5657349, "ID": 1, "Active": true },
        "C": { "X": 81.33156, "Y": 0.0, "Z": 104.841118, "ID": 2, "Active": true },
        "D": { "X": 118.817116, "Y": 0.0, "Z": 104.770538, "ID": 3, "Active": true },
        "One": { "X": 95.10125, "Y": -9.536743e-7, "Z": 99.67487, "ID": 4, "Active": true },
        "Two": { "X": 105.042946, "Y": 0.0, "Z": 99.52861, "ID": 5, "Active": true },
        "Three": { "X": 0.0, "Y": 0.0, "Z": 0.0, "ID": 6, "Active": false },
        "Four": { "X": 0.0, "Y": 0.0, "Z": 0.0, "ID": 7, "Active": false },
      },
    ],
    [
      "伊甸零式希望乐园 觉醒之章2",
      {
        "Name": "E2S",
        "MapID": 685,
        "A": { "X": 99.9372559, "Y": 0.0, "Z": 102.468506, "ID": 0, "Active": true },
        "B": { "X": 86.2714844, "Y": 0.0, "Z": 81.48967, "ID": 1, "Active": true },
        "C": { "X": 86.9898148, "Y": 0.0, "Z": 118.055969, "ID": 2, "Active": true },
        "D": { "X": 113.07515, "Y": 3.81469727e-6, "Z": 117.857727, "ID": 3, "Active": true },
        "One": { "X": 86.9008942, "Y": -9.536743e-7, "Z": 100.3936, "ID": 4, "Active": true },
        "Two": { "X": 113.457932, "Y": -9.536743e-7, "Z": 100.293045, "ID": 5, "Active": true },
        "Three": { "X": 0.0, "Y": 0.0, "Z": 0.0, "ID": 6, "Active": false },
        "Four": { "X": 0.0, "Y": 0.0, "Z": 0.0, "ID": 7, "Active": false },
      },
    ],
    [
      "伊甸零式希望乐园 觉醒之章1",
      {
        "Name": "E1S",
        "MapID": 654,
        "A": { "X": 91.13257, "Y": 0.0, "Z": 91.52951, "ID": 0, "Active": true },
        "B": { "X": 108.877335, "Y": 9.536743e-7, "Z": 92.16696, "ID": 1, "Active": true },
        "C": { "X": 91.39729, "Y": 0.0, "Z": 108.440056, "ID": 2, "Active": true },
        "D": { "X": 108.298889, "Y": 0.0, "Z": 108.410675, "ID": 3, "Active": true },
        "One": { "X": 99.81162, "Y": 4.76837158e-7, "Z": 82.28877, "ID": 4, "Active": true },
        "Two": { "X": 100.027077, "Y": 4.76837158e-7, "Z": 118.3746, "ID": 5, "Active": true },
        "Three": { "X": 0.0, "Y": 0.0, "Z": 0.0, "ID": 6, "Active": false },
        "Four": { "X": 0.0, "Y": 0.0, "Z": 0.0, "ID": 7, "Active": false },
      },
    ],
    [
      "欧米茄零式时空狭缝 阿尔法幻境4",
      {
        "Name": "O12S门神",
        "MapID": 594,
        "A": { "X": 99.83304, "Y": 9.536743e-7, "Z": 80.21912, "ID": 0, "Active": true },
        "B": { "X": 118.769211, "Y": 4.76837158e-7, "Z": 100.394394, "ID": 1, "Active": true },
        "C": { "X": 100.046577, "Y": 9.536743e-7, "Z": 119.10936, "ID": 2, "Active": true },
        "D": { "X": 80.58852, "Y": 4.76837158e-7, "Z": 99.97452, "ID": 3, "Active": true },
        "One": { "X": 0.0, "Y": 0.0, "Z": 0.0, "ID": 4, "Active": false },
        "Two": { "X": 0.0, "Y": 0.0, "Z": 0.0, "ID": 5, "Active": false },
      },
    ],
    [
      "欧米茄零式时空狭缝 阿尔法幻境4",
      {
        "Name": "O12S本体",
        "MapID": 594,
        "A": { "X": 99.83304, "Y": 9.536743e-7, "Z": 80.21912, "ID": 0, "Active": true },
        "B": { "X": 118.453392, "Y": -9.536743e-7, "Z": 93.64815, "ID": 1, "Active": true },
        "C": { "X": 100.046577, "Y": 9.536743e-7, "Z": 119.10936, "ID": 2, "Active": true },
        "D": { "X": 81.26986, "Y": 9.536743e-7, "Z": 93.63288, "ID": 3, "Active": true },
        "One": { "X": 100.116158, "Y": 0.0, "Z": 103.755928, "ID": 4, "Active": true },
        "Two": { "X": 100.007416, "Y": -9.536743e-7, "Z": 111.029564, "ID": 5, "Active": true },
      },
    ],
    [
      "欧米茄零式时空狭缝 阿尔法幻境3",
      {
        "Name": "O11S",
        "MapID": 593,
        "A": { "X": 90.0306549, "Y": 0.0, "Z": 80.07129, "ID": 0, "Active": true },
        "B": { "X": 119.689781, "Y": 0.0, "Z": 89.95763, "ID": 1, "Active": true },
        "C": { "X": 109.997, "Y": 0.0, "Z": 119.707291, "ID": 2, "Active": true },
        "D": { "X": 80.1643448, "Y": 0.0, "Z": 109.9063, "ID": 3, "Active": true },
        "One": { "X": 100.026291, "Y": 0.0, "Z": 100.218727, "ID": 4, "Active": true },
        "Two": { "X": 99.95635, "Y": 0.0, "Z": 109.840851, "ID": 5, "Active": true },
      },
    ],
    [
      "欧米茄零式时空狭缝 阿尔法幻境2",
      {
        "Name": "O10S",
        "MapID": 592,
        "A": { "X": 100.036873, "Y": -9.536743e-7, "Z": 80.13774, "ID": 0, "Active": true },
        "B": { "X": 119.288452, "Y": -9.536743e-7, "Z": 99.52209, "ID": 1, "Active": true },
        "C": { "X": 99.83287, "Y": 0.0, "Z": 119.035995, "ID": 2, "Active": true },
        "D": { "X": 80.38637, "Y": 0.0, "Z": 99.80568, "ID": 3, "Active": true },
        "One": { "X": 100.236496, "Y": 0.0, "Z": 106.1256, "ID": 4, "Active": true },
        "Two": { "X": 104.780678, "Y": 9.536743e-7, "Z": 101.296326, "ID": 5, "Active": true },
      },
    ],
    [
      "欧米茄零式时空狭缝 阿尔法幻境1",
      {
        "Name": "O9SX字",
        "MapID": 591,
        "A": { "X": 96.32393, "Y": -1.90734863e-6, "Z": 95.60237, "ID": 0, "Active": true },
        "B": { "X": 103.289055, "Y": -9.536743e-7, "Z": 96.70901, "ID": 1, "Active": true },
        "C": { "X": 103.600288, "Y": 0.0, "Z": 103.315353, "ID": 2, "Active": true },
        "D": { "X": 96.48285, "Y": 0.0, "Z": 103.007729, "ID": 3, "Active": true },
        "One": { "X": 99.68421, "Y": 9.536743e-7, "Z": 87.40692, "ID": 4, "Active": true },
        "Two": { "X": 0.0, "Y": 0.0, "Z": 0.0, "ID": 5, "Active": false },
      },
    ],
    [
      "欧米茄零式时空狭缝 西格玛幻境4",
      {
        "Name": "O8S门神",
        "MapID": 69,
        "A": { "X": 0.0896936655, "Y": -9.536743e-7, "Z": -4.80771637, "ID": 0, "Active": true },
        "B": { "X": 4.37434959, "Y": 0.0, "Z": 0.428713232, "ID": 1, "Active": true },
        "C": { "X": -0.00514018536, "Y": 0.0, "Z": 4.85788536, "ID": 2, "Active": true },
        "D": { "X": -4.363811, "Y": 0.0, "Z": 0.404521555, "ID": 3, "Active": true },
        "One": { "X": 1.05671811, "Y": -9.536743e-7, "Z": -18.2012253, "ID": 4, "Active": true },
        "Two": { "X": -0.34018302, "Y": 9.536743e-7, "Z": 18.8458672, "ID": 5, "Active": true },
        "Three": { "X": 0.0, "Y": 0.0, "Z": 0.0, "ID": 6, "Active": false },
        "Four": { "X": 0.0, "Y": 0.0, "Z": 0.0, "ID": 7, "Active": false },
      },
    ],
    [
      "欧米茄零式时空狭缝 西格玛幻境4",
      {
        "Name": "O8s本体",
        "MapID": 295,
        "A": { "X": 0.6233097, "Y": 1.90734863e-6, "Z": -18.5594025, "ID": 0, "Active": true },
        "B": { "X": 19.2229443, "Y": 0.0, "Z": -1.67351913, "ID": 1, "Active": true },
        "C": { "X": -0.2087488, "Y": 0.0, "Z": 19.4362221, "ID": 2, "Active": true },
        "D": { "X": -19.0983086, "Y": 1.90734863e-6, "Z": -0.507885, "ID": 3, "Active": true },
        "One": { "X": -12.9519014, "Y": 0.0, "Z": 14.4428806, "ID": 4, "Active": true },
        "Two": { "X": 13.9547405, "Y": 0.0, "Z": 13.1799335, "ID": 5, "Active": true },
        "Three": { "X": 0.0, "Y": 0.0, "Z": 0.0, "ID": 6, "Active": false },
        "Four": { "X": 0.0, "Y": 0.0, "Z": 0.0, "ID": 7, "Active": false },
      },
    ],
    [
      "欧米茄零式时空狭缝 德尔塔幻境4",
      {
        "Name": "O4S",
        "MapID": 259,
        "A": { "X": -0.191439867, "Y": 0.0, "Z": -19.5519123, "ID": 0, "Active": true },
        "B": { "X": 19.8772144, "Y": -9.536743e-7, "Z": -0.1288662, "ID": 1, "Active": true },
        "C": { "X": -0.017939806, "Y": 0.0, "Z": 19.6729469, "ID": 2, "Active": true },
        "D": { "X": -19.79152, "Y": -1.90734863e-6, "Z": 0.098944664, "ID": 3, "Active": true },
        "One": { "X": 0.00287008286, "Y": 9.536743e-7, "Z": 0.0327014923, "ID": 4, "Active": true },
        "Two": { "X": 0.0, "Y": 0.0, "Z": 0.0, "ID": 5, "Active": false },
        "Three": { "X": 0.0, "Y": 0.0, "Z": 0.0, "ID": 6, "Active": false },
        "Four": { "X": 0.0, "Y": 0.0, "Z": 0.0, "ID": 7, "Active": false },
      },
    ],
    [
      "亚历山大零式机神城 天动之章4",
      {
        "Name": "A12S",
        "MapID": 193,
        "A": { "X": 11.8757782, "Y": 400.0, "Z": -20.3100662, "ID": 0, "Active": true },
        "B": { "X": 21.2444363, "Y": 400.0, "Z": 11.8267078, "ID": 1, "Active": true },
        "C": { "X": -12.1610489, "Y": 400.0, "Z": 21.08806, "ID": 2, "Active": true },
        "D": { "X": -19.8631439, "Y": 400.0, "Z": -11.9138031, "ID": 3, "Active": true },
        "One": { "X": 0.0, "Y": 0.0, "Z": 0.0, "ID": 4, "Active": false },
        "Two": { "X": 0.0, "Y": 0.0, "Z": 0.0, "ID": 5, "Active": false },
      },
    ],
    [
      "亚历山大零式机神城 律动之章4",
      {
        "Name": "A8S",
        "MpID": 150,
        "A": { "X": 0.236430019, "Y": 10.5000019, "Z": -22.8561821, "ID": 0, "Active": true },
        "B": { "X": 23.0866966, "Y": 10.5, "Z": -0.236469269, "ID": 1, "Active": true },
        "C": { "X": -0.0179607868, "Y": 10.5000019, "Z": 21.8828621, "ID": 2, "Active": true },
        "D": { "X": -22.583107, "Y": 10.5, "Z": -0.3021698, "ID": 3, "Active": true },
        "One": { "X": 10.8583527, "Y": 10.4999981, "Z": -0.397441864, "ID": 4, "Active": true },
        "Two": { "X": 0.111641228, "Y": 10.5000038, "Z": 9.996191, "ID": 5, "Active": true },
      },
    ],
    [
      "钻石神兵狂想作战",
      {
        "Name": "钻石神兵狂想作战",
        "MapID": 782,
        "A": { "X": 80.008, "Y": 0.0, "Z": 100.076, "ID": 0, "Active": true },
        "B": { "X": 120.034, "Y": 0.0, "Z": 99.897, "ID": 1, "Active": true },
        "C": { "X": 0.0, "Y": 0.0, "Z": 0.0, "ID": 2, "Active": false },
        "D": { "X": 0.0, "Y": 0.0, "Z": 0.0, "ID": 3, "Active": false },
        "One": { "X": 88.626, "Y": 0.0, "Z": 81.626, "ID": 4, "Active": true },
        "Two": { "X": 111.198, "Y": 0.0, "Z": 81.499, "ID": 5, "Active": true },
        "Three": { "X": 88.771, "Y": 0.0, "Z": 118.481, "ID": 6, "Active": true },
        "Four": { "X": 111.349, "Y": 0.0, "Z": 118.481, "ID": 7, "Active": true },
      },
    ],
    [
      "红宝石神兵破坏作战",
      {
        "Name": "极红兵",
        "MapID": 718,
        "A": { "X": 99.719, "Y": 0.0, "Z": 118.477, "ID": 0, "Active": true },
        "B": { "X": 88.42, "Y": 0.0, "Z": 114.409, "ID": 1, "Active": true },
        "C": { "X": 81.484, "Y": 0.0, "Z": 96.386, "ID": 2, "Active": true },
        "D": { "X": 89.63, "Y": 0.0, "Z": 85.026, "ID": 3, "Active": true },
        "One": { "X": 101.501, "Y": 0.0, "Z": 81.279, "ID": 4, "Active": true },
        "Two": { "X": 114.05, "Y": 0.0, "Z": 85.897, "ID": 5, "Active": true },
        "Three": { "X": 118.882, "Y": 0.0, "Z": 99.233, "ID": 6, "Active": true },
        "Four": { "X": 111.467, "Y": 0.0, "Z": 115.661, "ID": 7, "Active": true },
      },
    ],
    [
      "绿宝石神兵狂想作战",
      {
        "Name": "绿宝石神兵狂想作战",
        "MapID": 763,
        "A": { "X": 108.435, "Y": 0.0, "Z": 82.009, "ID": 0, "Active": true },
        "B": { "X": 118.916, "Y": 0.0, "Z": 86.765, "ID": 1, "Active": true },
        "C": { "X": 94.038, "Y": 0.0, "Z": 118.32, "ID": 2, "Active": true },
        "D": { "X": 82.407, "Y": 0.0, "Z": 112.211, "ID": 3, "Active": true },
        "One": { "X": 112.197, "Y": 0.0, "Z": 81.463, "ID": 4, "Active": true },
        "Two": { "X": 118.671, "Y": 0.0, "Z": 91.679, "ID": 5, "Active": true },
        "Three": { "X": 89.665, "Y": 0.0, "Z": 118.247, "ID": 6, "Active": true },
        "Four": { "X": 82.778, "Y": 0.0, "Z": 108.454, "ID": 7, "Active": true },
      },
    ],
    [
      "哈迪斯孤念歼灭战",
      {
        "Name": "极哈安全点",
        "MapID": 693,
        "A": { "X": 100.11734, "Y": -9.536743e-7, "Z": 95.47624, "ID": 0, "Active": true },
        "B": { "X": 104.621529, "Y": 0.0, "Z": 99.83995, "ID": 1, "Active": true },
        "C": { "X": 100.047348, "Y": 1.90734863e-6, "Z": 104.507813, "ID": 2, "Active": true },
        "D": { "X": 95.30611, "Y": 0.0, "Z": 99.79571, "ID": 3, "Active": true },
        "One": { "X": 94.99098, "Y": 9.536743e-7, "Z": 95.6959839, "ID": 4, "Active": true },
        "Two": { "X": 104.888252, "Y": 0.0, "Z": 96.08912, "ID": 5, "Active": true },
        "Three": { "X": 0.0, "Y": 0.0, "Z": 0.0, "ID": 6, "Active": false },
        "Four": { "X": 0.0, "Y": 0.0, "Z": 0.0, "ID": 7, "Active": false },
      },
    ],
    [
      "缇坦妮雅歼殛战",
      {
        "Name": "妖灵王正点",
        "MapID": 658,
        "A": { "X": 100.002243, "Y": -1.96695328e-6, "Z": 81.3506546, "ID": 0, "Active": true },
        "B": { "X": 118.654472, "Y": -1.96695328e-6, "Z": 100.006805, "ID": 1, "Active": true },
        "C": { "X": 100.023895, "Y": -5.960464e-8, "Z": 118.626984, "ID": 2, "Active": true },
        "D": { "X": 81.3446045, "Y": -1.96695328e-6, "Z": 99.9919739, "ID": 3, "Active": true },
        "One": { "X": 93.317215, "Y": -5.960464e-8, "Z": 100.022911, "ID": 4, "Active": true },
        "Two": { "X": 106.674713, "Y": 1.847744e-6, "Z": 100.017967, "ID": 5, "Active": true },
      },
    ],
    [
      "缇坦妮雅歼殛战",
      {
        "Name": "妖灵王",
        "MapID": 658,
        "A": { "X": 100.002243, "Y": -1.96695328e-6, "Z": 81.3506546, "ID": 0, "Active": true },
        "B": { "X": 118.654472, "Y": -1.96695328e-6, "Z": 100.006805, "ID": 1, "Active": true },
        "C": { "X": 100.023895, "Y": -5.960464e-8, "Z": 118.626984, "ID": 2, "Active": true },
        "D": { "X": 81.3446045, "Y": -1.96695328e-6, "Z": 99.9919739, "ID": 3, "Active": true },
        "One": { "X": 93.317215, "Y": -5.960464e-8, "Z": 100.022911, "ID": 4, "Active": true },
        "Two": { "X": 106.674713, "Y": 1.847744e-6, "Z": 100.017967, "ID": 5, "Active": true },
        "Three": { "X": 0.0, "Y": 0.0, "Z": 0.0, "ID": 6, "Active": false },
        "Four": { "X": 0.0, "Y": 0.0, "Z": 0.0, "ID": 7, "Active": false },
      },
    ],
    [
      "无瑕灵君歼殛战",
      {
        "Name": "肥宅",
        "MapID": 667,
        "A": { "X": 100.137268, "Y": 0.0038394928, "Z": 81.16358, "ID": 0, "Active": true },
        "B": { "X": 117.04, "Y": 0.006846428, "Z": 100.089066, "ID": 1, "Active": true },
        "C": { "X": 99.9696655, "Y": 0.00439071655, "Z": 118.513931, "ID": 2, "Active": true },
        "D": { "X": 82.58859, "Y": 0.006201744, "Z": 99.69995, "ID": 3, "Active": true },
        "One": { "X": 0.0, "Y": 0.0, "Z": 0.0, "ID": 4, "Active": false },
        "Two": { "X": 0.0, "Y": 0.0, "Z": 0.0, "ID": 5, "Active": false },
        "Three": { "X": 0.0, "Y": 0.0, "Z": 0.0, "ID": 6, "Active": false },
        "Four": { "X": 0.0, "Y": 0.0, "Z": 0.0, "ID": 7, "Active": false },
      },
    ],
    [
      "月读幽夜歼灭战",
      {
        "Name": "月读",
        "MapID": 538,
        "A": { "X": 99.60663, "Y": 0.0, "Z": 82.8387451, "ID": 0, "Active": true },
        "B": { "X": 117.821754, "Y": 0.0, "Z": 99.82191, "ID": 1, "Active": true },
        "C": { "X": 100.040916, "Y": -9.536743e-7, "Z": 117.491928, "ID": 2, "Active": true },
        "D": { "X": 82.4726257, "Y": -9.536743e-7, "Z": 99.78953, "ID": 3, "Active": true },
        "One": { "X": 0.0, "Y": 0.0, "Z": 0.0, "ID": 4, "Active": false },
        "Two": { "X": 0.0, "Y": 0.0, "Z": 0.0, "ID": 5, "Active": false },
      },
    ],
    [
      "朱雀诗魂战",
      {
        "Name": "朱雀",
        "MapID": 597,
        "A": { "X": 100.426468, "Y": 0.0, "Z": 82.81605, "ID": 0, "Active": true },
        "B": { "X": 118.567696, "Y": 1.90734863e-6, "Z": 99.98941, "ID": 1, "Active": true },
        "C": { "X": 99.9193344, "Y": -9.536743e-7, "Z": 118.764473, "ID": 2, "Active": true },
        "D": { "X": 81.94909, "Y": 1.90734863e-6, "Z": 99.9024048, "ID": 3, "Active": true },
        "One": { "X": 99.96159, "Y": 0.0, "Z": 106.399796, "ID": 4, "Active": true },
        "Two": { "X": 0.0, "Y": 0.0, "Z": 0.0, "ID": 5, "Active": false },
      },
    ],
    [
      "青龙诗魂战",
      {
        "Name": "青龙",
        "MapID": 638,
        "A": { "X": 100.356552, "Y": -6.700576e-6, "Z": 81.95613, "ID": 0, "Active": true },
        "B": { "X": 119.661438, "Y": -9.25636868e-7, "Z": 100.777023, "ID": 1, "Active": true },
        "C": { "X": 100.057991, "Y": -8.440299e-6, "Z": 118.584145, "ID": 2, "Active": true },
        "D": { "X": 80.47084, "Y": -5.249853e-5, "Z": 100.648651, "ID": 3, "Active": true },
        "One": { "X": 99.91794, "Y": -7.4129357e-6, "Z": 94.52867, "ID": 4, "Active": true },
        "Two": { "X": 100.070107, "Y": -8.775128e-6, "Z": 104.833641, "ID": 5, "Active": true },
      },
    ],
    [
      "终极之战",
      `/p 分摊站位
/p MT H1 D1 D2左上
/p ST  H2 D3 D4 右下
/p 踩塔站位
/p  MT   D1
/p  ST    D2
/p  H1   D3 
/p  H2   D4
/p 三连点名基础分散站位
/p D1 MT D2
/p H1  ○  ST　
/p D3  H2 D4
/p 三连点名最终站位
/p          核爆t
/p 大圈    ○   核爆d
/p          核爆n`,
      "子言评论区 @辅助不萌" +
        getSource("https://www.bilibili.com/video/BV1PU4y1e72C/?vd_source=583984e97858d637c7db9eb92b042c91"),
    ],
    [
      "终极之战",
      {
        "Name": "小鸟",
        "MapID": 4130,
        "A": { "X": 100.0, "Y": 0.0, "Z": 83.0, "ID": 0, "Active": true },
        "B": { "X": 117.0, "Y": 0.0, "Z": 100.0, "ID": 1, "Active": true },
        "C": { "X": 100.0, "Y": 0.0, "Z": 100.0, "ID": 2, "Active": true },
        "D": { "X": 83.0, "Y": 0.0, "Z": 100.0, "ID": 3, "Active": true },
        "One": { "X": 88.0, "Y": 0.0, "Z": 88.0, "ID": 4, "Active": true },
        "Two": { "X": 112.0, "Y": 0.0, "Z": 88.0, "ID": 5, "Active": true },
        "Three": { "X": 88.0, "Y": 0.0, "Z": 112.0, "ID": 6, "Active": true },
        "Four": { "X": 112.0, "Y": 0.0, "Z": 112.0, "ID": 7, "Active": true },
      },
      "斜点角尖击退点 @竹取辉夜姬" + getSource("https://nga.178.com/read.php?tid=33015568"),
    ],
    [
      "异形楼阁佐特塔",
      `Boss1：三妹拉格\n人趣毒菌：读条对MT释放的单体大伤害，附加13秒中毒Debuff，注意减伤，驱散和回复。\n人趣冰封：读条释放的射线状AoE，在缝隙处回避。\n人趣爆炎：读条释放的环形AoE，靠近BOSS回避。\n人趣暴雷 ：读条释放的步进式圆形AoE，在缝隙处回避。\n人趣剧毒菌：读条对正前方释放的半场AoE，远离BOSS正面回避。\n人趣火炎/冰结/闪雷：：读条点名随机非T玩家释放的单体伤害，注意回复。\n德鲁帕德：点名3位非T玩家分别释放一次附加“火伤”“冻伤”“感电”的12秒DoT伤害，请注意回复。\n魔力操纵：冰封/暴雷/爆炎/剧毒菌：战斗后半BOSS会发射四种属性的球，冰火雷毒，可以根据读条来判断球的属性，球碰到场地内的发光点就会以发光点为起点释放对应属性的魔法攻击(冰封/爆炎/暴雷/剧毒菌)，相当于BOSS制作了一个放技能的分身，我们正常处理即可。\n\nBoss2：二姐多格\n物创灭：读条对MT释放的单体大伤害，注意减伤和回复。\n身所达：读条释放的直线AoE，走位回避。\n人趣狂暴：读条后场地会出现5个球。\n起爆：读条后刚刚出现的5个球会爆炸，我们需要提前前往没球的角落回避，没躲开球爆炸的玩家会陷入7秒的狂暴Debuff，Debuff期间角色会变得无法控制，会自动靠近BOSS。\n大愿成：读条释放以BOSS为圆心的圆形AoE，如果角色中了之前的人趣狂暴就会无法回避。\n人趣停止：读条后我方会依次陷入5秒的停止Debuff，Debuff期间BOSS会依次对我方释放直线AoE身所达，无法回避，需要分散站位处理，避免伤害重叠。\n人趣混乱：BOSS第二次释放5个球的机制(人趣狂暴+起爆)时会先读条使用人趣混乱把球伪装成自己的样子混淆视听，此时我方队友也会变成BOSS的样子，球变成的BOSS幻影会摆出各种情感动作，我们靠近没有做出任何动作的BOSS本体即可躲开球的爆炸。\n\nBoss3：梅加斯三姐妹\n轮回：大姐马格读条释放的全屏AoE，请注意回复。当二姐拉格和三妹多格先于大姐马格被击杀时，此技能会复活另外两体BOSS，所以我们必须先击杀大姐马格。\n人趣闪耀：大姐马格频繁对MT释放的无读条单体伤害，请注意回复。\n物创灭：二姐多格读条对MT释放的单体大伤害，注意减伤和回复。\n身所达：二姐多格读条释放的直线AoE，走位回避。\n德鲁帕德：三妹拉格读条对3位非T玩家分别释放一次附加“火伤”“冻伤”“感电”的12秒DoT伤害，请注意回复。\n人道火炎/冰结/闪雷：三妹拉格读条点名随机非T玩家释放的单体伤害，注意回复。\n三角攻击+人趣信仰+人趣反射：三体BOSS释放的组合技，根据属性有三种不同效果，可以根据BOSS的台词以及技能特效来判断是哪种属性。\n1.冰属性-三角冰封：2次距离衰减伤害和若干直线和射线AoE的组合，请远离距离衰减伤害的落点以降低吃到的伤害，同时不停走位躲避即可。距离衰减伤害的落点必定第一次在12点，第二次在6点。\n2.雷属性-三角暴雷：若干可回避的圆形AoE和直线AoE后，接一个圆形分摊伤害点名，在躲避AoE后要迅速集中站位进行分摊。\n3.火属性-三角爆炎：两次环形AoE和若干直线AoE后，接一个需要分散的圆形点名伤害，最后记得散开即可。\n注意：消灭三姐妹的大姐马格(最胖的那位)后，BOSS们就无法使用组合技了，后续战斗则会变成和之前的两场BOSS战类似的模式，她们的技能也会变成前两场BOSS战时的配置。在击杀大姐马格后，二姐多格会释放人趣狂暴，此时为三个狂暴球，安全点依旧为狂暴球之间的场边。三体BOSS的推荐击杀顺序为：马格→多格→拉格。`,
    ],
    [
      "魔导神门巴别塔",
      `BOSS1 巴尔纳伯\n地面重击：读条对前方释放的直线AoE，远离正面回避。\n超电磁回转碎颈臂：BOSS读条释放周身圆形AoE，同时BOSS和我们身上会出现磁极，场外生成电流陷阱，同极相斥需要靠近BOSS，异极相吸需要远离BOSS，不要被BOSS的周身圆形AoE打到或者被磁极弹到电流陷阱里。\n超电磁地面重击：BOSS走到场边后会发动磁极和直线AoE的组合机制，直线AoE固定打中间，同时直线AoE和我们身上会出现磁极，我们和直线AoE的磁极相同就靠近，不同就远离，不要让自己的角色被吸到场中的直线AoE里或者被弹到外场的电流陷阱里。\n高压放电：读条点名随机1人释放的圆形分摊伤害，集合分摊处理。\n招雷：读条后会令场内出现造成圆形爆炸的雷球，同时BOSS使用周身圆形AoE回转碎颈臂，我们同时远离BOSS和雷球回避。\n\nBOSS2 卢格\n火力压制：读条释放的全屏伤害，注意回复。\n魔导飞弹：读条释放的圆形AoE，请走位回避。\n魔导激光：转向随机玩家释放的直线激光攻击，请远离BOSS正面回避。\n水刑：读条后场地内会被毒水充满，我方全体会不停叠加窒息Debuff，积累8层窒息Debuff后我方就会被憋死，此时需要我们踩一下青蛙图案的地砖，成功后就会变成青蛙，如此一来就不会被憋死了。在此期间BOSS会释放3波圆形AoE魔导飞弹，需要走位回避。注意变成青蛙的倒计时期间如果角色再次踩到青蛙地砖上就会解除青蛙状态，有自信的話也可以自行缩短变青蛙的时间，比如在故意等窒息Debuff累计6~7层时去变成青蛙，然后再马上变回来，如此操作就可以保证角色能在尽量多地攻击BOSS的同时不会被憋死，但需要注意的是角色不变成青蛙时在水中的移动速度会变慢，在回避魔导飞弹时需要更加小心。\n魔导炸弹：读条后场内会出现三个造成十字爆炸的炸弹，我们找缝隙回避即可。诀窍是先找没有炸弹的那一排，然后尽可能远离炸弹即可。\n魔导轮：读条后场内会出现两波全屏AoE，我们需要踩一下缩小图案的地砖，成功后就会变小，这样就可以躲开战轮的攻击了，注意期间如果角色再次踩缩小地砖也会变回来。\n\nBOSS3 阿尼玛\n攻击：频繁对MT释放的无读条单体伤害，注意减伤和回复。\n异形之楔：读条后后场地会出现若干楔子，楔子之间会连线并对框起来的区域造成AoE伤害，需要我们观察场地四角，没有楔子的角落就是安全区。\n百万重力：读条释放的全屏伤害，同时场地四角会出现黑洞，黑洞会连线我方，需要我们远离连线自己的黑洞并将粉刺连线拉成黄色连线，成功后就不会被黑洞伤到了。\n祖国之父：读条释放的直线AoE，走位回避。\n无际痛苦：读条后会将我方强制吸到场地中间，同时场中会生成持续判定的圆形AoE，并且AoE区域还会扩大，我们直接往四角跑来处理，治疗要及时回复。\n英白拉多：读条后会将我们拉到它自己的空间内，我们需要和它的下半部分战斗。此时会进入输出检测环节，我们需要在屏幕上出现的计量表到达100前将其血量清空，否则会强制团灭。\n忘却之爪：同一种读条，有两种攻击模式。\n1.BOSS在场地两边以先后顺序放置两波爪子，爪子会对所在的横排造成直线AoE，我们先去后出现的那波爪子所在的横排待机，等第一波爪子判定后去空地即可。\n2.BOSS点名随机2人释放跟踪型圆形AoE，请被点名者不停跑动回避。\n混沌次元：在计量表累计满或BOSS下半身的血量清零后，它就会释放这招造成全屏伤害，只要计量表不到100我们就不会被秒杀，治疗注意回复即可。此时我们再次回到一开始的战斗场地，直到战斗结束。\n痛苦喷发：读条点名我方全体释放的圆形AoE，请分散处理。`,
    ],
    [
      "佐迪亚克歼灭战",
      `P1\n悲痛：读条让我方全体HP归1，治疗迅速回复。\n外纹：BOSS读条在场边制造纹章，分为2种攻击类型。\n1.紫色的三角纹章代表即将对场中释放扇形AoE神秘切割，我们需要靠近该纹章的两侧来躲避。\n2.红色的方块纹章代表即将对场中释放半场范围的矩形AoE神秘二分，我们需要远离该纹章所在的半场来躲避\n悲伤：读条对MT释放的高伤害圆形AoE，请MT出人群开减伤处理。\n范式：读条后，BOSS会在场内将魔物的概念实体化，分为2种攻击类型。\n1.当出现四足猛兽贝希摩斯时，代表会造成圆形AoE，我们去空地躲避。\n2.当出现蛇状魔物巨蟒时，代表会造成直线AoE，需要我们离开蛇所在的那一排来回避。\n冥火：读条释放的3连圆形AoE，走位回避。\n仇恨：读条点名随机玩家释放需要分摊的多段圆形AoE，集合分摊，注意回复。\n完全控制：演出技能，进入P2。\n\nP2\n范式+星极超流：P2 BOSS会召唤贝希摩斯或巨蟒，接着读条星极超流将场地连同AoE范围一起按照场边箭头的方向旋转90度，这里需要一点空间想象力，我们要提前判断出旋转后的安全区来回避，在场地旋转期间我们是无法移动的，我们必须在BOSS的星极超流读条结束前就到达安全区。\n不义：读条用双拳砸地造成圆形AoE，去12点或6点回避。\n痛苦：BOSS随机飞到左上角或右上角读条对正前方释放的矩形冲击波，附带击退效果，我们跑去另一组对角回避。\n三重神秘光线：BOSS会以先后顺序制造2波绿色纹章发射直线激光，我们先去后出现的纹章前待机，等第1波纹章的伤害判定后，去空地回避。\n星蚀：读条后BOSS会固定沿逆时针飞行一周，途中会在三边方向以先后顺序各生成一组星星图样(先后顺序固定为9点边→6点边→3点边)，等BOSS绕圈结束后，三组图样会根据生成顺序依次扣在场地上造成对应图案的圆形AoE，我们连续走位回避。这里请把每组图案都当成一个印章，想象一下这个印章扣在场地上的样子。第一组图案出现后先别着急转视角，先去第一组图案的安全区，然后再看第二组图案和第三组图案，在心里默念后两组图案的安全区，等第一组流星落下后，立刻去刚刚默念的后两组安全区回避。`,
    ],
    [
      "末日树海万相森国",
      `BOSS1 终末的掠夺\n绝望的叫声：读条释放的全屏伤害，请注意回复。\n空口白话：BOSS读条后会在场地内生成若干嘴巴，张开的嘴会释放圆形AoE，闭合的嘴巴则什么都不会做，所以我们只要靠近闭合的嘴巴就安全了。\n哀诉：读条对MT释放的单体大伤害，请注意减伤和回复。\n污秽的左手/右手：BOSS读条对左侧或右侧释放的半场AoE，需要我们根据读条进行判断，然后前往安全的半场回避。\n恍惚的叫声：BOSS读条后会赋予我方全体14秒的精神失常DeBuff，效果期间我方角色头上会出现旋转的手指图标，此时我方无法自由行进，当按下任意方向的位移键时都只能朝着此时头顶的手指图标所指向的方向前进，松开按键时可以停止移动。该技能会和空口白话组合使用，我们需要在精神失常的状态下来到闭合的嘴巴处，比较推荐的处理方式是不停按移动键来试错，直到选到了自己想要的方向为止，在Debuff消失后距嘴巴的伤害判定前大约还有1秒多的时间来调整自己的位置。\n呜咽：BOSS点名我方全体释放的圆形AoE，分散处理。\n\nBOSS2 终末的破坏\n绝望中的狂乱：读条释放的全屏伤害，同时场外出现火焰陷阱区。\n水牢弹：BOSS读条后场边会出现若干水球，角色靠近水球后会被吸入，不要随便靠近。\n属性吸收：BOSS读条随机吸收场外的水或火，请把属性记在心里。\n属性放出：根据BOSS吸入的属性不同有两种攻击效果：\n1.水属性，BOSS释放以场中为起点的全屏击退攻击，请靠近场中，并且调整角度让角色不会被击退到水球里。\n2.火属性，BOSS释放全屏伤害，请主动靠近水球被水球吸入，以大幅降低角色受到的火焰伤害。\n极尽破坏：读条对MT释放的单体大伤害，注意减伤和回复。\n毒液块：读条点名随机1人释放的圆形分摊伤害，集合分摊处理。\n\nBOSS3 斯伐婆奴\n绝望之炎：读条释放的全屏伤害，请注意回复。\n地脉失控：读条后场地会被划分成标着两种图案的区域，三角和圆形，同时我们的屏幕上会随机出现一个大三角或大圆，这代表着BOSS即将对和屏幕上的图案相同的地板发动攻击，我们去和屏幕上的图案不同的地板上即可安全回避。\n召唤流星：同一种读条，分为三种攻击模式。\n1.BOSS点名我方全员释放的圆形AoE，分散处理。\n2.BOSS释放以场地中心为起点的全屏击退攻击，会和地脉失控组合使用，需要我们调整位置主动被击退到安全的地板处理，或者直接站在安全的地板开防击退处理。\n3.BOSS飞上天在自己身边生出三组陨石，需要我们调整视角进行观察，每组陨石只会有3颗并且只会呈横向排列，陨石的攻击范围对应场地的4排方格，由于场地方格有3格，且每组陨石都只有3颗，则每组陨石都有一个空位，空位所对应的那排方格就是安全的，我们需要迅速来到那里进行回避。陨石一共有三波，同时场内还会有黄圈AoE进行干扰，需要我们同时躲避这些攻击。\n啃咬：读条对T释放的单体大伤害，注意减伤和回复。`,
    ],
    [
      "创造环境极北造物院",
      `BOSS1 吕萨\n铁颅猛击：读条对MT释放的单体大伤害，注意减伤和回复。\n寒霜寻影：BOSS读条后会消失，场地内会出现BOSS的脚印轨迹，BOSS会在脚印的终点处跳出并攻击内场造成AoE伤害，我们跟着脚印来到终点的场边处即可安全回避。\n召唤冰柱：BOSS读条召唤冰柱释放米字型或三角形的直线AoE，走位回避。\n严寒踏压：读条释放的全屏伤害，请注意回复。\n重挥碎击：读条点名随机玩家释放的需要分摊的圆形伤害，请集合分摊，注意回复。\n\nBOSS2 拉冬之王\n抓击：读条对MT释放的单体大伤害，注意减伤和回复。\n吸气+燃烧吐息：BOSS读条后会用三颗头中的一颗或两颗吸入以太，吸入以太的头会发光，随后BOSS读条燃烧吐息让吸入以太的头释放扇形AoE，左侧头打左边，右侧头打右边，中间头打前边，请走位回避。比如中间的头发光了，那我们就远离BOSS的前方就行了。\n燃烧晶球：读条召唤若干火球造成直线AoE，请寻找缝隙回避。\n恐吓：读条释放的全屏伤害，请注意回复。\n燃烧爆发：读条点名随机玩家释放的需要分摊的圆形伤害，请集合分摊，注意回复。\n\nBOSS3 赫尔墨斯\n三重伟大：读条释放的全屏伤害，请注意回复，同时场地外周变成陷阱区。\n赫尔墨斯文集：BOSS读条在外场制造矩形魔法阵释放直线AoE，分为两种攻击模式。\n1.四边出现大型魔法阵，四角安全。\n2.四角出现小型魔法阵，场中安全。\n纯正龙卷：读条对MT释放的大伤害圆形AoE，注意减伤和面向。\n陨石流星+赫尔墨斯文集：BOSS读条在外场释放4枚陨石造成距离衰减伤害，请来到场中站位降低受到的伤害，4枚陨石落地后会有3颗发光，1颗不发光。接着BOSS读条双重和赫尔墨斯文集制造2波全屏AoE，发光的陨石只能帮我们抵挡1次伤害，不光的陨石能帮我们抵挡2次伤害，所以我们必须来到没发光的陨石背后连续回避这2波全屏AoE。\n双重+纯正疾风：BOSS读条后会点名全体释放不可回避的直线AoE，请分散站位处理，AoE生效后会生出第二段可以回避的伤害，请走位回避。\n纯正勇气：BOSS读条强化自身攻击，请T使用“插言”打断此技能。\n四重+赫尔墨斯文集：BOSS读条后在外场制造4个矩形魔法阵连续释放4波半场AoE，我们需要根据连线激活魔法阵的顺序依次回避四次。\n纯正烈风：读条点名全员释放的圆形AoE，分散站位处理。\n双重+纯正龙卷：读条对MT释放的大伤害圆形AoE，注意减伤和面向。随后MT脚下会出现二段圆形AoE伤害，请MT走位回避。`,
    ],
    [
      "星海深幽寻因星晶镜",
      `BOSS1 迷执爱恋的莉维亚\n挫败：读条释放的全屏伤害，请注意回复。\n典雅女神枪：读条对MT释放的大伤害AoE，请注意减伤和面向。\n典雅女神连枪：BOSS读条对发光触手所在的方向释放的扇形AoE，请来到不发光的触手所在的方向回避。\n恨且爱：读条释放的圆形AoE，请走位回避。\n恨之火：无读条点名随机玩家释放的需要分摊的圆形伤害，请集合分摊，注意回复。\n蔑视：BOSS转向随机玩家读条释放的扇形AoE，请走位回避。\n典雅女神射击：BOSS读条发射子弹释放的米字型AoE，子弹的直线伤害会原地判定两次，需要注意不要被第二次判定打到，子弹之间的缝隙处就是安全区。此技能会和典雅女神连枪组合使用，需要找到能同时躲避这两个技能的安全区回避。\n\nBOSS2 强执忠义的里塔提恩\n冥狱冲击：读条释放的全屏伤害，请注意回复。\n冥狱火花：读条释放的直线伤害，请走位回避。\n榴散弹： 读条对随机一组对角方向释放若干圆形AoE轰炸，我们来到另一组对角方向回避即可。\n冥狱铁砧：读条对MT释放的单体大伤害，注意减伤和回复。\n布旗+盾牌穿刺：BOSS强制跑到场边，读条后会将战斗场地改造成长方形，随后BOSS会全屏高伤害AoE盾牌穿刺，此时场地内会出现4个水晶，每个水晶上面都有一个耐久度提示槽，其中会有2个水晶的耐久度下降得最快且水晶的颜色会逐渐变黑，不久后这2枚水晶就会破碎并形成一个缺口，我们只要躲进这个缺口就能躲避掉BOSS的全屏攻击。该技能会和榴散弹组合使用，此时榴散弹的攻击范围会覆盖其中一个安全区，我们去另一个安全区即可。\n\nBOSS3 邪执外道的亚蒙\n暗强音：读条对MT释放的单体大伤害，注意减伤和回复。\n强音暴雷：BOSS读条释放以场中为源点的距离衰减伤害，请先前往场边以降低受到的伤害。接着场地会被分割成8块，每一块都会有雷光不停贴近场边，当雷光到达场边后就会对该1/8区域造成AoE伤害，我们先去雷光较为靠近场中的区域待机，等雷光较为靠近场边的区域伤害判定后，去伤害已经判断过的空地回避。\n正旋舞歌+回舞歌：BOSS读条制造圆形魔法阵，随后BOSS读条回舞歌让魔法阵浮空，浮空的魔法阵会对着其前后方向释放直线激光，请来到魔法阵侧面回避。战斗后半会让魔法阵的数量变成2个。\n左/右侧强音爆炎：BOSS读条对随机左侧或右侧半场释放的AoE攻击，请根据读条判断安全区进行回避。\n间歇：读条释放的全屏伤害，注意回复。\n强音喷发：圆形AoE，请走位回避。\n谢幕的疯狂：BOSS读条释放的全屏秒杀伤害，请躲在希瓦制造的冰柱后面回避。`,
    ],
    [
      "海德林歼灭战",
      `P1\n职责更换：BOSS会切换自己手里的武器发动没有范围提示的攻击，共三种类型。\n1.当BOSS切换成法杖，周身浮现出绿色法杖纹章时，说明马上会释放近身圆形AoE至高神圣，我们需要迅速远离BOSS来回避。\n2.当BOSS切换成环刃，周身浮现出红色环刃纹章时，说明马上会释放环形AoE反假日，我们需要迅速靠近BOSS来回避。\n3.当BOSS切换成单手剑，周身浮现出蓝色长剑纹章时，说明马上会释放十字AoE昼夜二分，我们需要来到BOSS的四角方向回避。\n魔法师的光辉：读条释放的全屏伤害，注意回复。\n演艺家的蔑视：读条对MT释放的需要双T分摊的圆形AoE，请双T去BOSS面前开减伤分摊，注意回复。\n守护者的光辉：读条释放的全屏伤害，注意回复。\n守护者的斩断：读条对MT释放的高伤害扇形AoE，注意减伤和面向。\n\nP2\n光之水晶：P2 BOSS会进入无敌状态，场地内会出现6颗光之水晶，我们必须尽快打破全部的水晶，如果计量表到达了100就会被秒杀。\n海德林光线：BOSS会生出分身释放直线形状的距离衰减伤害，请尽量远离发光的直线以降低吃到的伤害。\n水晶冰封：点名全员释放的圆形AoE，分散处理。\n水晶垒石：点名随机玩家释放的分摊伤害，集合分摊处理。\n众生离绝：击破所有水晶后BOSS会释放全屏AoE“离乡远行”，如果此时计量表到达了100就会被秒杀。\n\nP3\n结晶：读条后BOSS身边会浮现特效，分为两种攻击模式。\n1.当出现冰晶特效时说明10秒后即将发动需要分散的圆形AoE点名水晶冰封。\n2.当出现土块特效说明10秒后即将点名需要分摊的圆形AoE水晶垒石。\n幻日环+幻闪光：BOSS读条幻日环后场内会出现发光的线条并造成圆形AoE幻闪光，我们去没线的空地回避。\n幻日+映幻日：BOSS读条幻日后，会依次对三个方向射出三组环刃，我们直接去第三组环刃的对侧方向集合站位。不久后BOSS会读条映幻日让三组环刃远路飞回，我们需要看好第一组范围提示在我们左侧还是右侧，等第一组环刃飞回后，我们直接三穿一去空地回避即可。\n\nP4\n明辉光环：读条释放的全屏高伤害，注意减伤和回复。\n光波：读条后外场会出现4个波浪，波浪会沿直线前进造成伤害，请迅速环顾场地四周寻找4个波浪之间最大的那个缝隙回避。\n回声：读条点名随机玩家释放需要分摊的5连圆形AoE，集合分摊，注意回复。`,
    ],
    [
      "最终幻想末世终迹",
      `BOSS1 变异的格雷布洛弗\n腐烂毒素飞散：BOSS读条释放的全屏伤害，同时场内出现若干毒球。此时场地会吹风，毒球会被风吹的方向吹出步进式圆形AoE，请先靠近风吹来的方向，然后寻找毒球的空隙躲避。如果角色中招就会被附加12秒的“致死腐烂毒素”Debuff，如果治疗不驱散的话倒计时结束时该角色就会死亡。\n咳出：读条后生出3波圆形AoE，走位回避。最后会点名全员释放名为孤独的预感的Debuff，在Debuff倒计时结束前需要我方集合站位处理，如果不集合站位就会陷入恐慌状态，角色会不受控制地满地乱走。\n痘疮之拳：读条对MT释放的单体大伤害，注意减伤和回复。\n腐水块：读条点名随机玩家释放的需要分摊的圆形伤害，请集合分摊，注意回复。\n脓液弹：读条点名全员释放的圆形AoE，请分散站位处理。\n疾病激流：条释放的环形AoE，请靠近回避。如果角色中招就会被附加12秒的“致死腐烂毒素”Debuff，如果治疗不驱散的话倒计时结束时该角色就会死亡。\n\nBOSS2 和平捍卫者\n烧却光线：读条释放的全屏伤害，注意回复。\n超电磁放射：读条释放的周身圆形伤害，请远离回避，同时BOSS脚下变成危险区域，不要踩进去。\n攻击命令：读条让浮游炮发射直线激光，请站在浮游炮之间回避。同时BOSS点名我方全体释放圆形AoE，需要分散处理。\n未来不再：读条释放的多重圆形AoE轰炸，请不停寻找缝隙走位回避。同时BOSS点名我方全体释放圆形AoE，最后需要分散处理。\n和平炮：读条释放沿外场不停顺时针旋转的圆形AoE，请在AoE的缝隙处跟着旋转方向移动进行回避。\n大喷射：读条释放大范围轰炸，同时BOSS会释放以自己为中心的全屏击退伤害，请让角色靠近BOSS被击退到安全区，或者直接站在安全区里开防击退处理。\n对人光线：读条对MT释放的大伤害直线AoE，注意减伤和回复。\n\nBOSS3 拉啦\n慈光：读条释放的全屏伤害，注意回复。\n慈悲：读条对MT释放的单体大伤害，注意减伤和回复。\n跃动：读条后BOSS会依次释放5个大圆AoE，请来到第2个或第3个之后出现大圆处，等第1个大圆判定后直接走到空地躲避。\n生息：读条对前方释放的直线AoE，远离正面回避。直线AoE判定后场内出现若干蝴蝶，蝴蝶会对着其正前方释放直线AoE，此伤害附加10秒的死亡宣告Debuff，请来到蝴蝶背后回避，如果角色中了死亡宣告10秒后就会死亡，治疗可以通过奶满该角色来解除死亡宣告。\n博爱：读条点名随机玩家释放的需要分摊的圆形伤害，集合分摊，注意回复。\n安宁之翼：读条点名全员释放的圆形AoE，分散站位处理。\n慈爱之翼：读条对发光翅膀所在的半场释放的AoE，请来到不发光的翅膀所在的半场回避。`,
    ],
    [
      "终结之战",
      `P1\n哀歌：读条后会先造成1次全屏伤害，然后场外会出现两个逆时针转动的星球，一快一慢，球的刷新位置固定为左上、右上、左下、右下这4个点，并且两个球一开始固定呈对角分布。快球会固定转动270度，慢球会固定转动90度，最终两个球会在终点相撞造成大范围圆形AoE，需要我们提前判断出相撞点来回避。口诀“快左慢右”，我们只关注一开始刷新在上半场的球，并且将我们自己的移动范围也只限定在上半场。等上半场的球出现后，我们立刻观察其速度，判断出它是快球还是慢球，以快球为例，那么根据口诀“快左慢右”，我们去左上角就能安全回避，以慢球为例，那么根据口诀“快左慢右”，我们去右上角就能安全回避。\n银河：读条释放的全屏击退，靠近场中处理，或者开防击退。\n反诘：读条释放的矩形AoE，分为两种模式。\n1.BOSS嘴部发光时代表对中间释放的直线攻击，我们去两侧回避。\n2.BOSS流泪时代表对两侧释放的直线攻击，我们去中间回避。\n死亡拥抱+药毒：读条点名全员释放的射线AoE，分散站位处理，随后场地落下多干羽毛，羽毛会产生圆形AoE，远离回避。\n流溢：读条召唤若干分身释放直线AoE，站在分身之间回避。\n傲慢：读条对双T释放的高伤害圆形AoE，双T出人群开减伤处理。\n哀歌：记录事件+宿命：读条后会先造成1次全屏伤害，然后场外会出现两个顺时针转动的星球，一快一慢，最终相撞造成AoE，我们根据口诀“快左慢右”回避，在相撞产生的AoE判定后，BOSS会回溯时间，接着读条宿命与行星的碎片连线，让AoE在原地再判定一次，我们也在原地远离碎片即可。\n恍惚：读条后场内会出现若干分身释放不断扩大的圆形黑泥AoE，必须来到场边空地的边缘回避。\n星际穿越+复仇：读条后BOSS会上天发动直线俯冲，同时点名4人释放圆形AoE，我们去两侧回避俯冲，同时分散站位不要让伤害重叠即可。\n\nP2\n恶灵魔：BOSS进入无敌状态，需要尽快击杀BOSS分裂出的恶灵魔，如果计量表积累到100还没有完成击杀的话就会被强制灭团。\n陨石辐射点：读条后会有若干行星对连线位置造成圆形AoE，需要我们远离连线的区域来回避。\n陨石爆发：读条释放的圆形AoE点名，分散处理。\n灾崇：读条释放全屏形AoE，注意回复。\n终极命运：击杀恶灵魔后BOSS会释放终极命运秒杀我方，此时我方的LB槽也会直接蓄满，需要由T职等屏幕上出现5秒倒计提示时开启三段LB进行减伤，成功后我们才能存活下来。\n\nP3\n终末：读条释放全屏形AoE，注意回复。\n终末狂热：读条释放的全屏AoE 5连击，注意减伤和回复，第5下判定后会出现3连圆形AoE，建议在中间集合诱导然后再走位回避。`,
    ],
  ] as [string, PPJSON, string?][]
).forEach((m) => {
  fastPush(m[0], m[1], m[2]);
});
function getSource(href: string): string {
  return `<a href='${href}' target='_blank'>出处</a>`;
}
function fastPush(zoneName: string, data: PPJSON | string, coverTitle?: string): void {
  const mapID = getZoneIDByZoneName(zoneName);
  if (!mapID) {
    console.error(`默认标点库导入时，无法找到${zoneName}对应的mapID`);
    return;
  }
  if (defaultMacro.zoneId[mapID] === undefined) defaultMacro.zoneId[mapID] = [];
  if (typeof data === "object") {
    defaultMacro.zoneId[mapID].push({
      Name: coverTitle ?? data.Name ?? zoneName + "WayMark",
      Type: "place",
      Place: data,
    });
  }
  if (typeof data === "string") {
    defaultMacro.zoneId[mapID].push({
      Name: coverTitle ?? zoneName,
      Type: "macro",
      Text: data,
    });
  }
}
