import"./vendor-vue-ME9E2t1R.js";import{$ as e,$n as t,B as n,Bn as r,Cr as i,F as a,Gn as o,H as s,Ht as c,Ir as l,Jn as u,Kn as d,L as ee,Lt as f,M as te,Mr as ne,N as re,Nt as ie,Or as p,Q as ae,Qn as m,Qt as h,Rr as oe,St as se,Tr as ce,Tt as g,U as _,Un as v,Vt as le,Xt as ue,Yn as y,Zt as de,b as fe,bt as pe,ct as me,dt as he,er as b,et as ge,fr as x,gn as _e,gr as ve,gt as ye,ht as S,i as be,in as C,jn as xe,jt as Se,k as w,lr as Ce,lt as T,mr as E,nr as D,on as we,qn as O,rn as Te,rt as k,v as Ee,w as De,wr as A,x as Oe,xr as j,xt as ke,y as Ae,zr as M}from"./shared-common-CKFDL3EN.js";import{t as je}from"./useIndexedDB-Q3RoRn_u.js";import{t as Me}from"./useWebSocket-Df2yaz24.js";import{v as Ne}from"./cactbot-C200N8im.js";import{n as N}from"./zoneInfo-BBIsMg6u.js";import{n as Pe}from"./useZone-DX8dO9gN.js";import{t as P}from"./clipboard-D5eRL484.js";import{t as Fe}from"./zoneSelecter-BCWv9wRu.js";import{n as F,t as Ie}from"./contentFinderCondition-Ce08-i4t.js";import{i as I,n as L,r as R,t as z}from"./postNamazu-CzZtJ49a.js";import{a as B,i as Le,n as Re,t as ze}from"./uisaveParser-BK8jtVR_.js";var V={zoneId:{144:[{Name:`喷风相对安全点`,Place:{A:{X:0,Y:0,Z:0,Active:!1},B:{X:0,Y:0,Z:0,Active:!1},C:{X:0,Y:0,Z:0,Active:!1},D:{X:0,Y:0,Z:0,Active:!1},One:{X:67.3074951,Y:-4.4768095,Z:-24.3381348,Active:!0},Two:{X:0,Y:0,Z:0,Active:!1},Three:{X:0,Y:0,Z:0,Active:!1},Four:{X:0,Y:0,Z:0,Active:!1}}}],524:[{Name:`萨菲洛特歼殛战`,Text:`极魔神
【P1分摊】
左ST治疗　右DPS
单绿圈接近诱导
【绿紫圈、巨人化后散开位置共通】
BOSS
紫(orA标记)
近1　MT　ST　近2
远1　　　　远2
学　　 白
小怪大MT　小ST　顺序→小大小小大小
【巨人化】
塔(Debuff有)　左坦克治疗　右DPS
塔(Debuff无)　左MT　右ST
撼地　左TH　右DPS
LB（物理远程＞法系）`}],532:[{Name:`A8S`,Place:{A:{X:.236430019,Y:10.5000019,Z:-22.8561821,Active:!0},B:{X:23.0866966,Y:10.5,Z:-.236469269,Active:!0},C:{X:-.0179607868,Y:10.5000019,Z:21.8828621,Active:!0},D:{X:-22.583107,Y:10.5,Z:-.3021698,Active:!0},One:{X:10.8583527,Y:10.4999981,Z:-.397441864,Active:!0},Two:{X:.111641228,Y:10.5000038,Z:9.996191,Active:!0},Three:{X:100,Y:0,Z:100,Active:!1},Four:{X:100,Y:0,Z:100,Active:!1}}}],561:[{Name:`死者宫殿 地下1～10层`,Text:`BOSS：地宫死亡凝视
这个boss很简单，但是在单挑时也不能低估他的伤害(注意在战斗中需要时刻保持移动)。
技能顺序如下：
爆裂尾：在普攻中夹杂的一次对T大伤害。
风暴：地面AOE。
杂音：以BOSS为圆心的AOE，附加降低攻击速度的DEBUFF。
光球：以指定玩家为圆心的AOE。
疾风爆发：一个附加少量DOT伤害的全场AOE技能。
总体策略：使用魔陶器 梦魔化在低层可以造成巨量伤害，这是因为易伤的潜在价值比大部分低级技能都要高。如果你的职业可以风筝BOSS，那你可以绕着场地边缘跑来躲掉的爆裂尾。
https://nga.178.com/read.php?&tid=14509371&pid=285726504&to=1`}],562:[{Name:`死者宫殿 地下11～20层`,Text:`BOSS: 大口花
这个BOSS也很简单，攻击模式类似于10层。但是请不要低估它的大伤害技能，血腥的爱抚。
技能顺序大致为血腥的爱抚-以自身为圆心的AOE-点名圆形AOE-全场AOE。
全场AOE之后，它将会去场地最北边同时召唤两个地宫黄蜂。必须第一时间击杀小怪否则他们将会读条终极针让某位玩家当场去世。同时，BOSS会读条使用一个伤害极高的直线AOE腐烂恶臭。
总体策略：使用魔陶器 梦魔化来击杀BOSS和他召唤出的小怪(在它召唤时对着BOSS使用，可以通过AOE同时打到BOSS和小怪)。需要注意的是单人时可以使用生者秘药，它的伤害还是很高的。`}],563:[{Name:`死者宫殿 地下21～30层`,Text:`BOSS:宁吉兹济达
一句话攻略:站在场边，引导火球-冰球-火球-冰球，走到场地中央`}],564:[{Name:`死者宫殿 地下31～40层`,Text:`BOSS：伊休妲
一句话攻略：杀完小怪`}],565:[{Name:`死者宫殿 地下41～50层`,Text:`BOSS：漆黑的艾达
一句话攻略：贴紧boss来躲环形AOE身体健康。`}],566:[{Name:`尼德霍格传奇征龙战`,Text:`极邪龙
小怪击杀顺序法拉克ＳＴ→布罗宾雅克ＭＴ→变种龙(学诱导)
ＳＴ远离贴边处理线伤害
塔散开
｜   Ａ 　 ↑　    　↑   H2 Ｂ
｜  　   [D1]  　  [D2] MT ↓
｜
｜　  ST [D3]  Ｃ  [D4]
｜    ↑H1   ↓　   　↓
燃烧之翼后散开
｜ＡSt　　　　　　 MtＢ
｜D1　　　　　　　　 D2
｜
｜D3　　　 Ｃ　       D4
｜ H1　　　　　　 H2
燃烧之翼
不可视AOE,以BOSS为中心直线范围安全,两侧伤害
燃烧之尾
不可视AOE,以BOSS为中心直线范围伤害,两侧安全`}],577:[{Name:`索菲娅歼殛战`,Text:`极女神
信徒阶段2→3→1。魔枪背对人群. 猛突进一人承伤。
▼▼　不平衡之罚散开　▼▼
MT/D1
H1/D2　▲女神▲ H2/D3
ST/D4
两边连线相差0条去蓝色对面+大倾斜
两边连线相差1条去线多那边+小倾斜
两边连线相差2条去线多那边+大倾斜
睿智之秤(绿色的气息预兆)时换T。`}],587:[{Name:`A12S`,Place:{A:{X:11.8757782,Y:400,Z:-20.3100662,Active:!0},B:{X:21.2444363,Y:400,Z:11.8267078,Active:!0},C:{X:-12.1610489,Y:400,Z:21.08806,Active:!0},D:{X:-19.8631439,Y:400,Z:-11.9138031,Active:!0},One:{X:0,Y:0,Z:0,Active:!1},Two:{X:0,Y:0,Z:0,Active:!1},Three:{X:100,Y:0,Z:100,Active:!1},Four:{X:100,Y:0,Z:100,Active:!1}}}],593:[{Name:`死者宫殿 地下51～60层`,Text:`BOSS:深黑骑士
一句话攻略：记得卡位，保证被点名击退后不要飞进持续地板AOE。`}],594:[{Name:`死者宫殿 地下61～70层`,Text:`BOSS: 水虎龙亚夸虏
当boss吟唱浸泡时，把他完全拉出范围，否则他会得到加速BUFF。`}],595:[{Name:`死者宫殿 地下71～80层`,Text:`BOSS：古丹纳
远离boss施放的旋风，他们会将略大于他们视觉范围的人吸入并造成伤害。他会在边缘施放会施加易伤的大伤害AOE呵斥，所以当他跑去边缘时，一起跟着跑过去。他的HP在18%之后就会不断吟唱黄道陨石，一发就能造成你最大血量80%的伤害。因此，把爆发留到这个时候并尽快RUSH掉它。`}],596:[{Name:`死者宫殿 地下81～90层`,Text:`BOSS:爆弹怪教母
一句话攻略：把橘色小怪直接打死，把蓝色小怪推到boss边(所有技能都能推走它)。`}],597:[{Name:`死者宫殿 地下91～100层`,Text:`BOSS：死灵术士尼博斯
+ BOSS长这样 ...
这个BOSS对大部分团队都很简单，大部分情况你甚至不需要用魔陶器 基路伯化，下面我会对这个boss给出一些单人和团队的建议
单人
用魔陶器 强化自身、魔陶器 强化防御、生者秘药和魔陶器 梦魔化，大胆的用虚空烈焰怼boss吧，他会小怪焚化殆尽。
变身时间结束后，再用一个生者秘药和魔陶器 基路伯化，用天罚怼爆BOSS和地上的小怪。
团队
一个人使用魔陶器 梦魔化，其余人集火BOSS，虚空烈焰杀死小怪后，boss也应该奄奄一息了。
https://nga.178.com/read.php?&tid=14509371&pid=285727338&to=1`}],598:[{Name:`死者宫殿 地下101～110层`,Text:`BOSS：阿利坎托
这个boss的技巧和10层的相似，但是锤人更疼了，好好分工吧。`}],599:[{Name:`死者宫殿 地下111～120层`,Text:`BOSS:荣光魔花
一句话攻略:躲开AOE，杀死小蜜蜂`}],600:[{Name:`死者宫殿 地下121～130层`,Text:`BOSS：埃尔法德
一句话攻略：站在场边，引导火球-冰球-火球-冰球，跑到中间。`}],601:[{Name:`死者宫殿 地下131～140层`,Text:`BOSS:阿普切
魔陶器 基路伯化对这个BOSS有奇效(用了魔陶器 强化自身之后可以一发3w)。如果单挑的话，推荐你用魔陶器 强化自身+魔陶器 强化防御+魔陶器 基路伯化套餐。你也可以不用魔陶器 强化防御，那你可能就需要手动解除基路伯状态，吃个生者秘药，再用另一个魔陶器 基路伯化。`}],602:[{Name:`死者宫殿 地下141～150层`,Text:`BOSS: 提西福涅[单挑视频]
这个BOSS对远程还算友好，但是对近战尤其困难。
一句话攻略：风筝并杀死僵尸小怪(不要让他们摸到你)，梦魔小怪不是必须杀死的。`}],603:[{Name:`死者宫殿 地下151～160层`,Text:`BOSS: 非生骑士
尽管长得像是个60层BOSS的换色版，现在这个可以把你顶上天。虽然你不用魔陶器 强化防御也可以单打的过(至少赤魔打的过)我还是十分建议你提前用一个。你一旦踩进由悔恨殿制作出的流血区域，就是一跳5k的大伤害。除此之外，确定你不会被顶到爆炸球AOE中，否则BOSS紧接一刀你就死了。`}],604:[{Name:`死者宫殿 地下161～170层`,Text:`BOSS:虹蛇
这个BOSS和70层的很相似，但现在他的水塘还会额外提供一个物理伤害上升BUFF。此时T需要拉着BOSS绕着场地跑，以确保他一直不在水池里。
单人：
在第一个沉重效果慢慢衰减时预留一个疾跑或打断，这是因为你需要用这个来逃过随之而来的生物电AOE(在沉重还有7秒时用疾跑)。`}],605:[{Name:`死者宫殿 地下171～180层`,Text:`BOSS:丹代恩索涅
这个BOSS和80层的那个很类似，但也有一些很重要的区别。首先，他会连续吟唱两次大漩涡，所以会出现满地旋风的情况。呵斥虽然不是一击必杀的，但在没有魔陶器 强化防御的情况下一下是13k的伤害(注意！有可能暴击！)注意落雷(正面直线AOE)对DPS的伤害，这个技能一下就可以打死一个没有使用魔陶器 强化防御的DPS，不过话说回来，一个不用魔陶器 强化防御的DPS站在BOSS正面是在干嘛？
这个BOSS最难的地方在于，一旦他的HP到了17%以下，他就会不断的咏唱黄道陨石，这次可比上次快多了，大概每9秒造成一次每人HP80%的伤害。因此，在它50%HP时使用魔陶器 梦魔化，来确保易伤DEBUFF可以持续到RUSH阶段(单人时30%再用)，记得最后甩两段LB。(不要用T的LB！因为是无效的！！！)
如果你对你的团队没有信心，那赤魔和奶妈也可以准备单挑了。在两次黄道陨石之间用一次生者秘药并不断治疗自己以维持血线，期间想办法偷输出。
注意：不要在陨石阶段站在boss面前的近战范围里，两次陨石中间的普攻会一下打死你的。[视频演示]
单人：
如果你要单挑他，那我就先默认你是个赤魔了。要打这个BOSS很有套路，当BOSS血量降低时，你可以用赤治疗触发赤闪雷，赤治疗触发赤疾风的手法，大概就这样一直打下去。如果你有时间的话最好不要用魔陶器 梦魔化，带三个魔陶器 梦魔化打190层boss可以节约你一个在高层很宝贵的魔陶器 强化防御。
https://nga.178.com/read.php?&tid=14509371&pid=285728216&to=1`}],606:[{Name:`死者宫殿 地下181～190层`,Text:`BOSS: 爆弹怪教父
这个BOSS和90层的类似，但是颜色是相反的。这也意味着你要杀死蓝色爆弹怪(治疗爆弹怪)并把红色爆弹怪(熔岩爆弹怪)打到boss边。注意如果你被地面爆破打到或蓝色爆弹怪炸到，你会被冻住，你没有
魔陶器 强化防御的话基本就死了。这个BOSS的顺劈烈火怒骂超级疼，没有魔陶器 强化防御就是一下12k。所以你们不带T或你是单人的话一定要在下一个顺劈之前稳定好血线。
单人：
你没用魔陶器 强化防御就打过189层了？那可太秀了！如果你有三个魔陶器 梦魔化，那就现在都用了吧。顺利的话，一个魔陶器 强化防御就可以打死它。然而不要开着魔陶器 梦魔化开怪，你可能会正好吃到个顺劈然后死掉。在BOSS连续两次释放地面爆破时会有短暂的窗口期 好机会！小杜！ ，就在这时使用吧。`}],607:[{Name:`死者宫殿 地下191～200层`,Text:`最后的冲刺阶段了。希望你预留了足够多的魔陶器 视野和魔陶器 咒印解除来淌过这最后几层，或者有足够的魔陶器 重生来处理诱饵陷阱。这些怪物不如180层的那些有威胁，但这并不是说他们打人不疼，因为他们大多数还是"一拳超人"。然而你使用魔陶器 基路伯化后，三下可以打死大多数小怪。注意这层大多数怪物都是靠近感知的，所以你不能溜过他们。深宫守卫(巡逻怪)是声音感知的，所以你可以站着不动或走着绕过他们。一定要躲开他们，因为他打人太疼了。再重复一遍，这里的怪打他们不需要技巧，但是他们打人很疼。你需要时刻注意不要引到巡逻怪来保证你不会一打二。(除了深宫幽灵)大多数都处于中等+的难度，你不用魔陶器 强化防御根本打不过。`},{Name:`死者宫殿 地下191～200层`,Text:`单人：
如果你有魔陶器 宝箱增加，早敲早好。大致思路如下：
191-193层：不用任何道具，杀深宫木乃伊、深宫寒冰陷阱草和奥尼克斯龙。
注意：如果没有可以风筝的房间，那么和深宫木乃伊或奥尼克斯龙战斗时要尤其尤其尤其小心。你如果必须站定着和他们打，那一定要小心自己的血线。(如，深宫铁面腐尸在附近遛弯时)
多注意在附近巡逻的深宫铁面腐尸，你引到了，他们就会一下杀死你。如果你还是不小心引到了，你就必须要用魔陶器 强化防御/魔陶器 形态变化或向随机数生成器之神祈祷他不暴击。
194-196层：打奥尼克斯龙和深宫幽鬼之眼，可能会有些你溜不过去的怪，你如果一定要打的话，用魔陶器 强化自身和魔陶器 强化防御。为了最大化魔陶器 强化防御的效果，你最好始终一起使用。这几层的速度和你有多少魔陶器 强化防御。
197+：如果你有减少敌人，那就在进入这几层之前使用。你用魔陶器 基路伯化可以轻而易举的杀死这些小怪(大概三下，深宫贪吃鬼和深宫幽灵还会被眩晕)，但你没有魔陶器 强化防御的话，这还是有些危险的。用魔陶器 基路伯化杀小怪可以节约你宝贵的魔陶器 强化防御的时间，当然，也别忘了任务时间。
https://nga.178.com/read.php?&tid=14509371&pid=285728311&to=1`}],638:[{Name:`祖尔宛歼殛战`,Text:`极鬼神
■飞翔一■                                    ■飞翔二■
|      T                                     \\    T
D1       |                                     D1     \\                D2
|                 D2                             )一一一一一一
D3         |  \\                              D3      /              D4
|     \\      D4                   /      奶妈
奶妈       |      \\
【小怪阶段】读条陨石快速击杀 注意回避恐惧
【南十字座】人群[除了MT]→右   MT→左
【蓝色点名】BOSS左侧 右侧打身位`}],698:[{Name:`O4S`,Place:{A:{X:-.191439867,Y:0,Z:-19.5519123,Active:!0},B:{X:19.8772144,Y:-9.536743e-7,Z:-.1288662,Active:!0},C:{X:-.017939806,Y:0,Z:19.6729469,Active:!0},D:{X:-19.79152,Y:-190734863e-14,Z:.098944664,Active:!0},One:{X:.00287008286,Y:9.536743e-7,Z:.0327014923,Active:!0},Two:{X:0,Y:0,Z:0,Active:!1},Three:{X:0,Y:0,Z:0,Active:!1},Four:{X:0,Y:0,Z:0,Active:!1}}}],720:[{Name:`吉祥天女歼殛战`,Text:`极美神
■ 开场先杀左侧小怪
■ 死刑: 光之奔流  ■ 蓝球: 点名二仇波动炮
■ 诱惑之腕: 场边放置
■ 完全拒绝: 接近BOSS ■完全引诱: 远离BOSS
■ P2小怪需均匀削血，留一点HP
等待小怪开启以太后立即击杀
击杀小怪后开启以太防护
■P3后吃地面球可以增加一次以太使用机会`}],730:[{Name:`神龙梦幻歼灭战`,Text:`极神龙
《菓子系列》极神龙专用宏
——————————————————
MT ST　　　|■ 连线+分摊
D1　　　　D2　| MT/D1　ST/D2
D3　　D4　　| 　　 　 A
H1　 H2　　| H1/D3 H2/D4
——————————————————
■ 放尾巴
【奶右下 → DPS左下 → T左上or中间】
■ 死亡轮回
【分摊 → MT无敌 → ST无敌 → 分摊】
■ 钻石星辰：H2滑冰
■ 大地吐息：奶妈=左、DPS=右
■ 小怪阶段：MT=中间大龙、ST=其他`}],733:[{Name:`巴哈P1`,Place:{A:{X:-.211925328,Y:0,Z:-23.8155136,Active:!0},B:{X:-.0276765823,Y:-9.536743e-7,Z:-7.898926,Active:!0},C:{X:-7.373253,Y:0,Z:3.969863,Active:!0},D:{X:8.005841,Y:-190734863e-14,Z:4.147682,Active:!0},One:{X:.07961208,Y:-190734863e-14,Z:.0431003571,Active:!0},Two:{X:.072705254,Y:-4.76837158e-7,Z:9.053114,Active:!0},Three:{X:100,Y:0,Z:100,Active:!1},Four:{X:100,Y:0,Z:100,Active:!1}}},{Name:`巴哈p3+p5`,Place:{A:{X:-.07233447,Y:-9.536743e-7,Z:-22.2067833,Active:!0},B:{X:21.9503174,Y:-9.536743e-7,Z:.206903815,Active:!0},C:{X:.0709118545,Y:4.76837158e-7,Z:22.0522575,Active:!0},D:{X:-21.9782677,Y:0,Z:-.287322283,Active:!0},One:{X:.07961208,Y:-190734863e-14,Z:.0431003571,Active:!0},Two:{X:.01625178,Y:9.536743e-7,Z:8.986297,Active:!0},Three:{X:100,Y:0,Z:100,Active:!1},Four:{X:100,Y:0,Z:100,Active:!1}}},{Name:`巴哈p4`,Place:{A:{X:-.186353147,Y:-9.536743e-7,Z:-23.1870365,Active:!0},B:{X:0,Y:0,Z:0,Active:!1},C:{X:9.838067,Y:-190734863e-14,Z:-6.76200962,Active:!0},D:{X:0,Y:0,Z:0,Active:!1},One:{X:.07961208,Y:-190734863e-14,Z:.0431003571,Active:!0},Two:{X:0,Y:0,Z:0,Active:!1},Three:{X:100,Y:0,Z:100,Active:!1},Four:{X:100,Y:0,Z:100,Active:!1}}},{Name:`倒三角`,Place:{A:{X:-.07233447,Y:-9.536743e-7,Z:-22.2067833,Active:!0},B:{X:8.039988,Y:190734863e-14,Z:-3.37868881,Active:!0},C:{X:.290453434,Y:-381469727e-14,Z:9.521973,Active:!0},D:{X:-7.49105072,Y:-190734863e-14,Z:-3.033144,Active:!0},One:{X:.07961208,Y:-190734863e-14,Z:.0431003571,Active:!0},Two:{X:.104299545,Y:0,Z:-9.92495,Active:!0},Three:{X:100,Y:0,Z:100,Active:!1},Four:{X:100,Y:0,Z:100,Active:!1}}},{Name:`绝巴哈倒三角p3+p5`,Place:{A:{X:-.07233447,Y:-9.536743e-7,Z:-22.2067833,Active:!0},B:{X:21.9503174,Y:-9.536743e-7,Z:.206903815,Active:!0},C:{X:.0709118545,Y:4.76837158e-7,Z:22.0522575,Active:!0},D:{X:-21.9782677,Y:0,Z:-.287322283,Active:!0},One:{X:.07961208,Y:-190734863e-14,Z:.0431003571,Active:!0},Two:{X:.104299545,Y:0,Z:-9.92495,Active:!0},Three:{X:100,Y:0,Z:100,Active:!1},Four:{X:100,Y:0,Z:100,Active:!1}}}],755:[{Name:`O8S门神`,Place:{A:{X:.0896936655,Y:-9.536743e-7,Z:-4.80771637,Active:!0},B:{X:4.37434959,Y:0,Z:.428713232,Active:!0},C:{X:-.00514018536,Y:0,Z:4.85788536,Active:!0},D:{X:-4.363811,Y:0,Z:.404521555,Active:!0},One:{X:1.05671811,Y:-9.536743e-7,Z:-18.2012253,Active:!0},Two:{X:-.34018302,Y:9.536743e-7,Z:18.8458672,Active:!0},Three:{X:0,Y:0,Z:0,Active:!1},Four:{X:0,Y:0,Z:0,Active:!1}}},{Name:`O8s本体`,Place:{A:{X:.6233097,Y:190734863e-14,Z:-18.5594025,Active:!0},B:{X:19.2229443,Y:0,Z:-1.67351913,Active:!0},C:{X:-.2087488,Y:0,Z:19.4362221,Active:!0},D:{X:-19.0983086,Y:190734863e-14,Z:-.507885,Active:!0},One:{X:-12.9519014,Y:0,Z:14.4428806,Active:!0},Two:{X:13.9547405,Y:0,Z:13.1799335,Active:!0},Three:{X:0,Y:0,Z:0,Active:!1},Four:{X:0,Y:0,Z:0,Active:!1}}}],770:[{Name:`天之御柱 1～10层`,Text:`亡者船
回到场中并使用全屏击退(无法用沉稳躲避)，紧跟一次半场aoe。`}],771:[{Name:`天之御柱 11～20层`,Text:`别蝶
会使用各种技能来使你恐慌，同时在场地边缘召唤蝴蝶。蝴蝶会使用无范围提示自爆，恐惧会让你往墙上走，务必躲开。`}],772:[{Name:`天之御柱 21～30层`,Text:`蛭子
召唤雷云并在一段时间后爆炸，同时在中心吟唱远离aoe。跑到边缘并避免被多个雷云劈中。如果你被击飞上天，雷云就会消失。他也会释放半场aoe，所以要保持一个始终的安全距离。`}],773:[{Name:`天之御柱 41～50层`,Text:`牛头
有一个无范围，无读条有前摇横扫和直线攻击，如果你看到它突然转向T，请远离这条连线。他还有一个邪眼技能，并在召唤黑色aoe球时吟唱距离衰减aoe。单人时，恐惧必定死亡，所以不要贪。
技能时间轴
无范围提示横扫
无范围提示直线(对随机目标)
恐惧
召唤黑球、距离衰减
重复`}],774:[{Name:`天之御柱 61～70层`,Text:`犬蛊
每隔一段时间就会对一个玩家使用缩小球，并在地板上留下一滩口水。踩进口水会有缩小debuff，你需要用这个debuff来躲避他的地狱冲。如果你没有这个buff，那就会被秒杀。在boss撕咬完你之后，务必走出这摊口水，否则之后的aoe会很疼。同时，坦克也要注意无范围提示的前方顺劈，这个技能是循环的第一个技能。Boss如果咬死一个人，它就会有伤害提升buff并回复较多血量。`}],775:[{Name:`天之御柱 81～90层`,Text:`温罗
Dps和奶妈裸吃boss平a伤害为10k。
起初会有几个aoe，血量到85%时会开始以下列顺序使用技能
古代爆震：全屏最大hp50%伤害
地图随机出现爆炸岩石，过于接近会受到10k伤害并被附加沉重debuff
陨石冲击：在boss位置召唤一个陨石(距离衰减伤害)
斗气炮：直线aoe
燃烧咆哮：点名一个人的圆形aoe
指压：boss为圆心的aoe
在场地的东北角有一个安全点，因此坦克需要将boss拉在西南侧。当你看到古代爆震读条时，迅速跑到东北侧，那里永远不会有爆炸岩石。由于boss在西南侧，所以距离衰减aoe陨石冲击只会造成10k左右的伤害。`}],777:[{Name:`绝神兵(新/全局)`,Place:{A:{X:100.123,Y:0,Z:81.261,Active:!0},B:{X:118.404,Y:0,Z:100.05,Active:!0},C:{X:100.25,Y:0,Z:118.151,Active:!0},D:{X:81.055,Y:0,Z:100.938,Active:!0},One:{X:100.276,Y:0,Z:100.372,Active:!0},Two:{X:86.829,Y:0,Z:86.937,Active:!0},Three:{X:94.454,Y:0,Z:94.066,Active:!0},Four:{X:106.704,Y:0,Z:107.081,Active:!0}}}],779:[{Name:`菓子`,Text:`极月读
《菓子系列》极月读专用宏
—————————————————
■ 铳弹分摊：BOSS背后
■ 长矛分散：BOSS面向为基准
T
H  ●
D
—————————————————
■ 月读陨石
坦克：A（月牙角上）
奶妈：B或D（月牙对面）
DPS：C（月牙角上）`},{Name:`月读`,Place:{A:{X:99.60663,Y:0,Z:82.8387451,Active:!0},B:{X:117.821754,Y:0,Z:99.82191,Active:!0},C:{X:100.040916,Y:-9.536743e-7,Z:117.491928,Active:!0},D:{X:82.4726257,Y:-9.536743e-7,Z:99.78953,Active:!0},One:{X:0,Y:0,Z:0,Active:!1},Two:{X:0,Y:0,Z:0,Active:!1},Three:{X:100,Y:0,Z:100,Active:!1},Four:{X:100,Y:0,Z:100,Active:!1}}}],782:[{Name:`天之御柱 31～40层`,Text:`[怖军]
在场地边缘生成风时，他会回到中间使用击退aoe，把所有人推开，注意不要被推到aoe中。沉稳和亲疏自行无效。`}],783:[{Name:`天之御柱 51～60层`,Text:`[忍冬]
范围提示，范围提示，各种范围提示。直线，圆形，甜甜圈形，随便你怎么叫吧！见招拆招就行。Boss读条全屏伤害后，法杖会向多个方向发射直线aoe。
单人
对全屏伤害前的法杖环形aoe来说，中间大多数时候安全，但需要注意先在别处引导烈焰再回到中间。躲在中间对于躲避后续八个方向的直线aoe也很简单。`}],784:[{Name:`天之御柱 71～80层`,Text:`[锻冶媪]
会召唤冰球，冰球在一段时间后无范围提示爆炸。与此同时，还会出现一根冰锥，刺向房间中央。被刺中的球会爆炸，爆炸的球又会带动周围的球爆炸。冰柱出现时，一定要远离这些球。Boss吟唱月下咆哮时，会引爆其余冰球，单人时如果不慎被命中，就会被冻住然后死掉。月下咆哮之后会跳向一个目标，造成8k的伤害(冻住时秒杀)。除了以上这些，都很简单。`}],802:[{Name:`O9SX字`,Place:{A:{X:96.32393,Y:-190734863e-14,Z:95.60237,Active:!0},B:{X:103.289055,Y:-9.536743e-7,Z:96.70901,Active:!0},C:{X:103.600288,Y:0,Z:103.315353,Active:!0},D:{X:96.48285,Y:0,Z:103.007729,Active:!0},One:{X:99.68421,Y:9.536743e-7,Z:87.40692,Active:!0},Two:{X:0,Y:0,Z:0,Active:!1},Three:{X:100,Y:0,Z:100,Active:!1},Four:{X:100,Y:0,Z:100,Active:!1}}}],803:[{Name:`O10S`,Place:{A:{X:100.036873,Y:-9.536743e-7,Z:80.13774,Active:!0},B:{X:119.288452,Y:-9.536743e-7,Z:99.52209,Active:!0},C:{X:99.83287,Y:0,Z:119.035995,Active:!0},D:{X:80.38637,Y:0,Z:99.80568,Active:!0},One:{X:100.236496,Y:0,Z:106.1256,Active:!0},Two:{X:104.780678,Y:9.536743e-7,Z:101.296326,Active:!0},Three:{X:100,Y:0,Z:100,Active:!1},Four:{X:100,Y:0,Z:100,Active:!1}}}],804:[{Name:`O11S`,Place:{A:{X:90.0306549,Y:0,Z:80.07129,Active:!0},B:{X:119.689781,Y:0,Z:89.95763,Active:!0},C:{X:109.997,Y:0,Z:119.707291,Active:!0},D:{X:80.1643448,Y:0,Z:109.9063,Active:!0},One:{X:100.026291,Y:0,Z:100.218727,Active:!0},Two:{X:99.95635,Y:0,Z:109.840851,Active:!0},Three:{X:100,Y:0,Z:100,Active:!1},Four:{X:100,Y:0,Z:100,Active:!1}}}],805:[{Name:`O12S门神`,Place:{A:{X:99.83304,Y:9.536743e-7,Z:80.21912,Active:!0},B:{X:118.769211,Y:4.76837158e-7,Z:100.394394,Active:!0},C:{X:100.046577,Y:9.536743e-7,Z:119.10936,Active:!0},D:{X:80.58852,Y:4.76837158e-7,Z:99.97452,Active:!0},One:{X:0,Y:0,Z:0,Active:!1},Two:{X:0,Y:0,Z:0,Active:!1},Three:{X:100,Y:0,Z:100,Active:!1},Four:{X:100,Y:0,Z:100,Active:!1}}},{Name:`O12S本体`,Place:{A:{X:99.83304,Y:9.536743e-7,Z:80.21912,Active:!0},B:{X:118.453392,Y:-9.536743e-7,Z:93.64815,Active:!0},C:{X:100.046577,Y:9.536743e-7,Z:119.10936,Active:!0},D:{X:81.26986,Y:9.536743e-7,Z:93.63288,Active:!0},One:{X:100.116158,Y:0,Z:103.755928,Active:!0},Two:{X:100.007416,Y:-9.536743e-7,Z:111.029564,Active:!0},Three:{X:100,Y:0,Z:100,Active:!1},Four:{X:100,Y:0,Z:100,Active:!1}}}],811:[{Name:`朱雀诗魂战`,Text:`极朱雀
《菓子系列》极朱雀专用宏
———————————————————————
◆羽毛X型/小鸟复活｜◆羽毛十型/P3踩塔
———————————————————————
MT/D1　ST/D2　 ｜　 　　MT/D1
｜H1/D3　　　ST/D2
H1/D3 H2/D4　｜　 　 H2/D4`},{Name:`朱雀`,Place:{A:{X:100.426468,Y:0,Z:82.81605,Active:!0},B:{X:118.567696,Y:190734863e-14,Z:99.98941,Active:!0},C:{X:99.9193344,Y:-9.536743e-7,Z:118.764473,Active:!0},D:{X:81.94909,Y:190734863e-14,Z:99.9024048,Active:!0},One:{X:99.96159,Y:0,Z:106.399796,Active:!0},Two:{X:0,Y:0,Z:0,Active:!1},Three:{X:100,Y:0,Z:100,Active:!1},Four:{X:100,Y:0,Z:100,Active:!1}}}],825:[{Name:`菓子`,Text:`极青龙
《菓子系列》极青龙专用宏
——————————————
◆ 升龙踩塔
——————————————

MT/D1　ST/D2
　 　 　　 　 　
H1/D3 H2/D4

——————————————
◆ 截线：MT左、ST右
◆ 沉默：MT → ST
◆ 顺序：小大小大小
◆ 分摊：A方向H1、坦克
C方向H2、DPS`},{Name:`青龙`,Place:{A:{X:100.356552,Y:-6700576e-12,Z:81.95613,Active:!0},B:{X:119.661438,Y:-9.25636868e-7,Z:100.777023,Active:!0},C:{X:100.057991,Y:-8440299e-12,Z:118.584145,Active:!0},D:{X:80.47084,Y:-5249853e-11,Z:100.648651,Active:!0},One:{X:99.91794,Y:-74129357e-13,Z:94.52867,Active:!0},Two:{X:100.070107,Y:-8775128e-12,Z:104.833641,Active:!0},Three:{X:100,Y:0,Z:100,Active:!1},Four:{X:100,Y:0,Z:100,Active:!1}}}],848:[{Name:`无瑕灵君歼殛战`,Text:`极完美神
◆ 中场小怪：
ＭT - 西（9点）
ST - 东（3点）
◆ 晶石引爆安全点：场地4点方向`},{Name:`肥宅`,Place:{A:{X:100.137268,Y:.0038394928,Z:81.16358,Active:!0},B:{X:117.04,Y:.006846428,Z:100.089066,Active:!0},C:{X:99.9696655,Y:.00439071655,Z:118.513931,Active:!0},D:{X:82.58859,Y:.006201744,Z:99.69995,Active:!0},One:{X:0,Y:0,Z:0,Active:!1},Two:{X:0,Y:0,Z:0,Active:!1},Three:{X:0,Y:0,Z:0,Active:!1},Four:{X:0,Y:0,Z:0,Active:!1}}}],853:[{Name:`E1S`,Place:{A:{X:91.13257,Y:0,Z:91.52951,Active:!0},B:{X:108.877335,Y:9.536743e-7,Z:92.16696,Active:!0},C:{X:91.39729,Y:0,Z:108.440056,Active:!0},D:{X:108.298889,Y:0,Z:108.410675,Active:!0},One:{X:99.81162,Y:4.76837158e-7,Z:82.28877,Active:!0},Two:{X:100.027077,Y:4.76837158e-7,Z:118.3746,Active:!0},Three:{X:0,Y:0,Z:0,Active:!1},Four:{X:0,Y:0,Z:0,Active:!1}}},{Name:`伊甸零式希望乐园 觉醒之章1`,Text:`/p 《三角攻击》 　　 ¦　 《8人光球》
/p D3　　　　　 D4　 ¦　D3　MT　 D4
/p 　 ST　　 　MT　　 ¦
/p 　　　　◎　　　　　 ¦　ST　 ◎ 　D2
/p 　 D1　　　D2　　 ¦
/p H1　　　　　 H2　 ¦　H1　D1 　H2
/p 　 《2人分摊》 　 ¦　《旋转光球引导》
/p ST/D3　　 MT/D4　 ¦　　　　 D4
/p 　　　 ◎　　　　　 ¦　　H1　◎　H2
/p H1/D1　　H2/D2　 ¦　　　　 D3
/p 《十字陷阱》D1南 D2东 D3西 D4北
/p 《8人光球》远程治疗外侧诱导
/p 《小怪》西MT 东ST　※ST侧优先打`}],854:[{Name:`E2S`,Place:{A:{X:99.9372559,Y:0,Z:102.468506,Active:!0},B:{X:86.2714844,Y:0,Z:81.48967,Active:!0},C:{X:86.9898148,Y:0,Z:118.055969,Active:!0},D:{X:113.07515,Y:381469727e-14,Z:117.857727,Active:!0},One:{X:86.9008942,Y:-9.536743e-7,Z:100.3936,Active:!0},Two:{X:113.457932,Y:-9.536743e-7,Z:100.293045,Active:!0},Three:{X:0,Y:0,Z:0,Active:!1},Four:{X:0,Y:0,Z:0,Active:!1}}},{Name:`伊甸零式希望乐园 觉醒之章2`,Text:`/p 　 《八方散開》 　 ¦ 　《踩光柱》
/p 　 　　MT　 ¦ 　D3　　D4
/p 　　D3　 D4 ¦ 　　　MT
/p 　ST 　 ◎ D2　 ¦ 　ST ◎ D2
/p 　　H1　 H2 　 ¦ 　　 D1
/p 　 　 　D1　 　　 ¦ 　H1　　H2
/p 　 《黑白配》　 ¦ 《核爆》
/p MT/D4 ¦ T
/p ST/D3 ◎ H2/D2 ¦　　 ◎
/p H1/D1 ¦ 　D　　　 H`}],855:[{Name:`E3S`,Place:{A:{X:90.69979,Y:0,Z:81.42189,Active:!0},B:{X:108.98317,Y:9.536743e-7,Z:81.5657349,Active:!0},C:{X:81.33156,Y:0,Z:104.841118,Active:!0},D:{X:118.817116,Y:0,Z:104.770538,Active:!0},One:{X:95.10125,Y:-9.536743e-7,Z:99.67487,Active:!0},Two:{X:105.042946,Y:0,Z:99.52861,Active:!0},Three:{X:0,Y:0,Z:0,Active:!1},Four:{X:0,Y:0,Z:0,Active:!1}}},{Name:`伊甸零式希望乐园 觉醒之章3`,Text:`/p 《分散》 | 《暴风雨运动会》
/p MT ST | 左上集合沿着Boss圈放置
/p D1 D2 | 《觉醒大海嘯》
/p D3 D4 | 左：治疗、强压D、MT
/p H1 H2 | 右：其他DPS、ST
/p 灵泉处理顺序：治疗->近->治疗->远`}],856:[{Name:`E4S`,Place:{A:{X:89.25536,Y:0,Z:88.5073242,Active:!0},B:{X:110.960938,Y:190734863e-14,Z:88.38228,Active:!0},C:{X:89.05167,Y:9.536743e-7,Z:111.250984,Active:!0},D:{X:110.799,Y:9.536743e-7,Z:111.164795,Active:!0},One:{X:91.20058,Y:190734863e-14,Z:93.7162552,Active:!0},Two:{X:90.92575,Y:9.536743e-7,Z:107.869553,Active:!0},Three:{X:100,Y:0,Z:100,Active:!1},Four:{X:100,Y:0,Z:100,Active:!1}}},{Name:`P1`,Text:`/p -------------------------↓P1↓-------------------------
/p 【三连踩】MT无敌→ST无敌
/p 【分散散开】
/p 《起始阶段》 | 《车阶段》
/p D3　ST　MT　D4 | D3 MT D4
/p 　 D1 D2 | ST ◎ D2
/p H1 H2 | H1 D1 H2
/p 【变形阶段】
/p 　　分摊：Boss最近一格
/p 　　分散：Boss从近到远 D→T→H
/p 　　停车：当前一仇停车
/p 【陨石阶段】
/p 陨石： 西→东/TH:北/DPS:南
/p 躲雷： 三穿一/二穿一（协商调整）`},{Name:`P2`,Text:`/p -------------------------↓P2↓-------------------------
/p 【大地双拳】死刑：MT西 / ST:西北角落
/p 　　　　　　蓝标：东北
/p 【高低地】
/p 　■第1次：DPS北/TH南
/p 　■第2次：分摊北 / 其他南
/p 【石牢】H1南 / H2北
/p 【长方形地板】
/p 　摊 D
/p 　 T H 摊 D□□
/p 　□□　　T H □蓝
/p 　□蓝`}],858:[{Name:`缇坦妮雅歼殛战`,Text:`极妖灵王
◆ 踩水圈
H1　MT      H2
ST    D2
D3    D1      D4
◆ 火分摊
西1点：ST  H1 D1 D3
东2点：MT H2 D2 D4
◆ 荆棘扯线
西北：TH     东南：D    ※顺时针旋转
◆ 雷截线
西1点：D1→D2→D3→D4→H1→ST
◆ 小怪
西：ST     北：MT`},{Name:`妖灵王`,Place:{A:{X:100.002243,Y:-196695328e-14,Z:81.3506546,Active:!0},B:{X:118.654472,Y:-196695328e-14,Z:100.006805,Active:!0},C:{X:100.023895,Y:-5.960464e-8,Z:118.626984,Active:!0},D:{X:81.3446045,Y:-196695328e-14,Z:99.9919739,Active:!0},One:{X:93.317215,Y:-5.960464e-8,Z:100.022911,Active:!0},Two:{X:106.674713,Y:1847744e-12,Z:100.017967,Active:!0},Three:{X:0,Y:0,Z:0,Active:!1},Four:{X:0,Y:0,Z:0,Active:!1}}}],885:[{Name:`哈迪斯孤念歼灭战`,Text:`极哈迪斯
■P1散开　　 　　　■陨石(塔)処理
D3　MT　D4　　　北→东：MT　南→西：ST
ST　◎　　D2　　 　■牢狱
H1　D1　H2　　　西北H1　东南H2
■分摊 ←MT/D1/D3/H1 　ST/D2/D4/H2→
■接线 北：T 南：H
■法则改变　　　 　■殉教者的记忆
D4/MT　　　　　　D1　D2
D3H1 ◎ H2D2　　 ST/H1 ◎  H2/MT
D1/ST　　　　　 　D3　D4
(※TH站点上（地标线○的交点）)
■魔法记述阵 圆：没有的缺口
镜子：没有的缺口对向的缺口/中央镜子背面的缺口
■深淵　←ST/D1/H1| ↑ | ↑ | MT/D2/H2→ (分摊)
← D3 (放球) D4 →`},{Name:`极哈安全点`,Place:{A:{X:100.11734,Y:-9.536743e-7,Z:95.47624,Active:!0},B:{X:104.621529,Y:0,Z:99.83995,Active:!0},C:{X:100.047348,Y:190734863e-14,Z:104.507813,Active:!0},D:{X:95.30611,Y:0,Z:99.79571,Active:!0},One:{X:94.99098,Y:9.536743e-7,Z:95.6959839,Active:!0},Two:{X:104.888252,Y:0,Z:96.08912,Active:!0},Three:{X:0,Y:0,Z:0,Active:!1},Four:{X:0,Y:0,Z:0,Active:!1}}}],887:[{Name:`亚历山大绝境战`,Place:{A:{X:100.003,Y:0,Z:80.801,Active:!0},B:{X:119.115,Y:0,Z:99.922,Active:!0},C:{X:99.995,Y:0,Z:113.659,Active:!0},D:{X:86.131,Y:0,Z:99.805,Active:!0},One:{X:106.833,Y:0,Z:99.988,Active:!0},Two:{X:100.026,Y:0,Z:111.451,Active:!0},Three:{X:116.01,Y:0,Z:98.394,Active:!0},Four:{X:116.008,Y:0,Z:101.664,Active:!0}}}],897:[{Name:`极红兵`,Place:{A:{X:99.719,Y:0,Z:118.477,Active:!0},B:{X:88.42,Y:0,Z:114.409,Active:!0},C:{X:81.484,Y:0,Z:96.386,Active:!0},D:{X:89.63,Y:0,Z:85.026,Active:!0},One:{X:101.501,Y:0,Z:81.279,Active:!0},Two:{X:114.05,Y:0,Z:85.897,Active:!0},Three:{X:118.882,Y:0,Z:99.233,Active:!0},Four:{X:111.467,Y:0,Z:115.661,Active:!0}}}],906:[{Name:`E5S`,Place:{A:{X:89.901,Y:0,Z:89.616,Active:!0},B:{X:109.807,Y:0,Z:89.888,Active:!0},C:{X:109.872,Y:0,Z:109.909,Active:!0},D:{X:90.357,Y:0,Z:109.704,Active:!0},One:{X:95.97,Y:0,Z:94.666,Active:!0},Two:{X:104.077,Y:0,Z:94.714,Active:!0},Three:{X:104.035,Y:0,Z:104.712,Active:!0},Four:{X:96.008,Y:0,Z:104.818,Active:!0}}},{Name:`伊甸零式希望乐园 共鸣之章1`,Text:`/p ■雷云和雷暴　　　　　　¦■撞柱
/p 　　Ｄ３　　　　Ｄ４　　 ¦  BOSS
/p 　　　ＭＴ　　ＳＴ　　　 ¦　D1
/p 　　　　　 ●　　　　 　  ¦　D2
/p 　　　Ｄ１　　Ｄ２　　　 ¦   坦克
/p 　　Ｈ１　　　　Ｈ２　　 ¦　D3
/p -- -- -- -- -- -- -- -- -- -- -- -- -- ¦　D4
/p ■链雷远程传　　　　　　¦　H1
/p 　　　MT  　ＳＴ　　　　¦　H2
/p 　　　　　●　　　　　　¦■T挡冲锋
/p 　　　Ｄ１　  D２　　　　¦　MT＞ST
/p  　Ｄ３Ｈ１　  Ｈ２Ｄ４    　¦
/p ■奶>远>近>奶　　　　 　¦`}],907:[{Name:`E6S`,Place:{A:{X:100.34,Y:0,Z:87.646,Active:!0},B:{X:113.004,Y:0,Z:100.46,Active:!0},C:{X:99.54,Y:0,Z:113.13,Active:!0},D:{X:86.71,Y:0,Z:99.536,Active:!0},One:{X:95.152,Y:0,Z:95.508,Active:!0},Two:{X:105.858,Y:0,Z:95.713,Active:!0},Three:{X:105.54,Y:0,Z:106.498,Active:!0},Four:{X:95.513,Y:0,Z:106.422,Active:!0}}},{Name:`6s宏-坦远同向`,Text:`/p ■基本站位
/p 　MT/D3　　ST/D4
/p 　H1/D1　　H2/D2
/p ■火接线　远程双H
/p ■双体　　左：STH1D3D4 / 右：MTH2D1D2
/p ■切割　　死刑１点 　　※切割左/上集合
/p ■火龙卷(同向式)TH→西、DPS→东
/p            MT/H
/p 　D1D3　D2D4
/p             ST/H　　　※同侧D3D2换
/p ■合体接线
/p 　先H1MTSTH2 / 后D3D1D2D4
/p 　※四角分摊后TH不动，D顺时针移动45度`},{Name:`子言6s宏-坦远同向`,Text:`/p ┌【双人分摊及扇形】┬【火神业火拳接线】┐
/p │││第一次远程双　│
/p │││第二次点名远程　│
/p ├─────────┼─────────┤
/p ├【双体阶段分组】─┼【火龙卷：同向式】┤
/p │││　　连线　　│
/p │││││
/p │在标点处理死刑│　　连线　　│
/p │场地切割左或上集合│同侧双圈换│
/p ├─────────┼─────────┤
/p ├【合体业火拳引导】┼【分摊后接业火拳】┤
/p │先│四角分摊后不动│
/p │后│顺时针移动度│
/p └─────────┴─────────┘`},{Name:`6s宏-坦近徘徊`,Text:`/p ■基本站位
/p 　MT/D1　　ST/D2
/p 　H1/D3　　H2/D4
/p ■火接线　远程双H
/p ■双体　　左：STH1D3D4 / 右：MTH2D1D2
/p ■切割　　死刑１点 　　※切割左/上集合
/p ■火龙卷(徘徊式)TH→西、DPS→东
/p            MT/H
/p 　D1D3　D2D4
/p             ST/H　　　※同侧D3D2换
/p ■合体接线
/p 　先H1MTSTH2 / 后D3D1D2D4
/p 　※四角分摊后TH不动，D顺时针移动45度`},{Name:`子言6s宏-坦近徘徊`,Text:`/p ┌【双人分摊及扇形】┬【火神业火拳接线】┐
/p │││第一次远程双　│
/p │││第二次点名远程　│
/p ├─────────┼─────────┤
/p ├【双体阶段分组】─┼【火龙卷：徘徊式】┤
/p │││　　连线　　│
/p │││││
/p │在标点处理死刑│　　连线　　│
/p │场地切割左或上集合│同侧双圈换│
/p ├─────────┼─────────┤
/p ├【合体业火拳引导】┼【分摊后接业火拳】┤
/p │先│四角分摊后不动│
/p │后│顺时针移动度│
/p └─────────┴─────────┘`}],908:[{Name:`E7S`,Place:{A:{X:94.971,Y:0,Z:81.107,Active:!0},B:{X:119.297,Y:0,Z:94.201,Active:!0},C:{X:105.09,Y:0,Z:118.921,Active:!0},D:{X:80.79,Y:0,Z:104.581,Active:!0},One:{X:98.935,Y:0,Z:98.541,Active:!0},Two:{X:101.153,Y:0,Z:101.152,Active:!0},Three:{X:108.988,Y:0,Z:91.111,Active:!0},Four:{X:0,Y:0,Z:0,Active:!1}}},{Name:`7s宏-集合式`,Text:`/p ■基本/小怪/夜袭　¦■极夜机动
/p 　　　●　　　　　¦　　　　ＭＴ
/p 　MT　　S T　　　¦　　　　ＳＴ
/p 　D1　　D2　　　¦　　　DPS分摊
/p 　D3　　D4　　　¦　　　　Ｈ１
/p 　H1　　H2　　　¦　　　　Ｈ２
/p -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- --
/p ■中央左右分摊　　¦■包围号令　※近战同色D2D3互换
/p 　ＭＴ　ＳＴ　　　 ¦　北/东：Ｔ　　　   南/西：H
/p 　Ｈ１　Ｈ２ 　　　¦　　  北：D1D2 　　　南：D3D4
/p -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- --
/p ■夜袭号令（集合式）
/p ■乱舞号令  (吃球：H>D1>D2>D3>D4)
/p 　吹飞:东北　东北:暗　西北:光　南:T`},{Name:`子言7s宏-集合式`,Text:`/p ┌─球连线传送─┬─传送门─┬极夜机动┐
/p │　　　│红动　蓝停│　　│
/p ├─┬────┬─┼白夜机动┤　　│
/p │４│　　　　│１ │　││
/p │３││２ │　││
/p │　││　│　│　　│
/p ├─┴────┴─┤　│　　│
/p ├─包围号令─┬─┴──┬──┴────┤
/p │　　●　　　├夜袭号令┼─鸽龙卷站位─┤
/p │　　　│集合式│　　  │　　  　│
/p │　　　　●│左下右上│白色／＼黑色　│
/p │●　　　　│红动蓝停│　／　　＼　　│
/p │　　　│左侧放圈│／　坦克　＼　│
/p │　　　●　　└────┼─撞球优先级─┤
/p └近战同色交换踩塔┴》小》大┘`},{Name:`7s宏-分散式`,Text:`/p ■基本/小怪/夜袭　¦■极夜机动
/p 　　　●　　　　　¦　　　　ＭＴ
/p 　MT　　S T　　　¦　　　　ＳＴ
/p 　D1　　D2　　　¦　　　DPS分摊
/p 　D3　　D4　　　¦　　　　Ｈ１
/p 　H1　　H2　　　¦　　　　Ｈ２
/p -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- --
/p ■中央左右分摊　　¦■包围号令　※近战同色D2D3互换
/p 　ＭＴ　ＳＴ　　　 ¦　北/东：Ｔ　　　   南/西：H
/p 　Ｈ１　Ｈ２ 　　　¦　　  北：D1D2 　　　南：D3D4
/p -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- --
/p ■夜袭号令（分散式）
/p ■乱舞号令（吃球：H>D1>D2>D3>D4)
/p 　吹飞:东北　东北:暗　西北:光　南:T`},{Name:`子言7s宏-分散式`,Text:`/p ┌─球连线传送─┬─传送门─┬极夜机动┐
/p │　　　│红动　蓝停│　　│
/p ├─┬────┬─┼白夜机动┤　　│
/p │４│　　　　│１ │　││
/p │３││２ │　││
/p │　││　│　│　　│
/p ├─┴────┴─┤　│　　│
/p ├─包围号令─┬─┴──┬──┴────┤
/p │　　●　　　├夜袭号令┼─鸽龙卷站位─┤
/p │　　　│分散式│　　  │　　  　│
/p │　　　　●│左下右上│白色／＼黑色　│
/p │●　　　　│红动蓝停│　／　　＼　　│
/p │　　　│内侧放圈│／　坦克　＼　│
/p │　　　●　　└────┼─撞球优先级─┤`}],909:[{Name:`E8S内DD`,Place:{A:{X:99.982,Y:0,Z:83.858,Active:!0},B:{X:116.107,Y:0,Z:100.05,Active:!0},C:{X:99.849,Y:0,Z:115.99,Active:!0},D:{X:83.868,Y:0,Z:100.243,Active:!0},One:{X:94.216,Y:0,Z:105.596,Active:!0},Two:{X:105.674,Y:0,Z:105.697,Active:!0},Three:{X:94.392,Y:0,Z:94.402,Active:!0},Four:{X:105.68,Y:0,Z:94.413,Active:!0}}},{Name:`E8S`,Place:{A:{X:99.982,Y:0,Z:83.858,Active:!0},B:{X:116.107,Y:0,Z:100.05,Active:!0},C:{X:99.849,Y:0,Z:115.99,Active:!0},D:{X:83.868,Y:0,Z:100.243,Active:!0},One:{X:88.461,Y:0,Z:111.284,Active:!0},Two:{X:111.292,Y:0,Z:111.234,Active:!0},Three:{X:88.517,Y:0,Z:88.768,Active:!0},Four:{X:111.538,Y:0,Z:88.907,Active:!0}}},{Name:`果子E8S宏前半`,Text:`/p 《菓子系列》E8S专用宏
/p —————————————————————
/p ◆钻石星尘/光之失控
/p —————————————————————
/p T　　 　　　H｜驱散：H1=T、H2=H
/p D1 D2 D3 D4｜三角：T西北、H东南
/p —————————————————————
/p 正方形连线：左D与T换位
/p 沙漏形连线：左D与H换位
/p —————————————————————
/p ◆钢铁月环"X"型 ｜◆钢铁月环"十"型
/p —————————————————————
/p MT/D3　ST/D4 ｜　 　　MT/D3
/p 　　 　　　 　 　 ｜H1/D1　　　ST/D4
/p H1/D1　H2/D2｜　 　　H2/D2`},{Name:`果子E8S宏后半`,Text:`/p —————————————————————
/p ◆默认分组
/p 左：MT H1 D1 D3、右：ST H2 D2 D4
/p —————————————————————
/p ◆小怪阶段
/p 截线：H→T→远→近
/p 沉默：左边远→T、右边T两次
/p —————————————————————
/p ◆冰光龙诗
/p —————————————————————
/p D3　 MT 　D4 ｜ H1驱散DPS↓
/p 　 H1 ▼ H2 　 ｜
/p D1 　 ST 　 D2 ｜ H2驱散DPS↑
/p —————————————————————
/p ◆红蓝调整：D2D3换位`}],912:[{Name:`红宝石神兵狂想作战`,Text:`极红玉神兵
《地面液化》
ST
D1　　　D2
H1　　　　 H2
D3　　　D4
MT
☆掘地雷：顺时针方向放置
《利爪突进》
D1　　　D2
H1　　　　 H2
D3　　　　　D4
MT　　　ST
☆陨石1：以北为起始点，顺时针放置
☆陨石2：MT西南/ST东北`}],913:[{Name:`博兹雅堡垒追忆战`,Text:`极老屁股
【基本分散】       I           【分摊】
H1　MT　D4       I
I MT/H1          ST/H2
D1　　  　D2       I D1/D3          D2/D4
I
D3　 ST  H2　  I  ※南北(顺时针转)
ーーーーーーーーーーーーーーーーーーーー
【魔导电火花】   I           【更强】
MT                   ST   I   ①基本分散
H1               H2    |   ②内侧移动
D1         D2       I   ③顺时针移动
D3 D4          I   ④逆时针移动`}],923:[{Name:`光之战士幻耀歼灭战`,Text:`极光战
■基本站位　　 　　　　■LB3/塔8连/战士引导/忍者(防击退)
D3　MT　 D4　　　　　　 　MT/D3
H1　 ★ 　 H2　　　　　H1/D1 ★ H2/D4
D1　 ST 　D2　　　 　　　　ST/D2
―――――――――――――――――――
■巴哈线/暗四角　 　　■LB1/诗人距离衰减(中央分摊)
MT/D3　　H2/D4　　　　　   T
H　　 H
H1/D1 　　ST/D2　　　　　 DPS
―――――――――――――――――――
■LB2/小怪(线TH塔DPS)
西：MTH1D1D3　　东：STH2D2D4
―――――――――――――――――――
※※【陨石十字】【忍者防击退】※※`}],930:[{Name:`希瓦幻巧战`,Text:`幻希瓦
◆ X型分散　｜◆ 十型分散
———————————————————
D3　　　D4  ｜　 　 D3
MT　ST　 ｜　 　 MT
｜H1 D1　　ST D4
D1　D2　 ｜　 　 D2
H1　　　H2  ｜　 　 H2
———————————————————`}],935:[{Name:`绿宝石神兵狂想作战`,Place:{A:{X:108.435,Y:0,Z:82.009,Active:!0},B:{X:118.916,Y:0,Z:86.765,Active:!0},C:{X:94.038,Y:0,Z:118.32,Active:!0},D:{X:82.407,Y:0,Z:112.211,Active:!0},One:{X:112.197,Y:0,Z:81.463,Active:!0},Two:{X:118.671,Y:0,Z:91.679,Active:!0},Three:{X:89.665,Y:0,Z:118.247,Active:!0},Four:{X:82.778,Y:0,Z:108.454,Active:!0}}},{Name:`绿宝石神兵狂想作战`,Text:`/p      【生成炸弹】　　　　【第二次】
/p  　　 MT/D3　　　　　　确认北边球的颜色
/p H1/D1　　 H2/D4　　　橙色→顺时针
/p 　  　 ST/D2　　　　　　 蓝色→逆时针
/p ――――――――――――――――――――
/p      【分而治之】　　　　【坦核爆处理】
/p 　　　MT/ST　　　　　　　MT　　　　ST
/p H1　　　■　　　H2　　　　　　〇
/p 　D1  D3   D4  D2　　 　        　〇　〇
/p 　　　　　　　　　　　　　　（其他人）`}],946:[{Name:`E9S`,Place:{A:{X:99.848,Y:0,Z:81.259,Active:!0},B:{X:118.795,Y:0,Z:99.783,Active:!0},C:{X:99.984,Y:0,Z:118.863,Active:!0},D:{X:81.267,Y:0,Z:100.201,Active:!0},One:{X:111.671,Y:0,Z:87.924,Active:!0},Two:{X:111.868,Y:0,Z:111.561,Active:!0},Three:{X:88.489,Y:0,Z:111.755,Active:!0},Four:{X:88.4,Y:0,Z:87.633,Active:!0}}},{Name:`伊甸零式希望乐园 再生之章1`,Text:`/p ===========9s==============
/p 【暗之战技：散开】【暗之战技：分摊】
/p D3　 MT　D4　 ｜ 　 　 MTD3
/p H1 　 ■ 　 H2　 ｜H1D1 　 　D4H2
/p D1 　 ST 　D2　｜ 　 　 STD2
/p 　　　【广角：高射】
/p ←左 MTD1D3H1　STD2D4H2 右→
/p ------十字荆棘AOE-------------波动球(踩塔)-----
/p ｜        MT  D2            ｜ D3           H2
/p ｜H1        　       D4   ｜ 　D1    ST
/p ｜H2       　        D3   ｜ 　D2    MT
/p ｜         ST  D1            ｜ D4             H1
/p ●放下荆棘后向踩塔方向散开
/p ●暗之浸蚀 1MT无敌　2ST无敌　3换T　4MT无敌
/p 【暗黑天空】　|　【云十字站位】
/p 　　　|　　　 D3
/p 　MTD3D2 　 |　　　 MT
/p 　H1 ■ H2 　 | H1D1 ■ D2H2
/p 　D1 D4ST 　 |　 　　 ST
/p 　　　|　 　　D4
/p 【暗黑天空中暗之战技】
/p 　　　D3　｜　 D3
/p 　 MT D2　｜　 H1MT
/p H1D1 ■ 　｜　 ■ D2 H2
/p 　 ST H2　｜　 D1 ST
/p 　　　D4　｜　 D4`}],947:[{Name:`E10S`,Place:{A:{X:99.951,Y:0,Z:85.696,Active:!0},B:{X:114.055,Y:0,Z:99.873,Active:!0},C:{X:100.035,Y:0,Z:113.913,Active:!0},D:{X:85.976,Y:0,Z:100.091,Active:!0},One:{X:114.408,Y:0,Z:85.232,Active:!0},Two:{X:114.333,Y:0,Z:114.398,Active:!0},Three:{X:85.747,Y:0,Z:114.304,Active:!0},Four:{X:86.266,Y:0,Z:86.21,Active:!0}}},{Name:`伊甸零式希望乐园 再生之章2`,Text:`/p 伊甸零式希望乐园 再生之章2
/p 【基本散开】 ｜ 【虚无之门】
/p 　D3MTD4　　｜　　D3MT
/p 　H1 ■ H2　　｜　H1　　D4
/p 　D1 STD2　　｜　D1　　H2
/p 　　　 　             ｜ 　　STD2
/p 【暗影珠】12点1点分
/p  H1D1D3逆时针撞1橙      H2D2D4顺时针撞2橙
/p  MT逆时针撞1紫      ST顺时针撞2紫
/p 【暗影召唤+暗影珠】
/p ※从安全区域面朝场中判断暗影珠来球方向
/p  左：MTH1D1D3↑STH2D2D4：右
/p 【离别之锁】
/p  TN：北　DPS：南`}],948:[{Name:`E11S`,Place:{A:{X:100.022,Y:0,Z:90.173,Active:!0},B:{X:109.805,Y:0,Z:99.85,Active:!0},C:{X:100.064,Y:0,Z:110.009,Active:!0},D:{X:90.066,Y:0,Z:100.047,Active:!0},One:{X:106.875,Y:0,Z:92.82,Active:!0},Two:{X:106.885,Y:0,Z:106.837,Active:!0},Three:{X:93.119,Y:0,Z:107.076,Active:!0},Four:{X:93.154,Y:0,Z:92.941,Active:!0}}},{Name:`伊甸零式希望乐园 再生之章3`,Text:`/p     【八方散开】                                【点名】
/p 　　D3MTD4　 　　　            雷：光→北
/p 　　H1 ■ H2　 　　 　                   炎→南
/p 　　D1ST D2 　　 　                   【至天绝技】
/p ※炎(分摊)→DPS顺时针旋转　　雷→北　炎→南
/p              【光分摊】
/p 　 　　　MTST
/p 　H1D1D3 ■H2D2D4
/p 【第二次转轮召唤：固定位置】
/p 　　 D3　MT
/p 　H1　 　 　D4
/p 　D1　 　 　H2
/p 　　 ST　D2
/p 【雾龙】背后BOSS举起手的人、以及对面的人，走向场中`}],949:[{Name:`果子`,Place:{A:{X:-.051,Y:75,Z:-84.346,Active:!0},B:{X:9.639,Y:75,Z:-75.061,Active:!0},C:{X:-.019,Y:75,Z:-65.039,Active:!0},D:{X:-9.623,Y:75,Z:-75.007,Active:!0},One:{X:-7.198,Y:75,Z:-68.006,Active:!0},Two:{X:7.079,Y:75,Z:-68.021,Active:!0},Three:{X:-7.006,Y:75,Z:-82.012,Active:!0},Four:{X:7.124,Y:75,Z:-82.047,Active:!0}}},{Name:`E12S`,Place:{A:{X:-.051,Y:75,Z:-84.346,Active:!0},B:{X:9.639,Y:75,Z:-75.061,Active:!0},C:{X:-.019,Y:75,Z:-65.039,Active:!0},D:{X:-9.623,Y:75,Z:-75.007,Active:!0},One:{X:7.124,Y:75,Z:-82.047,Active:!0},Two:{X:7.079,Y:75,Z:-68.021,Active:!0},Three:{X:-7.198,Y:75,Z:-68.006,Active:!0},Four:{X:-7.006,Y:75,Z:-82.012,Active:!0}}},{Name:`门神`,Text:`/p 《菓子系列》E12S专用宏
/p ————————————————————————
/p ◆希瓦分散　|  ◆分组方法
/p D3 MT D4　|  MT组：MT、H1、D1、D3（A-1）
/p H1  ▲  H2　|   ST组 ：ST、H2、D2、D4（4-C）
/p D1 ST  D2　|   (兄贵分组D3D4前 、D1D2背)
/p ————————————————————————
/p 　◆泰坦1 　 |   　 ◆泰坦2　　| 　   ◆泰坦3
/p 　    蓝D 　    |   　      蓝1　  　 |   蓝TH 　   蓝D
/p 橙TH　  橙D |   橙TH 　   橙D   |
/p 黄H 黄T 黄D |   　　  蓝2      　 |   黄TH  橙  黄D
/p 　（蓝1←MTSTH1H2D4D3D2D1→蓝2）
/p ◆狮子(AkitoTT)
/p 北：H1→MT→H1 / D3→D1→D3
/p 南：H2→ST→H2  / D4→D2→D4`},{Name:`本体`,Text:`/p ——————————————————————————
/p ◆开场先分散　　　|　◆开场后分散　　　　|　◆二运分散
/p 　D3 MT D4  　 　 |　 　 　 　MT 　　　　 |　　D3 MT D4
/p 　D1  ▲  D2 　 　  |　　 D1 　▲ 　D2　　 |　　H1  ▲  H2
/p 　H1  ST  H2 　 　 | 　 D3　　ST　　D4 　 |　　D1 ST  D2
/p 　 　 　 　 　 　 　  | 　 　 H1　 　 H2　 　  |
/p ——————————————————————————
/p ◆第一次地火后分散|　◆第二次地火后分散　|　◆一运优先级
/p 　D1　D2　 　 　  |　　　D1　　D2　　　|　西←D1D2D3D4→东
/p 　MT　ST　  　 　  |　　　MT　　ST　　 　|　◆三运分组
/p 　H1　H2　D4 　 |　D3  H1　　H2　D4  |　北：MT、H1、D1、D3
/p 　 　　 D3　 　  　 |　 　 　 　　 　 　  　 　|　南：ST、H2、D2、D4
/p ↑左半场安全则D3D4镜像翻转 　 　 　 　 　|　(同BUFF时D2D3互换)`}],951:[{Name:`钻石神兵狂想作战`,Place:{A:{X:80.008,Y:0,Z:100.076,Active:!0},B:{X:120.034,Y:0,Z:99.897,Active:!0},C:{X:0,Y:0,Z:0,Active:!1},D:{X:0,Y:0,Z:0,Active:!1},One:{X:88.626,Y:0,Z:81.626,Active:!0},Two:{X:111.198,Y:0,Z:81.499,Active:!0},Three:{X:88.771,Y:0,Z:118.481,Active:!0},Four:{X:111.349,Y:0,Z:118.481,Active:!0}}}],968:[{Name:`莫古力P1`,Text:`/p P1锁链点名 索尼 ｜ 白球冲锋：骑士12点，下半场躲避
/p    △H  ×T   □T   ｜ 深仁厚泽打断：ST→远敏→MT
/p    ○D          ○D   ｜ 钢铁：全维空间/月环：无维空间
/p    □D  ×H  △D   ｜ P1.5引导：奶→远→近→T
/p                              右 左 右 左`},{Name:`莫古力P2`,Text:`/p 一运雷分散   ｜ 二运分组：D12补位
/p         奶          ｜ MTH1       STH2
/p    近  T  远     ｜  D1D3       D2D4
/p  3C4D-MT组 |     2刀            1刀
/p  1A2B-ST组  |     脚下           对面
/p ————————————————
/p              MTD1             ｜ 固定AC陨石整组换位（除非BD正好出现陨石）
/p  H1D3            H2D4  ｜ 第一次踩塔：陨石＞DPS＞TN，对应塔：场外中左右＞场内左手
/p              STD2              ｜ 第二次踩塔：陨石＞DPS＞TN，按换位后的组同色标点塔正＞斜`},{Name:`莫古力P3`,Text:`/p 【莫古力龙诗站位宏P3】
/p 牙尾的连旋：分摊-钢铁-月环
/p 尾牙的连旋：分摊-月环-钢铁
/p ————————————————
/p 【麻将阶段】预站位｜【麻将阶段】小抄
/p               A               ｜  注意麻将组内点名，B上D下
/p       4②       ②1       ｜ 处理麻将时请注意钢铁月环
/p           ③③③           ｜ ①C：放塔-回人群-分摊-踩3塔-引导
/p   B①          ①D    ｜  ①BD：放塔-回人群-踩2塔-引导-回人群-分摊
/p       3      ①     2       ｜  ② BD：分摊-连旋-放塔-回人群-分摊-踩3塔-引导
/p                C               ｜  ③BCD：分摊-踩1塔-引导-连旋-放塔-回人群
/p ————————————————
/p 【8人4塔阶段】 ｜ 4近战负责补塔，顺序：左→右→中
/p MTD3      STD4 ｜组内只有1座塔，补位；组内超过2座塔，不动
/p H1D1      H2D2｜死刑：MT接本体，ST接分身，本体/分身脚下处理`},{Name:`莫古力P4~P7`,Text:`/p 【P4撞球阶段】      ｜【陨石流】D12→D34→第一轮点名
/p 场中换色，DPS先撞｜ 左上角开始顺、逆时针数的第一个点名
/p         MT    ST          ｜  MT       ST
/p D12蓝      红D34    ｜       人群（蓝龙眼）
/p         H1    H2         ｜  H2       H1
/p ————————————————
/p  【P5死宣+锁链】｜ 【P7接刀】D12→D34→H12
/p   △无  X无  □无   ｜ 【死亡轮回/狂暴】BOSS面向！
/p   ○死           ○死  ｜ H1D3D1           H2D4D2
/p   □死  X无  △死   ｜                  MTST
/p 【P6传毒】DTTDD最后一次原地，其他全部场中处理
/p 【P6十字火阶段↓】｜ 【P6光翼死刑】MT固定中，ST找位置
/p V字放地火，从场边跑到场中时的面向处理点名
/p 攻击1 2 3 4 ←o→ 锁链2禁止2 锁链1禁止1
/p 【P6双龙俯冲+P7地火左右出】MT去左，ST去右`},{Name:`莫古力减伤宏`,Text:`/p 【莫古力龙诗减伤宏P1~P7】只安排目标减伤，场地减伤请队内自行沟通
/p P1至圣：MT雪仇、D1牵制                     ｜P2古代爆震：MT雪仇、D1牵制、D4昏乱
/p P1锁链点名：ST雪仇、D2牵制、D4昏乱｜P2碎屏斩：ST雪仇、D2牵制、D4昏乱
/p ————————————————
/p P3第一次连旋：MT雪仇、D1牵制               ｜P4陨石流：给不给都可以
/p P3第二次连旋：ST雪仇、D2牵制、D4昏乱 ｜P4.5纯洁心灵：ST雪仇、D2牵制、D4昏乱
/p ————————————————
/p P5第一次古代爆震：MT雪仇、D1牵制              ｜P6两次血量检测：MT雪仇
/p P5第二次古代爆震：ST雪仇、D2牵制、D4昏乱｜P6死亡轮回：ST雪仇、D1牵制、D4昏乱
/p ————————————————
/p 转场，超大AOE注意减伤嗷！别好不容易要进P7了结果噶了嗷！MTST给D34减伤，H12D12开特色减伤，龙骑找奶妈要
/p ————————————————
/p P7第一次死亡轮回：MT雪仇、D1牵制、D4昏乱  ｜P7第一次陨石：ST雪仇、D2牵制
/p P7第二次死亡轮回：MT雪仇                 ｜P7第二次陨石：ST雪仇  、D1牵制、D4昏乱
/p P7第三次死亡轮回：别看了！有什么给什么！留着过年吗？
（如果觉得第二次死亡轮回的压力过大，可以考虑2死亡轮回D2牵制）`},{Name:`陨石逃课宏 需要连打+锁60帧  <a href='https://docs.qq.com/doc/DSkpLTVNTT2doT2Rz' target='_blank'>来源</a>`,Text:`/mlock
/merror off
/automove on <wait.1>
/automove off
/echo
/echo
/echo
/echo
/echo
/echo
/echo
/echo
/echo
/echo
/echo`},{Name:`陨石宏 @竹取辉夜姬`,Text:`/automove on <wait.1>
/automove off`},{Name:`黑色分散buff-攻击标`,Text:`/macrolock
/macroicon attack1 marking
/mk attack <me>
/wait 1`},{Name:`白色分摊buff-锁链标`,Text:`/macrolock
/macroicon bind1 marking
/mk bind <me>
/wait 1`},{Name:`无buff-禁止标`,Text:`/macrolock
/macroicon stop1 marking
/mk stop <me>
/wait 1`},{Name:`一键清除标记`,Text:`/mk attack1 <attack1>
/mk attack2 <attack2>
/mk attack3 <attack3>
/mk attack4 <attack4>
/mk attack5 <attack5>
/mk bind1 <bind1>
/mk bind2 <bind2>
/mk bind3 <bind3>
/mk stop1 <stop1>
/mk stop2 <stop2>`},{Name:`P1 门神`,Place:{A:{X:94.265,Y:0,Z:90.057,Active:!0},B:{X:105.559,Y:0,Z:89.944,Active:!0},C:{X:105.687,Y:0,Z:109.95,Active:!0},D:{X:94.363,Y:0,Z:109.892,Active:!0},One:{X:89.994,Y:0,Z:94.231,Active:!0},Two:{X:110.13,Y:0,Z:94.36,Active:!0},Three:{X:110.003,Y:0,Z:105.871,Active:!0},Four:{X:90.049,Y:0,Z:105.51,Active:!0}}},{Name:`P2 @竹取辉夜姬  <a href='https://nga.178.com/read.php?tid=31807681' target='_blank'>来源</a>`,Place:{A:{X:100,Y:0,Z:86.8,Active:!0},B:{X:113.2,Y:0,Z:100,Active:!0},C:{X:100,Y:0,Z:113.2,Active:!0},D:{X:86.8,Y:0,Z:100,Active:!0},One:{X:109.333809,Y:0,Z:90.66619,Active:!0},Two:{X:109.333809,Y:0,Z:109.333809,Active:!0},Three:{X:90.66619,Y:0,Z:109.333809,Active:!0},Four:{X:90.66619,Y:0,Z:90.66619,Active:!0}}}],996:[{Name:`海德林晖光歼灭战`,Text:`/p 【结晶 冰】
/p 　　D3 MT D4
/p 　　H1  ■  H2
/p 　　D1 ST D2
/p 【结晶 水】
/p 　    西：MTD1D3H1　东：STD2D4H2
/p 【结晶 土 / 光芒刃】
/p 　    boss背后
/p 【小怪阶段】
/p        dps从左侧开始先打发光水晶，t将小怪拉到不发光水晶一侧
/p 【第一轮光波】
/p        T：去对面　DPS：北边　H：原地
/p 【幻日】
/p        第三组对侧集合
/p        内侧：MTSTH1D1D2 外侧：H2D3D4`}],998:[{Name:`子言评论区 @辅助不萌 <a href='https://www.bilibili.com/video/BV1PU4y1e72C/?vd_source=583984e97858d637c7db9eb92b042c91' target='_blank'>来源</a>`,Text:`/p 分摊站位
/p MT H1 D1 D2左上
/p ST  H2 D3 D4 右下
/p 踩塔站位
/p  MT   D1
/p  ST    D2
/p  H1   D3
/p  H2   D4
/p 三连点名基础分散站位
/p D1 MT D2
/p H1  ○  ST
/p D3  H2 D4
/p 三连点名最终站位
/p          核爆t
/p 大圈    ○   核爆d
/p          核爆n`},{Name:`斜点角尖击退点 @竹取辉夜姬 <a href='https://nga.178.com/read.php?tid=33015568' target='_blank'>来源</a>`,Place:{A:{X:100,Y:0,Z:83,Active:!0},B:{X:117,Y:0,Z:100,Active:!0},C:{X:100,Y:0,Z:100,Active:!0},D:{X:83,Y:0,Z:100,Active:!0},One:{X:88,Y:0,Z:88,Active:!0},Two:{X:112,Y:0,Z:88,Active:!0},Three:{X:88,Y:0,Z:112,Active:!0},Four:{X:112,Y:0,Z:112,Active:!0}}}],1003:[{Name:`P1S被窝`,Text:`/p 【基本八方】|【P1锁链换位】同色标点
/p D3 MT D4    | MTD3 STD2 H1D1 H2D4
/p H1  ◎   H2   |【冰火侵蚀】
/p D1  ST  D2   |MT和D3第二次固定换颜色
/p                         |第三次根据颜色站位
/p 【四连锁】
/p 红3                 红8
/p              紫3
/p     紫18 ◎ 紫8
/p             紫13
/p 红18              红13
/p 【定时锁链】
/p 人群：红 点名：白`},{Name:`P1S WayMark`,Place:{A:{X:100,Y:0,Z:96,Active:!0},B:{X:104,Y:0,Z:100,Active:!0},C:{X:100,Y:0,Z:104,Active:!0},D:{X:96,Y:0,Z:100,Active:!0},One:{X:90,Y:0,Z:90,Active:!0},Two:{X:110,Y:0,Z:90,Active:!0},Three:{X:110,Y:0,Z:110,Active:!0},Four:{X:90,Y:0,Z:110,Active:!0}}}],1005:[{Name:`P2S被窝`,Text:`/p 【跳跃分摊】
/p    原地：MTH1D1D3
/p    水路：ST H2D2D4
/p 【麻将】
/p    紫三角1234→【1234】（无连线）
/p    蓝方块13：对面 蓝方块24：原地（有连线）
/p 【第二次对冲】
/p 非对冲的H固定站污水地板对角，其余人灵性分散
/p 【多重刻印&污水】←T 分摊 DPS→
/p 【多重刻印&俯冲】DPS：角落 T：边上
/p 【散开→接线】T：对面 人群：原地`},{Name:`P2S WayMark`,Place:{A:{X:87.5,Y:.5,Z:87.5,Active:!0},B:{X:112.5,Y:.5,Z:87.5,Active:!0},C:{X:112.5,Y:.5,Z:112.5,Active:!0},D:{X:87.5,Y:.5,Z:112.5,Active:!0},One:{X:100,Y:0,Z:90,Active:!0},Two:{X:110,Y:0,Z:100,Active:!0},Three:{X:100,Y:0,Z:110,Active:!0},Four:{X:90,Y:0,Z:100,Active:!0}}}],1007:[{Name:`P3S魔法少女`,Text:`/p ┌───■暗之炎────┬─■十字地火─┐
/p │　⑴　│●大球：　　　│
/p │　⑷　　　　　　　⑵　│　　　北西　　│
/p │　⑶　│●小球：　　　│
/p │※顺时针击杀暗之炎　　│　　　11/1点  │
/p ├───────────┴───────┤
/p ├─────■俯冲─────┬─■灵泉─┤
/p │【两侧发光】│【中央发光】│塔：　　　│
/p │↓　　　　↓│西　↓↓　东│　西北│
/p │　　│　│　东南│
/p │　　├──────┘　　　　　│
/p │　　│点名：→→　│
/p │　　│　　　→→　│
/p └──────┴────────────┘
/p ┌─■炎暗劫火分散─┬─■火龙卷站位──┐
/p │　　　　　│　　　　　　│
/p │　　　　　│　　　　　　　　│
/p │　　　　　│　　★　　│
/p │　　　　　│　　　　　　│
/p ├─────────┴─────────┤
/p ├■火龙卷三穿一分散┬■火龙卷击退后分散┤
/p │　　　　　　　　　│　　　　黑　　　　│
/p │　　　　　│　　　　　　　　　│
/p │　　　　　│　　　　　│
/p │　　　　★　　　　│　　　　　│
/p │　　　　　│　　　　　│
/p │　　　　　│　　　　　　　│
/p │　　　　　　　　　│　　　　　│
/p └─────────┴─────────┘`},{Name:`P3S WayMark 魔法少女`,Place:{A:{X:100,Y:0,Z:80,Active:!0},B:{X:120,Y:0,Z:100,Active:!0},C:{X:100,Y:0,Z:120,Active:!0},D:{X:80,Y:0,Z:100,Active:!0},One:{X:100,Y:0,Z:94,Active:!0},Two:{X:106,Y:0,Z:100,Active:!0},Three:{X:100,Y:0,Z:106,Active:!0},Four:{X:94,Y:0,Z:100,Active:!0}}},{Name:`P3S WayMark 被窝`,Place:{A:{X:100,Y:0,Z:91.19,Active:!0},B:{X:108.81,Y:0,Z:100.277,Active:!0},C:{X:100,Y:0,Z:108.81,Active:!0},D:{X:91.19,Y:0,Z:100,Active:!0},One:{X:93.966,Y:.007,Z:93.921,Active:!0},Two:{X:105.988,Y:.007,Z:93.938,Active:!0},Three:{X:106.035,Y:.008,Z:106.026,Active:!0},Four:{X:93.989,Y:.008,Z:105.995,Active:!0}}}],1009:[{Name:`P4S被窝门神`,Text:`/p 【P1拉线 + P3踩塔】     |【踩塔时拉线】
/p    D1/MT　　 D2/ST     |     H1/D3
/p                     ◎                    |     MT/D1
/p    D3/H1  [1]  D4/H2   |     ST/D2
/p                                             |     H2/D4
/p 接毒顺序：D1D2D3D4/MTSTH1H2
/p 【剧场分散】雷火为6点|【撞球】
/p             MT    ST                |D3 MT H2
/p   D3    D1◎D2    D4     |D1 ◎  D2
/p             H1    H2               |H1 ST  D4
/p 【剧场分摊】                   |同组一起顺时针连撞两个
/p   前：MTH1D1D3         |D1D3→A开始 D2D4→C开始
/p   后： STH2D2D4          |MTH2→B开始 STH1→D开始
/p 【死刑】MT无敌→ST无敌→换T（战士无敌）`},{Name:`P4S被窝本体`,Text:`/p          【一运】    | 【三运】MTD4引导
/p  D3　　　  D4  | H1                    |                     MT
/p   　MT　ST        | D3        D1      |        H1      D1
/p   　　   ◎            |              ◎ ST  →   D3◎
/p   　D1　D2       | D4       D2       |        H2      D2
/p  H1　　　H2    | H2                    |                     ST
/p 【二运】以第一次A/B的安全区为12点
/p 无T：11点钟拉线→12点钟踩塔→3点钟分摊  红T：12点钟分摊→3点钟分摊
/p 紫H：5点钟拉线→6点钟踩塔→3点钟踩塔   红H：6点钟分摊→9点钟踩塔
/p 红D：12点钟分摊→9点分摊[D1234]3点分摊 绿D：6点钟分摊→9点钟分摊
/p 【五运】D3　D1　　　ST　H2
/p 　　           荆棘         ◎        荆棘
/p                 D4    D2            MT   H1
/p 【四运】顺时针，蓝三紫一【六运】DPS：10s TH：5s`},{Name:`P4S WayMark 被窝门神`,Place:{A:{X:100,Y:0,Z:85,Active:!0},B:{X:115,Y:0,Z:100,Active:!0},C:{X:100,Y:0,Z:115,Active:!0},D:{X:85,Y:0,Z:100,Active:!0},One:{X:100,Y:0,Z:102.5,Active:!0},Two:{X:100,Y:0,Z:107.5,Active:!0},Three:{X:0,Y:0,Z:0,Active:!1},Four:{X:0,Y:0,Z:0,Active:!1}}},{Name:`P4S WayMark 被窝本体`,Place:{A:{X:99.058,Y:0,Z:81.135,Active:!0},B:{X:119.352,Y:0,Z:99.316,Active:!0},C:{X:100.747,Y:0,Z:119.114,Active:!0},D:{X:80.574,Y:0,Z:101.415,Active:!0},One:{X:105.052,Y:0,Z:84.859,Active:!0},Two:{X:114.869,Y:0,Z:104.923,Active:!0},Three:{X:95.007,Y:0,Z:114.873,Active:!0},Four:{X:85,Y:0,Z:95.019,Active:!0}}},{Name:`P4S WayMark Melee Uptime`,Place:{A:{X:102.5,Y:0,Z:90,Active:!0},B:{X:110,Y:0,Z:102.5,Active:!0},C:{X:97.5,Y:0,Z:110,Active:!0},D:{X:90,Y:0,Z:97.5,Active:!0},One:{X:97,Y:0,Z:82,Active:!0},Two:{X:118,Y:0,Z:97,Active:!0},Three:{X:103,Y:0,Z:118,Active:!0},Four:{X:82,Y:0,Z:103,Active:!0}}}],1011:[{Name:`任务目标(只能本地标点)`,Place:{A:{X:124.824,Y:10.5,Z:-226.483,Active:!0},B:{X:296.918,Y:10.799,Z:-397.124,Active:!0},C:{X:100,Y:0,Z:100,Active:!1},D:{X:100,Y:0,Z:100,Active:!1},One:{X:100,Y:0,Z:100,Active:!1},Two:{X:100,Y:0,Z:100,Active:!1},Three:{X:100,Y:0,Z:100,Active:!1},Four:{X:100,Y:0,Z:100,Active:!1}}}],1035:[{Name:`究极神兵幻巧战`,Text:`/p 究极神兵击退撞球
/p 当前MT：向北击退（不撞球）
/p 当前ST：向东击退/防击退（全减撞东）
/p 人群：向南击退（南→西）
/p 第三次（四组球）MT击退时开LB
/p 如果ST减伤不够则跟人群一起撞
/p 撞球伤害穿无敌！不要开无敌撞！`}],1072:[{Name:`宏 <a href='https://nga.178.com/read.php?tid=34756217' target='_blank'>来源</a>`,Text:`/p 【散开基准】咒发突袭：BOSS面向基准　其它：北（A）基准
/p 【基本散开】 【十字分摊】
/p D3 MT D4　　　MTD3
/p H1　　H2　 H1D1　 H2D4
/p D1 ST D2　 　　 STD2
/p 【咒法突袭（分摊/分散）】
/p D3H1D1MT←▲→STD2H2D4　※分散：T原地不动,D1D2在扇形结束后往内侧走
/p 【距离衰减+分摊】【PS连线：TH固定法】
/p 　　MT　　ST　　　　　　   MT(A)
/p 　　　　◎ 　 　 　　　H1(D)  DPS  H2(B)
/p 　　　分摊　　　　　　　　　ST(C)  ※T分摊死刑点名T无敌单吃
/p 【咒发拘束1】①③标记处分摊
/p 【咒发拘束2/PS连线】DPS：顺时针（左）　TH：逆时针（右）
/p 【4连黄圈】C点集合，顺时针放圈
/p 【PS连线2分摊】对组分摊：全员靠近后和邻组分摊  邻组分摊：无点名找点名分摊`},{Name:`标点`,Place:{A:{X:99.845,Y:0,Z:93.175,Active:!0},B:{X:107.21,Y:0,Z:100.694,Active:!0},C:{X:99.657,Y:0,Z:107.984,Active:!0},D:{X:91.972,Y:0,Z:100.319,Active:!0},One:{X:106.731,Y:0,Z:94.095,Active:!0},Two:{X:0,Y:0,Z:0,Active:!1},Three:{X:92.535,Y:0,Z:107.564,Active:!0},Four:{X:0,Y:0,Z:0,Active:!1}}},{Name:`巴尔巴莉希娅歼殛战`,Text:`/p 【散開基準】ヘアレイド：ボス基準　それ以外：北基準
/p 【基本散開】 【ペアバンプ】
/p D3 MT D4　　　MTD3
/p H1　　H2　 H1D1　 H2D4
/p D1 ST D2　 　　 STD2
/p 【ヘアレイド外周:足元】
/p D3H1D1MT←▲→STD2H2D4　※外周AOE：T外周,D1D2内側
/p 【距離減衰+頭割り】【プレステ：TH固定法】
/p 　　MT　　ST　　　　　　MT(A)
/p 　　　　◎ 　 　 　　　H1(D) DPS H2(B)
/p 　　　頭割り 　 　 　　　　ST(C) ※Tの２回目は1回目と同じマーカー付近
/p 【呪髪拘束1】① ③マーカー頭割り
/p 【呪髪拘束2】DPS：時計回り　TH：反時計回り
/p 【4連円範囲捨て】Cマーカー付近から時計回り
/p 【プレステバンプ】対角：DPS時計側 TH反時計側とペア　隣：隣組とペア`},{Name:`ぬけまる`,Place:{A:{X:100,Y:0,Z:85,Active:!0},B:{X:115,Y:0,Z:100,Active:!0},C:{X:100,Y:0,Z:115,Active:!0},D:{X:85,Y:0,Z:100,Active:!0},One:{X:107.5,Y:0,Z:92.5,Active:!0},Two:{X:0,Y:0,Z:0,Active:!1},Three:{X:92.5,Y:0,Z:107.5,Active:!0},Four:{X:0,Y:0,Z:0,Active:!1}}}],1075:[{Name:`树歌异闻老一`,Place:{A:{X:-335,Y:470.999,Z:-172.5,Active:!0},B:{X:-317.5,Y:470.999,Z:-155,Active:!0},C:{X:-335,Y:470.999,Z:-137.5,Active:!0},D:{X:-352.5,Y:470.999,Z:-155,Active:!0},One:{X:-340,Y:470.999,Z:-165,Active:!0},Two:{X:-330,Y:470.999,Z:-165,Active:!0},Three:{X:0,Y:0,Z:0,Active:!1},Four:{X:0,Y:0,Z:0,Active:!1}}},{Name:`树歌异闻老二`,Place:{A:{X:-34.974,Y:521.004,Z:-289.063,Active:!0},B:{X:-17.078,Y:521.004,Z:-270.978,Active:!0},C:{X:-35.01,Y:521.004,Z:-253.093,Active:!0},D:{X:-53.011,Y:521.004,Z:-271.008,Active:!0},One:{X:-29.679,Y:521.004,Z:-283.259,Active:!0},Two:{X:-29.614,Y:521.004,Z:-258.713,Active:!0},Three:{X:-40.314,Y:521.004,Z:-258.73,Active:!0},Four:{X:-40.326,Y:521.004,Z:-283.179,Active:!0}}},{Name:`树歌异闻老三`,Place:{A:{X:282.773,Y:533,Z:-123.748,Active:!0},B:{X:282.699,Y:533,Z:-104.985,Active:!0},C:{X:282.669,Y:533,Z:-86.283,Active:!0},D:{X:282.742,Y:533,Z:-96.222,Active:!0},One:{X:295.192,Y:533,Z:-123.832,Active:!0},Two:{X:295.324,Y:533,Z:-104.984,Active:!0},Three:{X:295.184,Y:533,Z:-86.201,Active:!0},Four:{X:295.212,Y:533,Z:-113.823,Active:!0}}},{Name:`树歌异闻老三eis呪具3专用`,Place:{A:{X:289.473,Y:533,Z:-123.748,Active:!0},B:{X:295.212,Y:533,Z:-113.823,Active:!0},C:{X:289.473,Y:533,Z:-86.283,Active:!0},D:{X:282.742,Y:533,Z:-96.222,Active:!0},One:{X:295.192,Y:533,Z:-123.832,Active:!1},Two:{X:295.324,Y:533,Z:-104.984,Active:!1},Three:{X:295.184,Y:533,Z:-86.201,Active:!1},Four:{X:295.212,Y:533,Z:-113.823,Active:!1}}}],1082:[{Name:`P5S 苦茶子（和Game8一样）`,Text:`/p 【基本散开】 【捕食毒塔】ST自由
/p D3 MT D4　　　　　　MT(无敌)
/p H1　　H2　　　H1D3　　 H2D4
/p D1 ST D2　　　　　　 D1D2
/p 【毒塔（近战内侧 / 远程外侧）】
/p MTST / H1D3：12点位置逆时针找塔
/p D1D2 / H2D4：1点位置顺时针找塔
/p 【毒液泉涌（染色分摊)】
/p 内侧：MTH1D1D3 外侧：STH2D2D4
/p  【毒池 + 毒液风暴】
/p 　　毒D1H1D3外
/p 　　　　MT
/p 　　　　☆
/p 　　　　ST
/p 外D4H2D2毒　※毒如果相反则站位相反
/p MT組：标记1or4 找毒圈
/p ST組： 标记2or3 找毒圈
/p AOE放在外侧，内侧分摊
/p 【染色+冲锋 找3个水晶的对侧房间分摊染色】`},{Name:`P5S Game8`,Text:`/p 【基本散開】　　　【十字毒塔】STフリー
/p D3 MT D4　　　　　　MT(無敵)
/p H1　　H2　　　H1D3　　 H2D4
/p D1 ST D2　　　　　　 D1D2
/p 【毒塔（近接内側 / 遠隔外側）】
/p MTST / H1D3：12時から反時計回り
/p D1D2 / H2D4：1時から時計回り
/p 【ベノムサージ(東西受け)/スプラッシュ】
/p 西/内壁：MTH1D1D3 東/外壁：STH2D2D4
/p 【毒沼 + ベノムスコール】
/p 　　毒D1H1D3外
/p 　　　　MT
/p 　　　　☆
/p 　　　　ST
/p 　外D4H2D2毒　※毒が逆位置の場合反転
/p MT組：マーカー1or4に出た毒に合わせて移動
/p ST組：マーカー2or3に出た毒に合わせて移動
/p AOEは外周に捨ててMT/STの位置で頭割り
/p 【4部屋ベノムスプラッシュ：3個部屋の対角】`},{Name:`P5S Standard`,Place:{A:{X:100,Y:-300,Z:93,Active:!0},B:{X:107,Y:-300,Z:100,Active:!0},C:{X:100,Y:-300,Z:107,Active:!0},D:{X:93,Y:-300,Z:100,Active:!0},One:{X:112.5,Y:-300,Z:87.5,Active:!0},Two:{X:112.5,Y:-300,Z:112.5,Active:!0},Three:{X:87.5,Y:-300,Z:112.5,Active:!0},Four:{X:87.5,Y:-300,Z:87.5,Active:!0}}},{Name:`P5S Quadrants`,Place:{A:{X:100,Y:-300,Z:86,Active:!0},B:{X:114,Y:-300,Z:100,Active:!0},C:{X:100.009,Y:-300,Z:114,Active:!0},D:{X:86,Y:-300,Z:100,Active:!0},One:{X:92,Y:-300,Z:92,Active:!0},Two:{X:108,Y:-300,Z:92,Active:!0},Three:{X:108,Y:-300,Z:108,Active:!0},Four:{X:92,Y:-300,Z:108,Active:!0}}},{Name:`P5S 子言`,Place:{A:{X:100,Y:-300,Z:86,Active:!0},B:{X:114,Y:-300,Z:100,Active:!0},C:{X:100.009,Y:-300,Z:114,Active:!0},D:{X:86,Y:-300,Z:100,Active:!0},One:{X:108,Y:-300,Z:92,Active:!0},Two:{X:108,Y:-300,Z:108,Active:!0},Three:{X:92,Y:-300,Z:108,Active:!0},Four:{X:92,Y:-300,Z:92,Active:!0}}}],1084:[{Name:`P6S 千星流月夜（推荐） <a href='https://www.bilibili.com/video/BV1RG4y1u78L' target='_blank'>来源</a>`,Text:`/p ※MT组：MTH1D1D3　ST组：STH2D2D4
/p 　【基本散开】　　【恶病质】
/p MT/D3　ST/D4　　　　20　20
/p 　　　★　　　　　　8　★　8
/p H1/D1　H2/D2　　　12　　　12
/p 　　　　　　　　　　16　　16
/p 【分摊分组】　　　　｜【苦痛爆发+寄生之舞】
/p 西：MT组 东：ST組　｜DPS分摊：场地4点 TN分摊：场地3点
/p ※顺时针移动处理分摊｜DPS大圈：D1→B D2→4 D3→右下 D4→D
/p 【致病胞流】　　　　｜TN 大圈：MT→3 ST→D H1→左上 H2→B
/p 奇数：场地1点　　　 ｜【苦痛爆发+界外劈砍】
/p 偶数：场地2点　　 　｜DPS分摊：场地4点 TN分摊：场地3点
/p 　　　　　　　　　　｜DPS大圈：B /TN大圈：D
/p 【恶病质+多元以太】
/p 安全格中上半两格→AoE　下半两格→分摊`},{Name:`P6S 苦茶子（和Game8一样）`,Text:`/p ※MT组：MTH1D1D3 ST组：STH2D2D4
/p 【基本散开】 【恶病体质第一次】
/p MT/D3　ST/D4 　 　 8　　 　 　8
/p 　　 　 ★　　 　 12　20 ★ 20　12
/p H1/D1　H2/D2　　  16 　 　 　 16
/p 【 分摊+扇型攻击 】｜ 【4：4分摊】
/p 西：MT组 东：ST组 ｜西侧→MT组 东侧→ST组
/p ※顺时针移动分摊   ｜※内侧标记集合
/p 【麻将】　　　　 　｜【苦痛交换第二次】
/p 西：奇数　　　 　　｜西→T・H    东→DPS
/p 东：偶数　　 　　　｜※AOE放置方向同上
/p 【恶病体质第二次】
/p 西：紫DEBUFF　东：绿DEBUFF
/p 北・南外侧标记→AoE　内侧标记→分摊`},{Name:`P6S Game8`,Text:`/p ※MT組：MTH1D1D3 ST組：STH2D2D4
/p 　【基本散開】　　【カヘキシー1回目】
/p MT/D3　ST/D4 　 　 8　　 　 　8
/p 　　 　 ★　　 　 　12　20 ★ 20　12
/p H1/D1　H2/D2　　16 　 　 　 16
/p 【 頭割り+扇範囲 】｜ 【4：4頭割り】
/p 西：MT組 東：ST組｜西側→MT組 東側→ST組
/p ※時計回りで頭割り｜※内周4マスを使用
/p 【サイコロ】　　 　｜【チェンジバースト2回目】
/p 西：奇数　　　　　｜西→T・H 東→DPS
/p 東：偶数　　　　　｜※AOEも上記方向に捨てる
/p 【カヘキシー2回目】
/p 西：紫デバフ　東：緑デバフ
/p 北・南外周マス→AoE　内周マス→頭割り`},{Name:`P6S 千星`,Place:{A:{X:100,Y:0,Z:81.818,Active:!0},B:{X:90.91,Y:0,Z:109.09,Active:!0},C:{X:100,Y:0,Z:118.182,Active:!0},D:{X:109.09,Y:0,Z:90.91,Active:!0},One:{X:98,Y:0,Z:98,Active:!0},Two:{X:102,Y:0,Z:98,Active:!0},Three:{X:92.728,Y:0,Z:92.728,Active:!0},Four:{X:107.272,Y:0,Z:107.272,Active:!0}}},{Name:`P6S Box Setup`,Place:{A:{X:100.071,Y:0,Z:90.053,Active:!0},B:{X:110.043,Y:0,Z:99.861,Active:!0},C:{X:99.954,Y:0,Z:110.023,Active:!0},D:{X:89.937,Y:0,Z:99.946,Active:!0},One:{X:109.937,Y:0,Z:90.068,Active:!0},Two:{X:109.992,Y:0,Z:109.859,Active:!0},Three:{X:89.9,Y:0,Z:109.926,Active:!0},Four:{X:89.969,Y:0,Z:90.134,Active:!0}}},{Name:`P6S Diamond Limit Cut`,Place:{A:{X:100,Y:0,Z:81.25,Active:!0},B:{X:115,Y:0,Z:100,Active:!0},C:{X:100,Y:0,Z:118.75,Active:!0},D:{X:85,Y:0,Z:100,Active:!0},One:{X:93.5,Y:0,Z:90,Active:!0},Two:{X:106.5,Y:0,Z:90,Active:!0},Three:{X:93.5,Y:0,Z:110,Active:!0},Four:{X:106.5,Y:0,Z:110,Active:!0}}},{Name:`P6S Diamond + Timer Strat Marker`,Place:{A:{X:111.5,Y:0,Z:95.5,Active:!0},B:{X:111.5,Y:0,Z:104.5,Active:!0},C:{X:88.5,Y:0,Z:104.5,Active:!0},D:{X:88.5,Y:0,Z:95.5,Active:!0},One:{X:106,Y:0,Z:88,Active:!0},Two:{X:106,Y:0,Z:112,Active:!0},Three:{X:94,Y:0,Z:112,Active:!0},Four:{X:94,Y:0,Z:88,Active:!0}}}],1086:[{Name:`被窝国际P7S站位宏`,Text:`/p MT组：MTH1D1D3　ST组：STH2D2D4
/p 　【基础分散】　　　 【击退+分散+鸟】
/p MT/D1　ST/D2　　　　　D1　　　　D2
/p 　　 ★ 　　　　　　D3　MT　　　ST　D4
/p H1/D3　H2/D4　　　　过道　　　　过道
/p 　　　　　　　　　　　H1　　　　　　H2
/p 【生命的果实:分摊】　 │【魔印创造:分散】
/p 北侧：MT组 南测：ST组 │基础分散※分摊在中心
/p 【左右分摊】　　　　　│【鸟+塔】
/p 西：MT组　东：ST组　 │相对基础分散※贴近引导
/p 【魔印创造·狱】
/p 　　▼西平台▼　　　　　　▼东平台▼
/p 分摊　　MT/D1　|　　　　MT/D1　分摊
/p ST/D2　H2/D4　|　　H2/D4　ST/D2
/p 　　　H1/D3　　|　　　H1/D3`},{Name:`P7S 苦茶子`,Text:`/p ■4:4分摊　　─ ─┬■魔印(以北为准)+鸟塔(面向外侧)
/p MT组 北、西　　│　MT/D1　　ST/D2 ※2第二回
/p ST组 南、东　　│ 　　　　　　　　　　的分摊在
/p 　　　　　　　　│　H1/D3　　H2/D4　桥前集合
/p ■击退+分散    ─┴┬■獄8人
/p 　D1　　D2　　　│　　 　MT/D1　北西＞北东
/p D3 MT　ST D4   │ 分摊 　　　※相反则翻转站位
/p 　　　　　　　  │  　　H2/D4
/p 　H1　　H2　　　│ ST/D2　　　 　道  道
/p 　　　　　　　　│ 　　H1/D3 　　　路
/p ■凶无敌处理(以牛为北) -■生命的繁茂【乱】
/p ※T没有牛通路无敌 │　牛…按基本分散
/p H1　　　　 H2 　　│　鳥…躲避牛头人的线开防击退
/p 　　　牛　　　　 │ 牛头人…平行于桥拉线
/p D3 D1　D2 D4  　│`},{Name:`P7S Game8`,Text:`/p MT組：MTH1D1D3　ST組：STH2D2D4
/p 　【基本散開】　　　　　【ノックバック+鳥】
/p MT/D1　ST/D2　　　　 D1　　 　 　 D2
/p 　　 　 ★　　　　　　D3　 MT　 　ST　 D4
/p H1/D3　H2/D4　　　　通路 　 　 　 通路
/p 　　　　　　　　　　　H1　　　　　　　H2
/p 【生命の果実：頭割り】　│【魔印創成：散開】
/p 北側：MT組　南側：ST組 │基本散開※頭割りと被ったら通路
/p 【エクサ+頭割り】　 　 　 │【鳥誘導＋塔】
/p 西：MT組　東：ST組　　 │基本散開準拠でズレたら時計回り
/p 【魔印創成：獄】
/p 　 ▼西島▼　　　　　　　 　 ▼東島▼
/p 頭割り　MT/D1 　 　 　 MT/D1　頭割り
/p ST/D2　H2/D4　通路　H2/D4　ST/D2
/p 　　　　H1/D3　 　　　H1/D3`},{Name:`P7S WayMark`,Place:{A:{X:114.29,Y:0,Z:83,Active:!0},B:{X:121.87,Y:0,Z:87.38,Active:!0},C:{X:121.87,Y:0,Z:96.13,Active:!0},D:{X:114.29,Y:0,Z:100.5,Active:!0},One:{X:85.71,Y:0,Z:83,Active:!0},Two:{X:78.13,Y:0,Z:87.38,Active:!0},Three:{X:78.13,Y:0,Z:96.13,Active:!0},Four:{X:85.71,Y:0,Z:100.5,Active:!0}}}],1088:[{Name:`P8S 菓子 门神`,Text:`/p 《菓子系列》P8S门神专用宏
/p ------------------------------------------------------------------
/p ◆基本分摊/多重灼炎/二蛇传统
/p     MT/D3  →  ST/D4
/p         ↑                  ↓
/p     H1/D1  ←  H2/D2
/p ------------------------------------------------------------------
/p ◆一蛇顺位
/p 从A起顺时针：MTD1＞STD2＞H1D3＞H2D4
/p ------------------------------------------------------------------
/p ◆一兽分散            | ◆一兽跳跃
/p     D3  MT  D4      | 1、3轮=1点
/p     H1  H2   ST      |  2、4轮=中间
/p     D1          D2      |  安全区=A/D点
/p ------------------------------------------------------------------
/p ◆八方/二蛇固定   | ◆二蛇顺位
/p        MT    D4         | 闲人：TH西北、DPS东南
/p     D3           ST      | 石光/邪毒：
/p     H1           D2     | 西北    MT>ST>H1>H2
/p        D1     H2        |             D1>D2>D3>D4    东南
/p ------------------------------------------------------------------
/p ◆四重同侧分散　　| ◆四重对角分散　| ◆四重分摊
/p 　 　　MT　　　　|　　　 中央　　　｜MT→D1
/p D3 D1 ST D2 D4  ｜　　　近D　　　｜ST→D2
/p 　　H1　H2　　　|　   H　○　T　　 | D3→H1
/p (MT组西、ST组东)  |　　 　远D　　 　 | D4→H2
/p ------------------------------------------------------------------
/p ◆二兽分摊
/p 二分：BOSS＞MTH1D1D2＞STH2D3D4
/p 四分：BOSS＞MTD1＞STD2＞H1D3＞H2D4`},{Name:`P8S 门神标点`,Place:{A:{X:100,Y:0,Z:91.6,Active:!0},B:{X:108.4,Y:0,Z:100,Active:!0},C:{X:100,Y:0,Z:108.4,Active:!0},D:{X:91.6,Y:0,Z:100,Active:!0},One:{X:91.6,Y:0,Z:91.6,Active:!0},Two:{X:108.4,Y:0,Z:91.6,Active:!0},Three:{X:108.4,Y:0,Z:108.4,Active:!0},Four:{X:91.6,Y:0,Z:108.4,Active:!0}}},{Name:`P8S NO CCHH 本体`,Text:`/p 【 NO CCHH 】P8S本体 专用宏
/p -----------------------------------------------------------------------
/p ■第一次术式记述（分摊分散）
/p 　八方分散站位　　　　　　左右刀+分散
/p　D1　MT　D2　　　　　　ST　 MT |　MT　ST
/p　H1　　　ST　　　　　　　D1　 H1 |　H1　D1
/p　D3　H2　D4　　　　　　D2　 H2 |　H2　D2
/p　　　　　　　　　　　 　　D3　 D4 |　D4　D3
/p　-----------------------------------------------------------------------
/p　NGA冰火 固定站位（标点） |　冰点名优先级（从左到右）
/p　MT (4) H1 (D) H2 (2) ST　　|　D1>D2>D3>D4
/p　D1 (4) D2 (D) D3 (2) D4　 |　H1>MT>ST >H2
/p　-----------------------------------------------------------------------
/p ■第一次概念支配
/p 短αβγ→ABC　　　　　|　2分摊+长α→ 2　| 3分摊+长βγ→ 3　|
/p 未合成短buff去原位 |　2分摊>3分摊　→　A > B > C 　|
/p -----------------------------------------------------------------------
/p ■万象灰烬脑死 　　　|　 ■第二次术式分散＆支配者的一击
/p　　　　MT　 D1　　　|　　MT　H1　D3　D1
/p　 ST　　　　　　D2　|　　ST　H2　D4　D2
/p 　H1　　　　　　D3　|　■支配者一击踩塔优先级(从左到右)
/p　　　　H2　 D4　　　| MT>ST>H1>H2>D4>D3>D2>D1
/p　-----------------------------------------------------------------------
/p　■第二次概念支配
/p　短αβγ→ABC　|　无→4 | 2分摊+长→ 2 | 单人→ 3　|
/p　2火+2踩塔 → 场中十字站位引导后续分身
/p　左下左上 → 左2塔中间　|　右上右下→ 右2塔中间
/p　-----------------------------------------------------------------------`},{Name:`P8S 本体 青瓜 角大圈`,Place:{A:{X:82,Y:0,Z:82,Active:!0},B:{X:82,Y:0,Z:118,Active:!0},C:{X:118,Y:0,Z:118,Active:!0},D:{X:100,Y:0,Z:90,Active:!0},One:{X:99.5,Y:0,Z:99,Active:!0},Two:{X:108,Y:0,Z:90,Active:!0},Three:{X:100.5,Y:0,Z:99,Active:!0},Four:{X:92,Y:0,Z:90,Active:!0}}},{Name:`P8S 苦茶子门神`,Text:`/p ■四重核爆/引导/蛇2     ■基本散开
/p MT/D3　→　ST/D4　　　D3 MT D4
/p ↑　　　☆　　↓ 　　　 H1    ST
/p H1/D1　←　H2/D2 　　 D1 H2 D2
/p ■巨蛇模式(第一次)
/p 蛇：从北顺时针MTD1>STD2>H1D3>H2D4
/p ■四足步行
/p 1,3次→1(北西)　2,4次→中央　待机→A(北)
/p ■幻影创造
/p ◎龙龙×散开 　　│ ◎凤凰×散开
/p 　　D3 　　　　│　D3 MT D4
/p 　　MT　ST　D4 │　H1 ☆ ST
/p H1　D1　D2 　　│　D1 H2 D2
/p 　　　　H2 　　│
/p ■四重炎岚(横竖) ｜■四重炎岚(角)
/p 　　　MT 　　　│ 　　中央　　※MT组：西优先
/p 　D1 ST D2 　 ｜ T　近
/p D3 H1 H2 D4 　│ 远　H
/p ◎分摊：靠近H位置(MTD1/STD2/H1D3/H2D4)
/p ■巨蛇模式(第二次) 4:4分摊
/p DEBUFF：北西>MT/D1>ST/D2>H1/D3>H2/D4>南东
/p 其余：北西TH/南东DPS
/p ■四重核爆/双重核爆
/p 四重：(BOSS)MT/D1>ST/D2>H1/D3>H2/D4
/p 双重：(BOSS)MTH1D1D2>STH2D3D4`},{Name:`P8S 奶油咖啡门神`,Text:`/p 【辣翅辣尾分散】
/p D3  D4    D3 MT ST D4
/p MT  ST    H1 D1 D2 H2   【蛇优先级】
/p D1  D2          A逆←MT ST H1 H2→2顺
/p H1  H2          A逆←D1 D2 D3 D4→2顺
/p 【八方站位】            【超级跳引导】
/p D3 MT D4         1,3→2点
/p H1        H2        2,4→场中
/p D1 ST  D2        待机→A点或B点
/p 【火龙卷分散站位(对角/并排)】
/p     BOSS                     MT
/p MT D1 | D2 ST     D3 D1  D2 D4
/p D3 H1 | H2 D4       H1 ST H2
/p 【火龙卷分摊】坦克→近战；远程→奶妈
/p 【加强兽分摊】
/p MT D1   MT H1 D1 D3
/p ST  D2    ST  H2 D2 D4
/p H1 D3
/p H2 D4
/p 【加强蛇固定站位】
/p      MT D4
/p D3            H2
/p H1            D2
/p      D1 ST
/p 【加强蛇后半分组/换位优先级】
/p 默认左上←MT ST H1 H2→换位右下
/p 换位左上←D1 D2 D3 D4→默认右下`},{Name:`P8S Game8门神`,Text:`/p ■テトラオクタ/誘導/蛇2　 ■基本散会
/p 　MT/D3　→　ST/D4　　　D3 MT D4
/p 　　↑　　 ☆　　↓　 　　　H1(H2) ST
/p 　H1/D1　←　H2/D2 　　D1 H2 D2
/p ■イントゥシャドウ(1回目)
/p 　蛇：北から時計回りMTD1>STD2>H1D3>H2D4
/p ■フェイタルストンプ
/p 　1,3回目→1(北西)　2,4回目→中央　待機→A(北)
/p ■幻影創造
/p ◎竜竜×散開　　　　 │◎フェニ×散開
/p 　　　　D3　　　 　 │　D3 MT D4
/p 　　　　MT　ST　D4│　H1 ☆ ST
/p 　　H1 D1　D2　　 │　D1 H2 D2
/p 　　　　　　 H2　　 │
/p ■四重炎嵐(縦横) ｜■四重炎嵐(角)
/p 　　　 MT　　　│　　中央　※MT組：西優先
/p 　 D1 ST D2 　　｜T　近
/p 　D3 H1 H2 D4 │遠　H
/p ◎頭割り：近H位置(MTD1/STD2/H1D3/H2D4)
/p ■イントゥシャドウ(2回目) 4:4頭割り
/p 　デバフ持ち：北西>MT/D1>ST/D2>H1/D3>H2/D4>南東
/p 　無職：北西TH/南東DPS
/p ■テトラ/ディフレア
/p 　テトラ：(ボス)MT/D1>ST/D2>H1/D3>H2/D4
/p 　ディフレア：(ボス)MTH1D1D2>STH2D3D4`},{Name:`P8S Game8本体`,Text:`/p 【術式1回目(頭割は西)】【術式炎氷(TH西 DPS東) 】
/p 　 　★　　　紫 　 ST│ ▼炎:中央前詰め　▼氷誘導
/p D1 MT D2　　 MT　│ MT>ST >H1>H2 西 D1>ST
/p H1　　H2　H1　D2│ D1>D2>D3>D4 東MT>D2
/p D3 S T D4　 　 D1　│【術式2回目散開 】
/p 　※左安置は　H2　D3│　STMT 紫 D3D1
/p 　　左右反転→　 D4 　│　　 H1H2D4D2
/p 【概念1回目①】　　【概念1回目②】
/p 　　　　早α　　 　 │　　　遅α
/p 複/遅α　　　　　　│
/p 　　　　　　 早β 　│ 生物　　　　遅β
/p 重/遅βγ　　　　　 │
/p 　　　　早γ　　 　 │　　　遅γ
/p ※4塔：遅αβγ→北で合成
/p 　 　 　 複/重/早余り→南で合成
/p 【万象灰燼：はいじあ/ビジョン式】
/p 　　MT　　D1
/p ST　 +　　　+　D2　※1,3番塔は前+で範囲捨て
/p H1　+　　　+　D3　※2,4番塔は後+で範囲捨て
/p 　 　H2　　D4
/p 【概念2回目①】 　 　【概念2回目②】
/p 　　 無/早α　　　 │　　　　遅α
/p 単　　　　　 　 　 │ 生物
/p 　　　　　　早β　│ ｲﾌ ｲﾌ　　　　遅β
/p 複/遅　　　　　　 │ 生物
/p 　　　 早γ 　　 　 │　　　　遅γ
/p ※4塔：遅αβ→北で合成　遅γ/早余り→南で合成
/p 【支配者の一撃】　　　　　【塔優先度】
/p 　MTH1 D3 D1　西>MTSTH1H2D4D3D2D1>東
/p 　ST H2 D4 D2`},{Name:`P8S WayMark 本体`,Place:{A:{X:100,Y:0,Z:81.5,Active:!0},B:{X:118.5,Y:0,Z:100,Active:!0},C:{X:100,Y:0,Z:118.5,Active:!0},D:{X:81.5,Y:0,Z:100,Active:!0},One:{X:100,Y:0,Z:85,Active:!0},Two:{X:100,Y:0,Z:95,Active:!0},Three:{X:90,Y:0,Z:90,Active:!0},Four:{X:110,Y:0,Z:90,Active:!0}}},{Name:`P8S WayMark High Concept`,Place:{A:{X:117.531,Y:0,Z:82.394,Active:!0},B:{X:117.7,Y:0,Z:117.216,Active:!0},C:{X:82.823,Y:0,Z:117.213,Active:!0},D:{X:104.985,Y:0,Z:94.741,Active:!0},One:{X:88.489,Y:0,Z:80.738,Active:!0},Two:{X:80.601,Y:0,Z:90.739,Active:!0},Three:{X:89.753,Y:0,Z:81.265,Active:!0},Four:{X:105.044,Y:0,Z:83.843,Active:!0}}}],1090:[{Name:`候鸟`,Place:{A:{X:0,Y:.074,Z:-11.161,Active:!0},B:{X:5.7,Y:.082,Z:-18.5,Active:!0},C:{X:-5.7,Y:.082,Z:-18.5,Active:!0},D:{X:0,Y:0,Z:0,Active:!1},One:{X:4.171,Y:.07,Z:-6.632,Active:!0},Two:{X:.08,Y:.048,Z:-1.98,Active:!0},Three:{X:7.038,Y:.074,Z:4.041,Active:!0},Four:{X:0,Y:0,Z:0,Active:!1}}},{Name:`奶油咖啡`,Place:{A:{X:0,Y:.074,Z:-11.162,Active:!0},B:{X:17.5,Y:.052,Z:0,Active:!0},C:{X:0,Y:.052,Z:17.176,Active:!0},D:{X:-17.5,Y:.052,Z:0,Active:!0},One:{X:5.7,Y:.082,Z:-17.5,Active:!0},Two:{X:-5.7,Y:.082,Z:-17.5,Active:!0},Three:{X:0,Y:0,Z:0,Active:!1},Four:{X:0,Y:0,Z:0,Active:!1}}},{Name:`Standard`,Place:{A:{X:-12.618,Y:.052,Z:14.878,Active:!0},B:{X:12.964,Y:.052,Z:14.779,Active:!0},C:{X:-17.952,Y:.052,Z:-8.664,Active:!0},D:{X:.207,Y:.073,Z:-7.358,Active:!0},One:{X:-9.917,Y:.052,Z:-2.812,Active:!0},Two:{X:10.113,Y:.052,Z:-2.826,Active:!0},Three:{X:18.873,Y:.052,Z:-6.124,Active:!0},Four:{X:0,Y:0,Z:0,Active:!1}}},{Name:`紫圈中场固定 候鸟症候群Xyz`,Text:`/p 幻魔神【紫圈中场固定】站位宏
/p 魔神之怒（分组分摊）： 左ST治疗　右DPS
/p          【绿紫圈】                              【知识分散】
/p             H1   H2                                D1            D2
/p 　  D3               D4                          MT            ST
/p D1     MT     ST     D2        撼地                                    撼地
/p 　　　     紫                          H       D3      H       D4      D
/p 　 　　BOSS
/p ↓↓↓↓↓↓↓↓↓↓
/p 小怪：大MT　小ST　顺序→小大小小大小
/p 塔(Debuff有)　左：坦克治疗　右：DPS  同组同色坦克与D1D2补位
/p 塔(Debuff无)　左：MT　右：ST
/p 撼地　左：治疗　右：DPS`},{Name:`紫圈场边固定 候鸟症候群Xyz`,Text:`/p 幻魔神【紫圈场边固定】站位宏
/p 魔神之怒（分组分摊）： 左ST治疗　右DPS
/p      【绿紫圈】                                【知识分散】
/p              紫                                      D1            D2
/p   H1               H2                           MT            ST
/p D3                   D4          撼地                                    撼地
/p     T      D1    D2               H        D3      H       D4      D
/p  　 　BOSS
/p ↓↓↓↓↓↓↓↓↓
/p 小怪：大MT　小ST　顺序→小大小小大小
/p 塔(Debuff有)　左：坦克治疗　右：DPS  同组同色坦克与D1D2补位
/p 塔(Debuff无)　左：MT　右：ST
/p 撼地　左：治疗　右：DPS`}],1096:[{Name:`树歌`,Text:`/p 树歌式 极火天王专用宏
/p 【基本散开】========【烈风火燕流】========
/p D3　MT　D4 　MT组(北)：MTD1D3H1
/p H1　 ★　 H2 　 ST组(南)： STD2D4H2
/p D1　ST　 D2　计数法近战/远程分组 分散DPS追黄圈
/p 【小怪接线】MT→西　ST→东
/p 【炎祸之咒】=======【赤灭热波：散开】=====
/p 　　MT/D3　 ↑ ↑ ★ ↑ ↑
/p H1/D1 ★ H2/D4　　 MT　D1　D2　ST
/p 　 　 ST/D2 　 　 　 　D3　H1　H2　D4
/p ※同色标点内处理　※↑Boss面向为基准、分摊去D1位置
/p ==============【麻将】================
/p 奇数西半场 偶数东半场 12点扇形 43点接线
/p 开始时78去脚下接线`},{Name:`1A4`,Place:{A:{X:100,Y:0,Z:86,Active:!0},B:{X:114,Y:0,Z:100,Active:!0},C:{X:100,Y:0,Z:114,Active:!0},D:{X:86,Y:0,Z:100,Active:!0},One:{X:93,Y:0,Z:93,Active:!0},Two:{X:107,Y:0,Z:93,Active:!0},Three:{X:107,Y:0,Z:107,Active:!0},Four:{X:93,Y:0,Z:107,Active:!0}}},{Name:`4A1`,Place:{A:{X:100,Y:0,Z:86,Active:!0},B:{X:114,Y:0,Z:100,Active:!0},C:{X:100,Y:0,Z:114,Active:!0},D:{X:86,Y:0,Z:100,Active:!0},One:{X:107,Y:0,Z:93,Active:!0},Two:{X:107,Y:0,Z:107,Active:!0},Three:{X:93,Y:0,Z:107,Active:!0},Four:{X:93,Y:0,Z:93,Active:!0}}}],1122:[{Name:`绝欧米茄八方标准点4A1 <a href='https://nga.178.com/read.php?tid=35178002' target='_blank'>来源</a>`,Place:{A:{X:100,Y:0,Z:86.99,Active:!0},B:{X:113.01,Y:0,Z:100,Active:!0},C:{X:100,Y:0,Z:113.01,Active:!0},D:{X:86.99,Y:0,Z:100,Active:!0},One:{X:109.2,Y:0,Z:90.8,Active:!0},Two:{X:109.2,Y:0,Z:109.2,Active:!0},Three:{X:90.8,Y:0,Z:109.2,Active:!0},Four:{X:90.8,Y:0,Z:90.8,Active:!0}}}],1141:[{Name:`EX6 safer corner markers`,Place:{A:{X:99.89,Y:.029,Z:85.838,ID:0,Active:!0},B:{X:114.435,Y:.029,Z:99.778,ID:1,Active:!0},C:{X:99.728,Y:.03,Z:113.862,ID:2,Active:!0},D:{X:86.173,Y:.03,Z:99.97,ID:3,Active:!0},One:{X:97.378,Y:.029,Z:97.296,ID:4,Active:!0},Two:{X:102.584,Y:.03,Z:97.331,ID:5,Active:!0},Three:{X:102.537,Y:.03,Z:102.563,ID:6,Active:!0},Four:{X:97.462,Y:.029,Z:102.573,ID:7,Active:!0}}},{Name:`(Game8)ハムカツ式改※ウインドスフィア最新版`,Text:`/p ■散開(北基準)--■44頭割り-------ハムカツ式改---
/p D3 MT D4　　| 西/外:MTH1D1D3
/p H1 ★ H2　　| 東/内:STH2D2D4
/p D1 ST D2　　 | 縦安置 北:MT組 南:ST組
/p ■ディレイスパーク--------------------------------------
/p ディレイアースを避けた位置で捨てる
/p ■ダブルメテオ-------------------------------------------
/p DPS:3人塔　フレア北
/p TH:2人塔　フレア南　ノックバック中央
/p ■ヴォイド･コメットレイン-----------------------------
/p 北1:H1D3　北2:MTD1　南1:H2D4　南2:STD2
/p ■ウィンドスフィア2,3回目----------------------------
/p 北/西 H1D3,MTD1,STD2,H2D4 南/東
/p ■三連黒竜閃---------------------------------------------
/p T:北 東西:H 南:DPS`},{Name:`<a href='https://bbs.tggfl.com/topic/223/ff14%E5%8D%AB%E6%9C%88-waymark-present-%E6%A0%87%E7%82%B9%E5%90%88%E9%9B%86'target='_blank'>极高贝扎安全角树歌</a>`,Place:{A:{X:100,Y:.03,Z:86,ID:0,Active:!0},B:{X:114,Y:.03,Z:100,ID:1,Active:!0},C:{X:100,Y:.03,Z:114,ID:2,Active:!0},D:{X:86,Y:.03,Z:100,ID:3,Active:!0},One:{X:103.9,Y:.03,Z:96.1,ID:4,Active:!0},Two:{X:103.9,Y:.03,Z:103.9,ID:5,Active:!0},Three:{X:96.1,Y:.03,Z:103.9,ID:6,Active:!0},Four:{X:96.1,Y:.03,Z:96.1,ID:7,Active:!0}}}],1148:[{Name:`P9S 苏帕酱噗`,Text:`/p ■基本散开　　　 　■22分摊（X字逆时针旋转）
/p D3 MT D4　　 　　　　 　MT/D3
/p H1 ★ H2 　　 　 　H1/D1　★　H2/D4
/p D1 ST D2　 　　　　 　　 ST/D2
/p ■古式破碎拳（44分摊）
/p 西：MTH1D1D3 / STH2D2D4：东
/p ■第一次麻将运动会（马拉松式）
/p 无麻将点名：沿1357球跑，蓝球点名依次停下
/p 踩塔：6→8→2→4
/p 引导：2→4→6→8，塔位置向前进方向偏45度贴边
/p ■黄道陨石
/p 毒分摊：A点顺时针 先DPS后TH
/p 扇形诱导：先TH后DPS
/p ■第二次麻将运动会
/p 1西　2东　34北　其他南
/p ■第一次麻将运动会（脑死式）
/p 以1号和3号球中间为12点
/p 以5号和7号球中间为6点
/p 前两轮：人群6点内环，火腿6点场边，蓝球12点场边
/p 后两轮：人群12点内环，火腿12点场边，蓝球6点场边
/p 火腿：2→4→6→8
/p 踩塔：6→8→2→4`},{Name:`P9S Game8原版`,Text:`/p ■基本散開    ■ペア十字(X字反時計回り)
/p D3 MT D4         MT/D3
/p H1 ★ H2       H1/D1 ★ H2/D4
/p D1 ST D2          ST/D2
/p ■古式破砕拳(4:4頭割り)
/p 西：MTH1D1D3 / STH2D2D4 ：東
/p ■ジャンブルコンボ(サイコロ1回目)※無職マラソン式
/p 無職：1壁から進行方向に走り青ついたら止まる
/p 塔：6→8→2→4の順に処理
/p 炎：2→4→6→8の順に処理(塔から進行方向に45度ずれる)
/p ■ビーストフェーズ
/p 毒:12時から時計回り DPS＞TH 扇誘導:TH→D
/p ■キメリック(サイコロ２回目)
/p 1→東 2→西 3,4→北 無職→南`},{Name:`P9S 树歌`,Place:{A:{X:100.11,Z:85.86,Y:0,Active:!0},B:{X:114.07,Z:99.94,Y:0,Active:!0},C:{X:100.17,Z:113.89,Y:0,Active:!0},D:{X:86.09,Z:99.74,Y:0,Active:!0},One:{X:85.83,Z:85.64,Y:0,Active:!0},Two:{X:111.93,Z:87.8,Y:0,Active:!0},Three:{X:109.97,Z:109.75,Y:0,Active:!0},Four:{X:90.13,Z:109.86,Y:0,Active:!0}}},{Name:`P9S Game8`,Place:{A:{X:100.194,Y:0,Z:85.723,ID:0,Active:!0},B:{X:113.964,Y:0,Z:99.91,ID:1,Active:!0},C:{X:100.036,Y:0,Z:113.949,ID:2,Active:!0},D:{X:86.03,Y:0,Z:99.873,ID:3,Active:!0},One:{X:109.858,Y:0,Z:90.002,ID:4,Active:!0},Two:{X:109.863,Y:0,Z:109.787,ID:5,Active:!0},Three:{X:90.079,Y:0,Z:109.847,ID:6,Active:!0},Four:{X:90.268,Y:0,Z:90.187,ID:7,Active:!0}}}],1150:[{Name:`P10S 苏帕酱噗`,Text:`/p ■尖脚 左MT 右ST
/p ■搭桥 左H   右DPS
/p ■万魔之柱（踩塔）-----------------------
/p ST H1 MT 　　　　　  ｜D1 MT ST D2
/p D1 H2 D2　　　　   　｜
/p D3 　　D4　　　  　　｜D3 H1 H2 D4
/p ■喷吐网（8人分散）    ｜■重型网（第一次）
/p MT　　　　　　ST　　｜ 左TH 右DPS
/p 　　D1 　　 D2 　　　｜ 扇形向北
/p 　　　　H1 　　　　　｜ 分摊横排在南
/p 　　D3 　　 D4 　　　｜ 线不交叉
/p 　　　　H2 　　　　　｜
/p
/p ■分摊/分散
/p 西岛/半场刀/震击---------------炮台------------
/p MT D1 　　　　　　　｜ D1 / MT ST / D2
/p ST  D2 　　　　　　　｜
/p H1 D3 　　　　　　　｜ D3 / H1 H2 / D4
/p H2 D4 　　　　　　　｜
/p 22分摊 MTD1 STD2 H1D3 H2D4
/p 44分摊 MTSTH1H2 D1D2D3D4
/p 空降（砸地）时8人去西岛处理
/p ■炮台
/p 自西向东 H1MT → D3MT → D1MT → MT
/p 自东向西 H2ST  → D4ST   → D2ST  → ST
/p 第3炮调整角度射向第4炮
/p
/p ■魔殿震击额外站位1
/p D1　D2　D3　D4
/p MT　ST 　H1　H2
/p
/p ■魔殿震击额外站位2
/p 分摊为22时
/p D1　MT　ST 　D2
/p D3　H1    H2　D4
/p 分摊为44时
/p MT　ST 　D1　D2
/p H1　H2　D3　D4`},{Name:`P10S Game8原版`,Text:`/p ■尖脚 左MT 右ST
/p ■グランドウェブ 左H 右DPS
/p ■パンデモニックピラー-----------------------
/p ST H1 MT 　　　　　  ｜D1 MT ST D2
/p D1 H2 D2　　　　   　｜
/p D3 　　D4　　　  　　｜D3 H1 H2 D4
/p ■スピットウェブ---          ｜■ヘビーウェブ(1回目)-----
/p MT　　　　　　ST　　｜ 左TH 右DPS
/p 　　D1 　　 D2 　　　｜ 扇北向け
/p 　　　　H1 　　　　　｜ 頭割り南で横並び
/p 　　D3 　　 D4 　　　｜ 線クロスしない
/p 　　　　H2 　　　　　｜
/p
/p ■ボンド
/p -西島/片面/震撃---------------ﾀﾚｯﾄ------------
/p MT D1 　　　　　　　｜ D1 / MT ST / D2
/p ST  D2 　　　　　　　｜
/p H1 D3 　　　　　　　｜ D3 / H1 H2 / D4
/p H2 D4 　　　　　　　｜
/p ダブル MTD1 STD2 H1D3 H2D4
/p クアドラ MTSTH1H2 D1D2D3D4
/p タッチダウン時は西島に8人入って処理
/p ■タレット
/p 西 H1MT → D3MT → D1MT → MT
/p 東 H2ST → D4ST → D2ST → ST
/p 3番レーザーは4番タレットに向けて角度調整
/p
/p ■魔殿の震撃ボンド
/p D1　D2　D3　D4
/p MT　ST 　H1　H2
/p
/p ■魔殿の震撃ボンド
/p ダブル(22)MT組:ST組
/p D1　MT　ST 　D2
/p D3　H1    H2　D4
/p クアドラ(44)TH組:DPS組
/p MT　ST 　D1　D2
/p H1　H2　D3　D4`},{Name:`JP Markers`,Place:{A:{X:100.049,Y:0,Z:88.601,ID:0,Active:!0},B:{X:108.029,Y:0,Z:99.999,ID:1,Active:!0},C:{X:100.008,Y:0,Z:111.188,ID:2,Active:!0},D:{X:91.983,Y:0,Z:99.929,ID:3,Active:!0},One:{X:103.995,Y:0,Z:96.253,ID:4,Active:!0},Two:{X:108.013,Y:0,Z:111.159,ID:5,Active:!0},Three:{X:92.009,Y:0,Z:111.204,ID:6,Active:!0},Four:{X:95.936,Y:0,Z:96.023,ID:7,Active:!0}}},{Name:`NA Markers`,Place:{A:{X:91.962,Y:0,Z:114.282,ID:0,Active:!0},B:{X:100.025,Y:0,Z:114.321,ID:1,Active:!0},C:{X:108.046,Y:0,Z:114.306,ID:2,Active:!0},D:{X:100.019,Y:0,Z:103.943,ID:3,Active:!0},One:{X:94.819,Y:0,Z:93.835,ID:4,Active:!0},Two:{X:105.378,Y:0,Z:93.728,ID:5,Active:!0},Three:{X:92.321,Y:0,Z:100.435,ID:6,Active:!0},Four:{X:107.609,Y:0,Z:100.66,ID:7,Active:!0}}},{Name:`P10S 不保真`,Place:{A:{X:91.861,Y:0,Z:87,ID:0,Active:!0},B:{X:108.281,Y:0,Z:87,ID:1,Active:!0},C:{X:91.886,Y:0,Z:99.907,ID:2,Active:!0},D:{X:108.038,Y:0,Z:99.865,ID:3,Active:!0},One:{X:92.035,Y:0,Z:111.176,ID:4,Active:!0},Two:{X:108.048,Y:0,Z:111.27,ID:5,Active:!0},Three:{X:99.946,Y:0,Z:111.275,ID:6,Active:!0},Four:{X:100.081,Y:0,Z:97.414,ID:7,Active:!0}}},{Name:`<a href='https://bbs.tggfl.com/topic/223/ff14%E5%8D%AB%E6%9C%88-waymark-present-%E6%A0%87%E7%82%B9%E5%90%88%E9%9B%86'target='_blank'>P10S Game8国服适配</a>`,Place:{A:{X:100,Y:0,Z:98.2,ID:0,Active:!0},B:{X:92.009,Y:0,Z:111.204,ID:6,Active:!0},C:{X:100.008,Y:0,Z:111.188,ID:2,Active:!0},D:{X:108.013,Y:0,Z:111.159,ID:5,Active:!0},One:{X:92.009,Y:0,Z:88.82,ID:4,Active:!0},Two:{X:108.013,Y:0,Z:88.82,ID:5,Active:!0},Three:{X:75,Y:0,Z:85,ID:6,Active:!0},Four:{X:125,Y:0,Z:85,ID:7,Active:!0}}}],1152:[{Name:`P11S 苏帕酱噗`,Text:`/p MT組：MTH1D1D3 ST組：STH2D2D4
/p 【基本散开】      【暗22/踩塔】
/p D3 MT D4        MTD3   H2D4
/p H1 ★ H2             ★
/p D1 ST D2        H1D1   STD2
/p 【魔法阵＆戒律】
/p MT组：西起始 ST组：东起始
/p 「魔法阵&戒律的暗22」
/p 以面向BOSS为准 左:MTD3/STD2 右:H1D1/H2D4
/p 戒律连线 ⇒ T：A 光：场中
/p 【光明奔流后的44分组】
/p 以面向BOSS为准 MT組：左 ST組：右
/p 【调停】
/p 光⇒TH：西 DPS：东
/p 暗⇒TH：东 DPS：西
/p 【调停后的直剑】
/p 最近的正点等待，确定位置后顺时针
/p 暗22以面向BOSS为准 近线左 长线右
/p 【黑暗奔流】
/p MT组:北西 ST组:南东
/p 内：T近 / 外：H远
/p 【理法】
/p 暗线场中 光线场边
/p 塔：北（A）基准 X字分组
/p 暗22以面向BOSS为准 左:MTD3/STD2 右:H1D1/H2D4`},{Name:`P11S Game8原版`,Text:`/p ※ボスを見て以外は北(A)基準
/p MT組：MTH1D1D3　ST組：STH2D2D4
/p 【基本散開】　　　【アップヘルド闇/ペア散開】
/p D3 MT D4　　　 　　　　　　　MTD3
/p H1 ★ H2 　 　　　 　　　　H1D1 ★ H2D4
/p D1 ST D2　　 　 　　 　 　　　　STD2
/p ※闇ジューリー⇒DPS時計※塔X字⇒反時計
/p 【魔法陣＆戒律】
/p 初動⇒MT組：西待機　ST組：東待機
/p 「魔法陣ディスミサル闇：戒律闇ディバイド」
/p ボスを見て　左:MTD3/STD2 右:H1D1/H2D4
/p 戒律の闇線⇒T線：Aマーカー　光：ボス中央
/p 【ライトストリーム後ディバイド】
/p ボスを見て MT組：左　ST組：右
/p 【光と闇の調停：ジジー式】
/p 光⇒TH：西側　DPS：東側
/p 闇⇒TH：東側　DPS：西側
/p 【調停ディバイド】
/p 近くのマーカーで待機し位置確定後　時計回り
/p 闇ペア⇒ボスを見て 短い線(異色)：左　長い線(同色)：右
/p 【ダークストリーム】
/p MT組:北西 ST組:南東
/p 内:近接(T進行方向側) / 外:遠隔(H進行方向側)
/p 【理法の幻想】
/p 闇線中央捨て　光線その場
/p 塔処理　北(A)基準で塔ペア散開
/p 闇ディスミサル　ボスを見て　左:MTD3/STD2 右:H1D1/H2D4`},{Name:`P11S Game8`,Place:{A:{X:100,Y:0,Z:87,Active:!0},B:{X:113.01,Y:0,Z:100.08,Active:!0},C:{X:100,Y:0,Z:113,Active:!0},D:{X:86.97,Y:0,Z:100.02,Active:!0},One:{X:90.79,Y:0,Z:90.85,Active:!0},Two:{X:109.17,Y:0,Z:90.68,Active:!0},Three:{X:109.21,Y:0,Z:109.22,Active:!0},Four:{X:90.85,Y:0,Z:109.29,Active:!0}}},{Name:`Kindred D&L`,Place:{A:{X:100,Y:0,Z:87,ID:0,Active:!0},B:{X:107,Y:0,Z:100,ID:1,Active:!0},C:{X:100,Y:0,Z:113,ID:2,Active:!0},D:{X:93,Y:0,Z:100,ID:3,Active:!0},One:{X:109.192,Y:0,Z:90.808,ID:4,Active:!0},Two:{X:105,Y:0,Z:105,ID:5,Active:!0},Three:{X:90.808,Y:0,Z:109.192,ID:6,Active:!0},Four:{X:95.05,Y:0,Z:95.05,ID:7,Active:!0}}}],1154:[{Name:`P12S 门神 Game8`,Text:`/p ■パラ1回目 タンク無敵
/p ーーーーーーーーーーーーーーーーーーーーーーーー
/p ■パラ2回目 十字
/p 線：対面に伸ばす
/p 塔TH：北西から反時計、塔DPS：北東から時計
/p ーーーーーーーーーーーーーーーーーーーーーーーー
/p ■チェインⅠ、Ⅱ　※ボス基準
/p 　《8方向》　　　　　《ペア》　　　　　《ペア半面》ⅡA
/p 　　 D1　D2　　　　　　　　　　　　　　　MTD1
/p 　MT　　 　 ST 　 　MT/D1　ST/D2 　　 　 STD2
/p 　　 　 ★　　　　　　　　　★　　　 　　 　 H1D3
/p 　H1　　 　 H2 　 　H1/D3　H2/D4　 　　H2D4
/p 　 　D3　D4
/p ーーーーーーーーーーーーーーーーーーーーーーーー
/p 《ビーム誘導/4:4》　　　《塔/天火散開》
/p 　　　　★ 　 　 　　 　 MT/D1 　 ST/D2
/p 黒ビーム　 白ビーム 　 　　 　 　 ★
/p 白デバフ　 黒デバフ　　　　　白　　黒
/p 　　　　　　　　　　 　H1/D3 　 H2/D4
/p ーーーーーーーーーーーーーーーーーーーーーーーー
/p ■アポ ：HDボス下　ペリ：HDボス背面サークル外
/p ーーーーーーーーーーーーーーーーーーーーーーーー
/p ■パラデイグマ3回目 イディル
/p 　北：十字 南：X字
/p 　北　MT＞ST＞H1＞H2　南
/p 　DPS塔踏み:中央＞D1D2D3D4
/p ーーーーーーーーーーーーーーーーーーーーーーーー
/p ■サイコロ　ネバラン
/p 　　 ★
/p 　　　2/4（2,4は辺から頭割り）
/p 5/7　 　 6/8
/p 　　1/3
/p ※ビーム:5,7→6,8→1,3→2,4
/p ※サイコロ後北に集合`},{Name:`P12S 本体 Game8`,Text:`/p 【パラスの手】 T:西　他:東
/p 【サモンダークネス】北＞西:TH　南＞東:DPS
/p 【デミハルペリオン】
/p 　 　 MT 　 　ST 　 　 　 MT 　 　 ST
/p 　 H1 　 　 　 　H2 　 　 H1 　 　 H2 　 　H1 MT ST H2
/p 　 　 　 　● 　 　 　 　 　 　 　● 　 　 　 　 　 　●
/p 　 D3 　 　 　 　D4 　 　 D3 　 　D4 　 　 D3 D1 D2 D4
/p 　 　 D1 　 　D2 　 　 　 D1 　 　D2
/p 【イデア】 西←〇×△□→東　 α:赤▲　β:黄■
/p 【パラスレイX処理】
/p ●　　●　　●　　●
/p 〇α ★ ×α 　△α ★ □α　 2回目は〇×△□反転
/p ●　　●　　●　　●　　 ※誘導後→★に入る
/p 〇β ★ ×β　 △β ★ □β
/p ●　　●　　●　　●
/p 【カロリック1】※もちべ式
/p 炎マーカー頭割り・・・西:TH　東:DPS
/p 風炎:MTSTH1H2D1D2D3D4の順でAから時計
/p 【エクピロシス】
/p MT ST
/p D1 D2　 MT D1 D2 ST
/p H1 H2　 D3 H1 H2 D4
/p D3 D4
/p 【パンゲネシス】MT:西無敵、他:南(東側)
/p 極性なし:西←MTSTH1H2D1D2D3D4→東
/p 無職:スライム 西：1マーカー、東：2マーカー
/p 【カロリック2回目】
/p 　　H2　　　　 マーカー:MTと交代
/p D1　　　D4　 ※反時計/最後中央行かずに２回移動
/p 　　MT
/p ST　　　D2
/p 　　H1
/p 　　　 　D3
/p 【サモンダークネス+デミ2】（MTD1が奥まで走る）
/p 安置の逆側＞MT/D1　ST/D2　H1/D3　H2/D4＜安置
/p 【サモンダークネス(線)】
/p 　MT/D1　ST/D2　H1/D3　H2/D4ペアで処理`},{Name:`门神`,Place:{A:{X:100,Y:0,Z:91.6,Active:!0},B:{X:108.4,Y:0,Z:100,Active:!0},C:{X:100,Y:0,Z:108.4,Active:!0},D:{X:91.6,Y:0,Z:100,Active:!0},One:{X:91.6,Y:0,Z:91.6,Active:!0},Two:{X:108.4,Y:0,Z:91.6,Active:!0},Three:{X:108.4,Y:0,Z:108.4,Active:!0},Four:{X:91.6,Y:0,Z:108.4,Active:!0}}},{Name:`本体 Papan`,Place:{A:{X:100,Y:0,Z:89,ID:0,Active:!0},B:{X:104,Y:0,Z:93,ID:1,Active:!0},C:{X:100,Y:0,Z:97,ID:2,Active:!0},D:{X:96,Y:0,Z:93,ID:3,Active:!0},One:{X:87,Y:0,Z:93,ID:4,Active:!0},Two:{X:113,Y:0,Z:93,ID:5,Active:!0},Three:{X:92,Y:0,Z:92,ID:6,Active:!0},Four:{X:108,Y:0,Z:92,ID:7,Active:!0}}},{Name:`本体 风火`,Place:{A:{X:100,Y:0,Z:85,Active:!0},B:{X:106.928,Y:0,Z:105,Active:!0},C:{X:100,Y:0,Z:101,Active:!0},D:{X:100,Y:0,Z:93,Active:!0},One:{X:93.072,Y:0,Z:89,Active:!0},Two:{X:106.928,Y:0,Z:89,Active:!0},Three:{X:106.928,Y:0,Z:97,Active:!0},Four:{X:93.072,Y:0,Z:97,Active:!0}}},{Name:`门神 Game8`,Place:{A:{X:100.017,Y:0,Z:81.293,ID:0,Active:!0},B:{X:119.21,Y:0,Z:100.161,ID:1,Active:!0},C:{X:100.055,Y:0,Z:119.197,ID:2,Active:!0},D:{X:80.909,Y:0,Z:100.179,ID:3,Active:!0},One:{X:110.14,Y:0,Z:89.562,ID:4,Active:!0},Two:{X:109.896,Y:0,Z:109.996,ID:5,Active:!0},Three:{X:90.064,Y:0,Z:109.996,ID:6,Active:!0},Four:{X:90.077,Y:0,Z:90.129,ID:7,Active:!0}}},{Name:`本体 Game8`,Place:{A:{X:97.919,Y:0,Z:92.978,ID:0,Active:!0},B:{X:102.185,Y:0,Z:92.877,ID:1,Active:!0},C:{X:102.148,Y:0,Z:97.109,ID:2,Active:!0},D:{X:97.924,Y:0,Z:97.066,ID:3,Active:!0},One:{X:99.146,Y:0,Z:80.831,ID:4,Active:!0},Two:{X:119,Y:0,Z:90.51,ID:5,Active:!0},Three:{X:106.289,Y:0,Z:101.104,ID:6,Active:!0},Four:{X:94.293,Y:0,Z:101.127,ID:7,Active:!0}}}],1155:[{Name:`<a href='https://docs.qq.com/doc/DUG5OR2x5T0d5TWVs'target='_blank'>树嘎 Enrance Mob</a>`,Place:{A:{X:-11.747,Y:0,Z:-9.764,ID:0,Active:!0},B:{X:-16.405,Y:0,Z:8.963,ID:1,Active:!0},C:{X:-12.119,Y:0,Z:1.613,ID:2,Active:!0},D:{X:0,Y:0,Z:0,ID:3,Active:!1},One:{X:-.009,Y:0,Z:19.405,ID:4,Active:!0},Two:{X:0,Y:0,Z:0,ID:5,Active:!1},Three:{X:0,Y:0,Z:0,ID:6,Active:!1},Four:{X:0,Y:0,Z:0,ID:7,Active:!1}}},{Name:`<a href='https://docs.qq.com/doc/DUG5OR2x5T0d5TWVs'target='_blank'>树嘎 Boss 1</a>`,Place:{A:{X:0,Y:0,Z:-117,ID:0,Active:!0},B:{X:17,Y:0,Z:-100,ID:1,Active:!0},C:{X:0,Y:0,Z:-83,ID:2,Active:!0},D:{X:-17,Y:0,Z:-100,ID:3,Active:!0},One:{X:7.199,Y:0,Z:-108.4,ID:4,Active:!0},Two:{X:7.199,Y:0,Z:-91.599,ID:5,Active:!0},Three:{X:-7.199,Y:0,Z:-91.599,ID:6,Active:!0},Four:{X:-7.199,Y:0,Z:-108.4,ID:7,Active:!0}}},{Name:`<a href='https://docs.qq.com/doc/DUG5OR2x5T0d5TWVs'target='_blank'>树嘎 Middle Mob</a>`,Place:{A:{X:0,Y:0,Z:0,ID:0,Active:!1},B:{X:0,Y:0,Z:0,ID:1,Active:!1},C:{X:0,Y:0,Z:0,ID:2,Active:!1},D:{X:0,Y:0,Z:0,ID:3,Active:!1},One:{X:285.028,Y:0,Z:36.561,ID:4,Active:!0},Two:{X:281.299,Y:0,Z:20.222,ID:5,Active:!0},Three:{X:294.197,Y:0,Z:-1.702,ID:6,Active:!0},Four:{X:309.982,Y:0,Z:-31.385,ID:7,Active:!0}}},{Name:`<a href='https://docs.qq.com/doc/DUG5OR2x5T0d5TWVs'target='_blank'>树嘎 Boss 2</a>`,Place:{A:{X:300,Y:7,Z:-139.5,ID:0,Active:!0},B:{X:318.5,Y:7,Z:-120,ID:1,Active:!0},C:{X:300,Y:7,Z:-101.5,ID:2,Active:!0},D:{X:281.5,Y:7,Z:-120,ID:3,Active:!0},One:{X:300,Y:7,Z:-117.5,ID:4,Active:!0},Two:{X:281.5,Y:7,Z:-139,ID:5,Active:!0},Three:{X:318.5,Y:7,Z:-139,ID:6,Active:!0},Four:{X:281.5,Y:7,Z:-101.5,ID:7,Active:!0}}},{Name:`<a href='https://docs.qq.com/doc/DUG5OR2x5T0d5TWVs'target='_blank'>树嘎 Boss 3</a>`,Place:{A:{X:-200,Y:-195,Z:-13.199,ID:0,Active:!0},B:{X:-186.199,Y:-195,Z:0,ID:1,Active:!0},C:{X:-200,Y:-195,Z:13.199,ID:2,Active:!0},D:{X:-213.8,Y:-195,Z:0,ID:3,Active:!0},One:{X:-188.58,Y:-195,Z:-13.199,ID:4,Active:!0},Two:{X:-188.58,Y:-195,Z:13,ID:5,Active:!0},Three:{X:-211.419,Y:-195,Z:13.199,ID:6,Active:!0},Four:{X:-211.419,Y:-195,Z:-13,ID:7,Active:!0}}},{Name:`<a href='https://www.bilibili.com/read/cv28235466/'target='_blank'>MMW BOSS1</a>`,Place:{A:{X:-.282,Y:0,Z:-113.311,ID:0,Active:!0},B:{X:15.779,Y:0,Z:-99.813,ID:1,Active:!0},C:{X:-.517,Y:0,Z:-85.961,ID:2,Active:!0},D:{X:-15.289,Y:0,Z:-100.051,ID:3,Active:!0},One:{X:8.199,Y:0,Z:-106.268,ID:4,Active:!0},Two:{X:7.64,Y:0,Z:-93.008,ID:5,Active:!0},Three:{X:-7.993,Y:0,Z:-93.792,ID:6,Active:!0},Four:{X:-7.938,Y:0,Z:-106.316,ID:7,Active:!0}}},{Name:`<a href='https://www.bilibili.com/read/cv28235466/'target='_blank'>MMW BOSS2（spell式麻将）</a>`,Place:{A:{X:300.033,Y:7,Z:-132.846,ID:0,Active:!0},B:{X:312.372,Y:7,Z:-120.148,ID:1,Active:!0},C:{X:300.04,Y:7,Z:-105.134,ID:2,Active:!0},D:{X:287.503,Y:7,Z:-120.045,ID:3,Active:!0},One:{X:307.58,Y:7,Z:-108.437,ID:4,Active:!0},Two:{X:292.741,Y:7,Z:-108.599,ID:5,Active:!0},Three:{X:318.81,Y:7,Z:-108.372,ID:6,Active:!0},Four:{X:281.45,Y:7,Z:-108.488,ID:7,Active:!0}}},{Name:`<a href='https://www.bilibili.com/read/cv28235466/'target='_blank'>MMW BOSS3</a>`,Place:{A:{X:-199.954,Y:-195,Z:-11.785,ID:0,Active:!0},B:{X:-187.473,Y:-195,Z:-.102,ID:1,Active:!0},C:{X:-199.985,Y:-195,Z:11.857,ID:2,Active:!0},D:{X:-212.558,Y:-195,Z:-.023,ID:3,Active:!0},One:{X:-194.177,Y:-195,Z:3.905,ID:4,Active:!0},Two:{X:-205.843,Y:-195,Z:3.943,ID:5,Active:!0},Three:{X:-194.272,Y:-195,Z:-3.841,ID:6,Active:!0},Four:{X:-205.776,Y:-195,Z:-3.99,ID:7,Active:!0}}}],1157:[{Name:`Game8`,Text:`/p 【飛翔：散開方向】
/p 　　　 　 (A)
/p 　 　　 MT+ST
/p 　　D3　　 　 D4
/p (D)　　　 　 　 　 (B)
/p 　　D1　　 　 D2
/p 　 　 　H1+H2
/p 　　　 　 (C)
/p 【デモンクロー】ST先頭で頭割り
/p 【雑魚タゲ取り】
/p 2回目：MT⇒北西ウィル　ST⇒南西ウィル
/p 3回目：MT⇒南ウィル　　ST⇒東セウ
/p 【サザンクロス】 　 ｜【波動砲】
/p 背面から時計回り　｜9時で捨てる
/p MTのみ反時計回り ｜MTは東寄りにタゲサ内へ入る`},{Name:`<a href='https://discord.com/channels/277897135515762698/448209053743579186/1109777325140217896'target='_blank'>Markers from Discord @Maya#1998</a>`,Place:{A:{X:4.916,Y:0,Z:-18.292,ID:0,Active:!0},B:{X:16.196,Y:0,Z:-9.309,ID:1,Active:!0},C:{X:18.292,Y:0,Z:4.902,ID:2,Active:!0},D:{X:0,Y:0,Z:0,ID:3,Active:!1},One:{X:-4.903,Y:0,Z:18.315,ID:4,Active:!0},Two:{X:-16.272,Y:0,Z:9.354,ID:5,Active:!0},Three:{X:-18.335,Y:0,Z:-4.913,ID:6,Active:!0},Four:{X:0,Y:0,Z:0,ID:7,Active:!1}}},{Name:`候鸟`,Place:{A:{X:0,Y:0,Z:-18.799,ID:0,Active:!0},B:{X:18.5,Y:0,Z:3.255,ID:1,Active:!0},C:{X:0,Y:0,Z:18.799,ID:2,Active:!0},D:{X:-18.5,Y:0,Z:-3.255,ID:3,Active:!0},One:{X:0,Y:0,Z:0,ID:4,Active:!1},Two:{X:6.5,Y:0,Z:-17.6,ID:5,Active:!0},Three:{X:0,Y:0,Z:0,ID:6,Active:!1},Four:{X:-6.5,Y:0,Z:17.6,ID:7,Active:!0}}}],1169:[{Name:`极泽罗姆斯 Game8`,Text:`/p ■基本散開 　| ■フレア（頭割り塔）
/p 　MT　ST 　 | 北西：MT ST D1 D2
/p D1　　　D2 | 南東：H1 H2 D3 D4
/p D3　　　D4 | ■メテオインパクト
/p 　H1　H2　 | 西←H1D3/MTD1/STD2/H2D4→東
/p ■ヴィセラルワール+鎖
/p DPS：北 TH：南
/p ■フレアスパーク/ブランド
/p 西塔:MT H1 D1 D3
/p 東塔:ST H2 D2 D4
/p MT/D1　ST/D2
/p 　　 　 ◆
/p H1/D3　H2/D4　※追尾は時計回り
/p ■ダークマター
/p 北西：MT　北東：ST　頭割：中央　雷：外周`},{Name:`极泽罗姆斯 Game8 汉化`,Text:`/p ■基本散开 　| ■核爆（分摊踩塔）
/p 　MT　ST 　 | 左上塔：MTSTD1D2
/p D1　　　D2 | 右下他：H1H2D3D4
/p D3　　　D4 | ■陨石冲击
/p 　H1　H2　 | 西←H1D3/MTD1/STD2/H2D4→东
/p ■爪子+锁链
/p DPS：北 TH：南
/p ■核爆火花/烙印
/p 西塔:MT H1 D1 D3
/p 东塔:ST H2 D2 D4
/p MT/D1　ST/D2
/p 　　 　 ◆
/p H1/D3　H2/D4　※追踪点名顺时针放置
/p ■暗物质
/p 北西：MT　北东：ST　分摊：中间　雷：外侧`},{Name:`极泽罗姆斯 日基`,Place:{A:{X:92.09,Z:81.31,Y:0,Active:!0},B:{X:107.91,Z:81.28,Y:0,Active:!0},C:{X:100.05,Z:99.98,Y:0,Active:!0},D:{X:0,Z:0,Y:0,Active:!1},One:{X:81.12,Z:81.11,Y:0,Active:!0},Two:{X:118.9,Z:81.1,Y:0,Active:!0},Three:{X:118.85,Z:92.09,Y:0,Active:!0},Four:{X:81.01,Z:92.1,Y:0,Active:!0}}}],1175:[{Name:`ぬけまる/Nukemaru`,Text:`/p ■基本分散            ■百雷分散
/p D3  MT  D4　 　     　 MT
/p H1  ◎  H2　 　　  D1  ◎  D2
/p D1  ST  D2　　 H1      ST       H2
/p                                D3       D4
/p ■小怪
/p    MT:西　ST:东　蓝点名:北→南→北
/p ■陨石(塔)　优先分散站位附近
/p ■圆桌骑士第1回  　绿点名奶妈:1点
/p ■圆桌骑士第2回  　塔:(从近到远)近战→奶妈→远程
/p    塔→中央→击退位置分摊
/p ■圆桌骑士第3回  　以外侧骑士为12点
/p    分摊:10点　线:8点　蓝点名:3点
/p ■圆桌骑士第4回  　Boss背面集合→分散`}],1179:[{Name:`MMW - BOSS1`,Text:`/p ■南北                 ─┬■追泡泡/海峡┬■钢铁月环ー
/p 分摊：止步1           │ Ｔ    H            │ A/D:T D2
/p 分散：止步2           │    ★               │  C/B:D1 H
/p 水泡无脑                 │ D2  D1         │
/p ■排队
/p   分散←止步→分摊 │
/p     2  水泡→1   │
/p                         │
/p    1←水泡   2   │
/p   分摊←止步→分散 │
/p ■小怪优先级(A顺)  ■吹飞踩塔
/p  T＞H＞D1＞D2     │  TH固定踩中塔 泡炮&补塔:DPS`},{Name:`MMW - BOSS2`,Text:`/p ■地雷魔纹────■召唤小怪
/p                           │(外侧小怪)
/p  ■■■ ② 12或23 │ Ｔ         H
/p  ■■■②  的情况   │
/p  ■■    ①  22调整  │ D1       D2
/p  ③
/p ■平面爆雷（十字火）
/p ■■■■□
/p ■■12■■
/p ■■34■■
/p 白球为右上角的新12点
/p 12层：BOSS脚下，2不动，北边炸完1去北
/p 34层：BOSS南边一格，3不动，4剩1层去南`},{Name:`MMW - BOSS3`,Text:`/p 分散站位
/p    T
/p D2    H
/p    D1
/p ■飞镖盘1优先级
/p 蓝T 红DPS 黄H ※飞镖点两个D，D2补颜色
/p ■飞镖盘2
/p 以外周轮盘安全两色+AoE覆盖方向为北
/p TH左/D右
/p 飞镖同时点TH或2D，北边两人换位`},{Name:`<a href='https://docs.qq.com/sheet/DTlFYZlVkeGlSenFI?tab=BB08J2'target='_blank'>异闻阿罗一</a>`,Place:{A:{X:0,Y:0,Z:-10,ID:0,Active:!0},B:{X:10,Y:0,Z:0,ID:1,Active:!0},C:{X:0,Y:0,Z:10,ID:2,Active:!0},D:{X:-10,Y:0,Z:0,ID:3,Active:!0},One:{X:10,Y:0,Z:-10,ID:4,Active:!0},Two:{X:10,Y:0,Z:10,ID:5,Active:!0},Three:{X:-10,Y:0,Z:10,ID:6,Active:!0},Four:{X:-10,Y:0,Z:-10,ID:7,Active:!0}}},{Name:`<a href='https://docs.qq.com/sheet/DTlFYZlVkeGlSenFI?tab=BB08J2'target='_blank'>异闻阿罗二</a>`,Place:{A:{X:200,Y:-300,Z:-8,ID:0,Active:!0},B:{X:208,Y:-300,Z:0,ID:1,Active:!0},C:{X:200,Y:-300,Z:8,ID:2,Active:!0},D:{X:192,Y:-300,Z:0,ID:3,Active:!0},One:{X:212,Y:-300,Z:-12,ID:4,Active:!0},Two:{X:212,Y:-300,Z:12,ID:5,Active:!0},Three:{X:188,Y:-300,Z:12,ID:6,Active:!0},Four:{X:188,Y:-300,Z:-12,ID:7,Active:!0}}},{Name:`<a href='https://docs.qq.com/sheet/DTlFYZlVkeGlSenFI?tab=BB08J2'target='_blank'>异闻阿罗三</a>`,Place:{A:{X:-200,Y:-200,Z:-18.55,ID:0,Active:!0},B:{X:-181.45,Y:-200,Z:0,ID:1,Active:!0},C:{X:-200,Y:-200,Z:18.55,ID:2,Active:!0},D:{X:-218.55,Y:-200,Z:0,ID:3,Active:!0},One:{X:-186.883,Y:-200,Z:-13.117,ID:4,Active:!0},Two:{X:-186.883,Y:-200,Z:13.117,ID:5,Active:!0},Three:{X:-213.117,Y:-200,Z:13.117,ID:6,Active:!0},Four:{X:-213.117,Y:-200,Z:-13.117,ID:7,Active:!0}}}],1196:[{Name:`<a href='https://www.bilibili.com/video/BV1CApeeEEGd/'target='_blank'>莫古力</a>`,Text:`/p ■游龙绕场旋转(月环)         | ■嘴部发光(扇形)
/p ＆火阶段雷分散&冰上雷下 |    MT/D1 ／＼ST/D2
/p  MT/D1　ST/D2            　| H1/D3／　  　＼H2/D4
/p  H1/D3　H2/D4
/p  ■举起双爪(钢铁)
/p  H1/D3　MT/D1　ST/D2　H2/D4
/p  ■山火坦克踩塔 奇数:MT　偶数:ST
/p  ■小怪阶段直线分摊&火雷阶段分摊
/p  西：MTH1D1D3　东：STH2D2D4
/p  ■冰阶段开场
/p 大圈：西北 MT        东北 ST
/p 分摊:西H1D1D3　东H2D2D4`},{Name:`<a href='https://www.bilibili.com/video/BV1G7pEe9E5Z'target='_blank'>MMW</a>`,Text:`/p ■环分摊/冰雷分散 |■扇形分摊
/p MT/D1　ST/D2 　|　MT/D1／＼ST/D2
/p H1/D3　H2/D4　 |H1/D3／　　＼H2/D4
/p ■远离分摊
/p H1/D3　MT/D1　ST/D2　H2/D4
/p ■死刑塔 奇数:MT　偶数:ST
/p ■火雷灾祸分组分摊 + 小怪分组
/p 左 MTH1D1D3　右 STH2D2D4
/p ■冰灾祸死刑+分摊
/p 左上 MT　右上 ST
/p 分摊 左 H1D1D3　右 H2D2D4`},{Name:`Game8(ハムカツ式)`,Text:`/p ■風 災禍（雷氷） |■口腔に魔力(扇)
/p MT/D1　ST/D2 　|　MT/D1／＼ST/D2
/p H1/D3　H2/D4　 |H1/D3／　　＼H2/D4
/p ■力を溜める(前足)
/p H1/D3　MT/D1　ST/D2　H2/D4
/p ■マウンテンファイア 奇数:MT　偶数:ST
/p ■ディザスターサイン
/p 西：MTH1D1D3　東：STH2D2D4
/p ■災禍（炎氷）
/p 北西 MT　北東 ST
/p 頭割:西 H1D1D3　東 H2D2D4`},{Name:`通用标点`,Place:{A:{X:92.5,Y:0,Z:92.5,ID:0,Active:!0},B:{X:107.5,Y:0,Z:92.5,ID:1,Active:!0},C:{X:81,Y:0,Z:94,ID:3,Active:!0},D:{X:119,Y:0,Z:94,ID:2,Active:!0},One:{X:95,Y:0,Z:95,ID:4,Active:!0},Two:{X:105,Y:0,Z:95,ID:5,Active:!0},Three:{X:95,Y:0,Z:105,ID:6,Active:!0},Four:{X:105,Y:0,Z:105,ID:7,Active:!0}}}],1201:[{Name:`<a href='https://www.bilibili.com/video/BV1aBsaeeE8W'target='_blank'>莫古力</a>`,Text:`/p ～莫古力系列～首饰神专用宏
/p ～佐拉加歼殛战～
/p ◆情感投射・爆发(分摊线)
/p H1→H2→D4→D3→D2→D1→ST→MT
/p ◆无双之击(二人蓝圈分摊)
/p  ————场外新平台————
/p H1/D3 MT/D1 ST/D2 H2/D4
/p ◆小世界②黄标 ｜
/p ————BOSS ————
/p ｜MT/D1｜ST/D2 ｜
/p ｜-——-— ｜-—-——｜
/p ｜H1/D3｜H2/D4｜`},{Name:`<a href='https://www.bilibili.com/video/BV1sztheREVR'target='_blank'>MMW</a>`,Text:`/p 【分摊线】（日服）
/p H1→H2→D4→D3→D2→D1→ST→MT
/p 【分摊线】（美服）
/p MT→ST→D1→D2→H1→H2→D3→D4
/p 【22分摊】
/p 　　　　 BOSS
/p H1/D3 MT/D1 ST/D2 H2/D4
/p 风火剑分散
/p ===风火行===
/p D1 MT ST D2
/p D3 H1 H2 D4
/p 双半场分散（以Boss面向为基准）
/p MT/D1 ST/D2
/p H1/D3 H2/D4`},{Name:`Game8(ハムカツ式)`,Text:`/p 【プロジェクション・バースト(頭割り)】
/p H1→H2→D4→D3→D2→D1→ST→MT
/p 【ノック・オブ・ヴォロク(ペア割)】
/p 　　　　　ボス
/p H1/D3 MT/D1 ST/D2 H2/D4`},{Name:`莫古力`,Place:{A:{X:100,Y:0,Z:88,ID:0,Active:!0},B:{X:112,Y:0,Z:100,ID:1,Active:!0},C:{X:100,Y:0,Z:112,ID:2,Active:!0},D:{X:88,Y:0,Z:100,ID:3,Active:!0},One:{X:0,Y:0,Z:0,ID:4,Active:!1},Two:{X:0,Y:0,Z:0,ID:5,Active:!1},Three:{X:0,Y:0,Z:0,ID:6,Active:!1},Four:{X:0,Y:0,Z:0,ID:7,Active:!1}}},{Name:`Conga`,Place:{A:{X:100,Y:0,Z:87.5,ID:0,Active:!0},B:{X:100,Y:0,Z:102.5,ID:1,Active:!0},C:{X:94.5,Y:0,Z:77.8,ID:2,Active:!0},D:{X:100,Y:0,Z:117.5,ID:3,Active:!0},One:{X:100,Y:0,Z:95,ID:4,Active:!0},Two:{X:100,Y:0,Z:110,ID:5,Active:!0},Three:{X:105.5,Y:0,Z:77.8,ID:6,Active:!0},Four:{X:100,Y:0,Z:125,ID:7,Active:!0}}}],1226:[{Name:`<a href='https://www.bilibili.com/video/BV1dhyHYME2Z'target='_blank'>苏帕酱噗</a>`,Text:`/p 【基本散开】 ｜【扇形引导】
/p D3 MT D4     ｜             MTD3
/p H1  ☆  H2     ｜　H1D1 ☆ H2D4
/p D1 ST   D2     ｜              STD2
/p 【交叉尖甲】（十字引导）
/p 先TH　后DPS　※22分摊从扇形诱导位置逆时针移动
/p 【冲击波（击退）】
/p 北MTH1D1D3　南STH2D2D4
/p 【分裂指甲斩（职能分散）】
/p BOSS
/p T D H
/p 【猫猫雨（接线+远近分摊）】（DTTT）
/p 第1轮 D1左 D2右
/p 第2~4轮 MT中心偏左上 ST中心偏右上 2裸吃34无敌
/p MTST诱导近分摊，其他人在C诱导远分摊`},{Name:`Game8`,Text:`/p 　【基本散開】 　 　｜【扇範囲誘導】(全てボス基準)
/p 　D3 　MT 　D4 　 ｜ 　 　 　 MTD3
/p 　H1　ボス　H2 　｜　H1D1 　ボス 　H2D4
/p 　D1 　ST 　D2 　 ｜　 　 　 　STD2
/p 【クアドラプルネイル】（十字固定処理）
/p 　先:TH　後:DPS　※ペア割は扇誘導位置から反時計に動く
/p 【4:4頭割り・衝撃波】（衝撃波は東西散開）
/p 　北/西:MTH1D1D3　南/東:STH2D2D4
/p 【スプレッドネイル】
/p 　 　 　ボス
/p 　T 　 　D　 　H
/p 【レイニングキャッツ】(タンク無敵)
/p 　北西:MT→MT(無敵)→MT(無敵)→D1　南側タゲサ：H1D1D2
/p 　北東:ST →ST(無敵) →ST(無敵) →D2 　 南側外周：H2D3D4`},{Name:`【通用】Numbers for Sleepy Cats`,Place:{A:{X:100,Y:0,Z:90,ID:0,Active:!0},B:{X:110,Y:0,Z:100,ID:1,Active:!0},C:{X:100,Y:0,Z:110,ID:2,Active:!0},D:{X:90,Y:0,Z:100,ID:3,Active:!0},One:{X:90,Y:0,Z:95,ID:4,Active:!0},Two:{X:110,Y:0,Z:95,ID:5,Active:!0},Three:{X:110,Y:0,Z:105,ID:6,Active:!0},Four:{X:90,Y:0,Z:105,ID:7,Active:!0}}}],1228:[{Name:`<a href='https://www.bilibili.com/video/BV1bwy9Y7ELV'target='_blank'>苏帕酱噗</a>`,Text:`/p ■基本散开
/p D3 MT D4   D3 D4   MT/D3 ST/D4
/p H1  ☆  H2   MT ST    H1/D1 D2/H2
/p D1 ST  D2   D1 D2
/p                        H1 H2
/p ■1运
/p 近战：♡2 正面（北）起点顺时针分摊　远程：♡3
/p ■2运
/p ♡0：正面（北）起点顺时针分摊
/p ♡1：场中待机→分散:TH西 DPS东；塔:TH 北/西 DPS南/东
/p ■毒圈　TH上半场 DPS下半场
/p ■3运
/p 大圈：X字；踩塔：X字
/p ■软狂暴
/p 初始标准8方 毒7s时去场中`},{Name:`Game8`,Text:`/p ■基本散開
/p D3 MT D4　 　D3 D4 　 　MT/D3 　ST/D4
/p H1 ☆ H2 　 　 MT ST 　 　 H1/D1 　 D2/H2
/p D1 ST D2 　 　 D1 D2
/p 　 　 　 　 　 　H1 H2
/p ■1stライヴ
/p 近接：♡2（頭割り処理）　遠隔：♡3
/p ■2ndライヴ
/p ♡0：中心→北→TH西、DPS東で頭割り
/p ♡1：南待機→AOE対象者は捨てる 塔:TH 北/西 DPS南/東
/p ■毒捨て　TH：北西、DPS：南東
/p ■3rdライヴ
/p デバフ捨て、塔踏みはペア割基準
/p ■ブラックハート
/p 8方向散会　HPが戻り次第、早いペア順に中央集合`},{Name:`【通用】Standard/Clocks`,Place:{A:{X:100,Y:0,Z:85,ID:0,Active:!0},B:{X:115,Y:0,Z:100,ID:1,Active:!0},C:{X:100,Y:0,Z:115,ID:2,Active:!0},D:{X:85,Y:0,Z:100,ID:3,Active:!0},One:{X:90,Y:0,Z:90,ID:4,Active:!0},Two:{X:110,Y:0,Z:90,ID:5,Active:!0},Three:{X:110,Y:0,Z:110,ID:6,Active:!0},Four:{X:90,Y:0,Z:110,ID:7,Active:!0}}},{Name:`Uptime Defamations`,Place:{A:{X:100,Y:0,Z:92.5,ID:0,Active:!0},B:{X:0,Y:0,Z:0,ID:1,Active:!1},C:{X:0,Y:0,Z:0,ID:2,Active:!1},D:{X:0,Y:0,Z:0,ID:3,Active:!1},One:{X:83,Y:0,Z:92.5,ID:4,Active:!0},Two:{X:117,Y:0,Z:92.5,ID:5,Active:!0},Three:{X:108.5,Y:0,Z:107.5,ID:6,Active:!0},Four:{X:91.5,Y:0,Z:107.5,ID:7,Active:!0}}},{Name:`Outer/Centerstage`,Place:{A:{X:100,Y:0,Z:92,ID:0,Active:!0},B:{X:108,Y:0,Z:100,ID:1,Active:!0},C:{X:100,Y:0,Z:108,ID:2,Active:!0},D:{X:92,Y:0,Z:100,ID:3,Active:!0},One:{X:90,Y:0,Z:90,ID:4,Active:!0},Two:{X:110,Y:0,Z:90,ID:5,Active:!0},Three:{X:110,Y:0,Z:110,ID:6,Active:!0},Four:{X:90,Y:0,Z:110,ID:7,Active:!0}}}],1230:[{Name:`<a href='https://www.bilibili.com/video/BV1hZSJYzEEa'target='_blank'>苏帕酱噗</a>`,Text:`/p ■八重分散ーーー■四重二二ーーーーーー
/p D3 MT D4            MT/D3  H2/D4
/p H1  ★  H2                         ★
/p D1 ST  D2             H1/D1  ST/D2
/p ■强袭俯冲·分散ーーーーーー■强袭俯冲·分摊ーーーーーー
/p   MT   ★    ST                                         ★
/p       D1   D2                               MT/D1 D2/ST
/p D3  H1  H2  D4                      D3/H1 H2/D4
/p ■野蛮爆炸（击退塔）
/p 1塔　近战组西/北 远程组东/南
/p 2塔　面朝场中 MTD1H1D3往左 STD2H2D4往右
/p ■零式引线爆弹（Hector解法）
/p MTD1：A/D；ST/D2：B/C
/p H1D3：西北角/东北角；H2D4：西南角/东南角
/p ■导火线区域
/p 找线：A顺时针 MT→ST→H1→H2　D1→D2→D3→D4
/p 踩线：短→长　MT→ST→H1→H2　D1→D2→D3→D4
/p ■超华丽野蛮旋火·分散站位（近战字母点，远程四角）
/p D3     MT     D4
/p D1     ★      D2
/p H1     ST     H2`},{Name:`Game8`,Text:`/p ■基本散開ーーーーーー■4ウェイーーーーーー
/p 　D3 MT D4 　 　 　 　MT/D3 　 　 H2/D4
/p 　H1 ★ H2 　 　 　 　 　 　 　 　★
/p 　D1 ST D2 　 　 　 　 H1/D1 　 　 ST/D2
/p ■8ショックーーーーー■4ショックーーーーーー
/p 　 MT　★　ST　 　 　 　 　 　 　 　★
/p 　 　D1　D2 　 　 　 　 　 MT/D1 　 D2/ST
/p D3　H1　H2　D4 　 　 　D3/H1 　 H2/D4
/p ■ボンバリアンボム(ノックバック塔)ーーーーー
/p 　1塔目　北西：近接、南東：遠隔
/p 　2塔目　ボスを見て左側：MT組、右側：ST組
/p ■零式フューズボムー※単体の長ボムを北に見る
/p 1回目短　 　北H1/D3 ┃H1/D3　MT/D1
/p 　MT/D1 　 　 　 　 　┃ 　 　 　 　 　 ST/D2
/p 　H2/D4 ST/D2 　 　 ┃ 2回目長 　 　 H2/D4
/p ■フューズフィールドーーーーーーーーーーー
/p 　基本散開から時計回り 短→長
/p 　MT→ST→H1→H2　D1→D2→D3→D4
/p ■ボンバリアンスペシャルーーーーーーーーー
/p 8ショック/基本散開
/p 4ショック/ペアX受け
/p ■極盛り式スピニングファイヤー(アタッチ)ーー
/p 　D3　MT　D4
/p 　D1 　★ 　D2
/p 　H1　ST　 H2`},{Name:`Safespots for Clone Dash`,Place:{A:{X:100,Y:0,Z:93,ID:0,Active:!0},B:{X:107,Y:0,Z:100,ID:1,Active:!0},C:{X:100,Y:0,Z:107,ID:2,Active:!0},D:{X:93,Y:0,Z:100,ID:3,Active:!0},One:{X:94,Y:0,Z:94,ID:4,Active:!0},Two:{X:106,Y:0,Z:94,ID:5,Active:!0},Three:{X:106,Y:0,Z:106,ID:6,Active:!0},Four:{X:94,Y:0,Z:106,ID:7,Active:!0}}}],1232:[{Name:`<a href='https://www.bilibili.com/video/BV1JtDQYVEKp'target='_blank'>苏帕酱噗</a>`,Text:`/p ■闪电猎巫ーーーー■圆轮・轮圆式猎巫ーーーーーー
/p D3 D4                       D3 MT D4
/p MT ST                        D1 ☆ D2
/p D1 D2                       H1 ST H2
/p H1 H2
/p ■第1次雷转质展开ーーーーーーーーーーーーー
/p MT D2 D4 | ☆　ST/D2 H2/D4
/p D1 ST  H2  | MT/D1
/p D3 H1 角    | H1/D3          角
/p ■第2次雷转质展开（长1长2当作长2长3）
/p 基本散开     |3次 ■■■ 3次  西：TH 东：DPS
/p D3 MT D4 |    ■   ■   ■      22秒：3次 or 2次
/p H1 ☆ H2   |    2次 ■ 2次     42秒：2次 or 1次
/p D1 ST D2  |  ■ ■ 他 ■ ■/p ・分摊（长1长2当作长2长3）・分散(北基准)
/p TH3次：B,D DPS3次：中央 | D3
/p TH2次：A     DPS2次：C      | MT  H1
/p                                                     | D1☆　ST
/p                                                     | D2  H2
/p                                                     | D4
/p ■3连炮ーーーーーーーー雷转质移植※以C为12点
/p   紫                            ｜
/p 箭头                            | D3/MT   ST/D4
/p 蓝 蓝 ※TH靠场外    |              ☆
/p 蓝 蓝 ※DPS靠场内 | H1/D1   D2/H2
/p 箭头                           |
/p   紫                             |`},{Name:`<a href='https://www.bilibili.com/video/BV1BiDyY9Ei3'target='_blank'>MMW</a>`,Text:`/p ■开场分散ーーーー■狩猎站位（DN式）ーーーーーー
/p D3 D4 　 　 　 　D3 MT D4
/p MT ST 　 　 　 　D1 ☆ D2
/p D1 D2 　 　 　 　H1 ST H2
/p H1 H2
/p ■雷转质1 分散 / 分摊（面向BOSS）ーーーーーーーー
/p MT D2 D4 　 　| ☆　ST/D2 H2/D4
/p D1 ST H2 　 　| MT/D1
/p D3 H1 雷 　 | H1/D3
/p ■雷转质2 基本分散 / 点名安置 以T型AOE为12点
/p 　 | 多 ■■■ 多 　 安全区6点
/p D3 MT D4 | ■ ■ ■ 　 左半场TH 右半场DPS
/p H1 ☆ H2 | 少 　 ■ 　 少 第一轮22s：3层多2层少
/p D1 ST D2 | ■ ■ ○ ■ ■ 第二轮42s：2层多1层少
/p 以A点为基准 根据半场刀换位（多D和D1站位与BOSS重合）
/p ■ーーーー分摊雷站位 / 分散雷站位ーーーーーーーーーー
/p ｜ D3 D3
/p 　 少TN ｜ H1　 MT 　H1
/p 多TN　多D 多TN ｜　 ST D1　ST
/p 　 　 少D　 　 ｜ H2 　 D2　 　H2
/p 　 　 　 　 　 　 ｜ D4 　 D4
/p ■分组炮站位ーーーーーー■转场分散分组（BOSS面向基准）
/p 　 蓄雷 　 圆环点名 　 ｜
/p 　 远近 　 面向BOSS 　 ｜ 　D3/MT　 ST/D4
/p 圆环 圆环 TH左 　 　 ｜ 　 　 　 　☆
/p 圆环 　 圆环 DPS右　 　｜ 　 H1/D1 　D2/H2
/p 　 远近 　 　 　 　 　 　 ｜※顺时针→逆时针往返躲避地火
/p 蓄雷 ｜`},{Name:`Game8(8月5日最终修正版)`,Text:`/p ■縦散開ーーーー■円輪・輪円（DN式）ーーーーーー
/p   D3 D4                   D3  MT  D4
/p   MT ST                   D1   ☆   D2
/p   D1 D2                   H1  ST   H2
/p   H1 H2
/p ■エレクトロープ1回目ーーーーーーーーーーーーー
/p   MT  D2  D4         |      ☆   ST/D2   H2/D4
/p   D1  ST  H2        |  MT/D1
/p   D3  H1  角          |  H1/D3
/p ■エレクトロープ2回目
/p   基本散開              |多  ■■■  多      西：TH  東：DpS
/p   D3 MT D4          |■ 　 ■ 　 ■      22秒：3回 or 2回
/p   H1  ☆  H2          |少 　 ■ 　 少      42秒：2回 or 1回
/p   D1  ST D2          |■ ■ 他 ■ ■
/p ・ペア散開　 　　  　 　　　  ・散開(北基準)
/p  TH多：B,D　DPS多：中央  |　　      D3
/p  TH少：A   　DPS少：C       |     MT  　　H1
/p  　　　　　 　　　　　　  　| ☆D1   ST
/p  　　　 　　　　　　  　　　|     D2　      H2
/p  　　　 　　　　　　 　 　　| 　    　D4
/p ■ストリームーーーーーーエレクトロープ移植※ボス基準
/p  　   紫　                      ｜
/p 　  誘電　                      |    D3/MT　ST/D4
/p  青         青 ※TH外側    |                 ☆
/p  青         青 ※DPS内側  |    H1/D1    D2/H2
/p  　 誘電                         |   ※自分のペアの基本散開位置と往復
/p        紫`},{Name:`<a href='https://www.bilibili.com/video/BV1JtDQYVEKp'target='_blank'>通用</a>`,Place:{A:{X:100,Y:0,Z:90,ID:0,Active:!0},B:{X:110,Y:0,Z:100,ID:1,Active:!0},C:{X:100,Y:0,Z:110,ID:2,Active:!0},D:{X:90,Y:0,Z:100,ID:3,Active:!0},One:{X:95,Y:0,Z:95,ID:4,Active:!0},Two:{X:105,Y:0,Z:95,ID:5,Active:!0},Three:{X:105,Y:0,Z:105,ID:6,Active:!0},Four:{X:95,Y:0,Z:105,ID:7,Active:!0}}},{Name:`Witch Hunt`,Place:{A:{X:100,Y:0,Z:90,ID:0,Active:!0},B:{X:110,Y:0,Z:100,ID:1,Active:!0},C:{X:100,Y:0,Z:110,ID:2,Active:!0},D:{X:90,Y:0,Z:100,ID:3,Active:!0},One:{X:93,Y:0,Z:93,ID:4,Active:!0},Two:{X:107,Y:0,Z:93,ID:5,Active:!0},Three:{X:107,Y:0,Z:107,ID:6,Active:!0},Four:{X:93,Y:0,Z:107,ID:7,Active:!0}}}],1238:[{Name:`伊甸自用`,Place:{A:{X:100,Y:0,Z:90,Active:!0},B:{X:110,Y:0,Z:100,Active:!0},C:{X:100,Y:0,Z:110,Active:!0},D:{X:90,Y:0,Z:100,Active:!0},One:{X:92.73,Y:0,Z:92.73,Active:!0},Two:{X:107.27,Y:0,Z:92.73,Active:!0},Three:{X:107.27,Y:0,Z:107.27,Active:!0},Four:{X:92.73,Y:0,Z:107.27,Active:!0}}}],1243:[{Name:`<a href='https://www.bilibili.com/video/BV1fsqWYeEDT/'target='_blank'>子言</a>`,Text:`/p 【风阶段】
/p 分摊MT组 　 　锁D
/p 　锁TH 　 　分摊ST组
/p 【土阶段】
/p D1/MT 　ST/D2 　■塔2优先级：上:近战>坦克>远程>治疗:下
/p D3/H1 　H2/D4 　■陨石：前：近战　后：坦克
/p 【陨石挡球】→左上开始走コ字路线
/p 【绝对君权】
/p D1/MT 　 　 　 D2/ST
/p D3/H1 　分摊 　 D4/H2
/p 【冰阶段】
/p 　南冰：外侧→上桥 　内侧→下桥
/p 东西冰：上侧→下桥 　下侧→上桥
/p ■截线：①D1D2→②MTST→③④MTST无敌`},{Name:`ハムカツ式`,Text:`/p 【ヴァーチャルシフト1回目】
/p 頭割MT組 　 　鎖D
/p 　鎖TH 　 　頭割ST組
/p 【ヴァーチャルシフト2回目】
/p D1/MT 　ST/D2 　■塔2優先度：上:近接>タンク>遠隔>ヒラ:下
/p D3/H1 　H2/D4 　■岩設置：前：近接　後：タンク
/p 【グラビティブロウ】→左上からコの字
/p 【アブソリュートオーソリティ】
/p D1/MT 　 　 　D2/ST 　※近い距離減衰同士で孤独処理
/p D3/H1 　頭 　 D4/H2
/p 【ヴァーチャルシフト3回目】
/p 　南氷：外側→上の橋 　内側→下の橋
/p 東西氷：上側→下の橋 　下側→上の橋
/p ■南寄り4人が近い橋で先に戻る→北4人は自分が使った橋で戻る
/p ■線取：①D1D2→②MTST素受け→③④MTST無敵受け`},{Name:`Sphene EX (Braindead)`,Place:{A:{X:108.7,Y:0,Z:86.7,ID:0,Active:!0},B:{X:104,Y:0,Z:94,ID:1,Active:!0},C:{X:108,Y:0,Z:98,ID:2,Active:!0},D:{X:112,Y:0,Z:102,ID:3,Active:!0},One:{X:91.3,Y:0,Z:86.7,ID:4,Active:!0},Two:{X:96,Y:0,Z:94,ID:5,Active:!0},Three:{X:92,Y:0,Z:98,ID:6,Active:!0},Four:{X:88,Y:0,Z:102,ID:7,Active:!0}}}],1252:[{Name:`[鸟区]老一(北CBA南123)`,Place:{A:{X:714,Z:361,Y:-481,Active:!0},B:{X:700,Z:347,Y:-481,Active:!0},C:{X:686,Z:361,Y:-481,Active:!0},D:{X:0,Y:0,Z:0,Active:!1},One:{X:686,Z:397,Y:-481,Active:!0},Two:{X:700,Z:411,Y:-481,Active:!0},Three:{X:714,Z:397,Y:-481,Active:!0},Four:{X:0,Y:0,Z:0,Active:!1}}},{Name:`[猪区]老一(321ABC)`,Place:{A:{X:691,Z:397,Y:-481,Active:!0},B:{X:700,Z:406,Y:-481,Active:!0},C:{X:709,Z:397,Y:-481,Active:!0},D:{X:0,Y:0,Z:0,Active:!1},One:{X:709,Z:360,Y:-481,Active:!0},Two:{X:700,Z:351,Y:-481,Active:!0},Three:{X:691,Z:361,Y:-481,Active:!0},Four:{X:0,Y:0,Z:0,Active:!1}}},{Name:`[鸟区]老二(斜点【非】极限温度计位置)`,Place:{A:{X:-800,Z:344,Y:-876,Active:!0},B:{X:-785,Z:360,Y:-876,Active:!0},C:{X:-800,Z:375,Y:-876,Active:!0},D:{X:-815,Z:360,Y:-876,Active:!0},One:{X:-810,Z:349,Y:-876,Active:!0},Two:{X:-790,Z:349,Y:-876,Active:!0},Three:{X:-790,Z:372,Y:-876,Active:!0},Four:{X:-810,Z:372,Y:-876,Active:!0}}},{Name:`[鸟区]老二(斜点极限温度计位置)`,Place:{A:{X:-800,Z:345,Y:-876,Active:!0},B:{X:-785,Z:360,Y:-876,Active:!0},C:{X:-800,Z:375,Y:-876,Active:!0},D:{X:-815,Z:360,Y:-876,Active:!0},One:{X:-807.778,Z:352.222,Y:-876,Active:!0},Two:{X:-792.222,Z:352.222,Y:-876,Active:!0},Three:{X:-792.222,Z:367.778,Y:-876,Active:!0},Four:{X:-807.778,Z:367.778,Y:-876,Active:!0}}},{Name:`[鸟区]老三(标点为十字极限位置)`,Place:{A:{X:-337,Y:-840,Z:147,Active:!0},B:{X:-327,Y:-840,Z:157,Active:!0},C:{X:-337,Y:-840,Z:167,Active:!0},D:{X:-347,Y:-840,Z:157,Active:!0},One:{X:-344,Y:-840,Z:150,Active:!0},Two:{X:-330,Y:-840,Z:150,Active:!0},Three:{X:-330,Y:-840,Z:164,Active:!0},Four:{X:-344,Y:-840,Z:164,Active:!0}}},{Name:`[鸟区]老四(方块外ABC方块内123)(标点【中心】为钢铁月环范围)`,Place:{A:{X:700,Z:-684,Y:-476,Active:!0},B:{X:709,Z:-669,Y:-476,Active:!0},C:{X:691,Z:-669,Y:-476,Active:!0},D:{X:0,Y:0,Z:0,Active:!1},One:{X:683,Z:-684,Y:-476,Active:!0},Two:{X:717,Z:-684,Y:-476,Active:!0},Three:{X:700,Z:-654,Y:-476,Active:!0},Four:{X:0,Y:0,Z:0,Active:!1}}},{Name:`[猪区]老四`,Place:{A:{X:695,Z:-684,Y:-476,Active:!0},B:{X:696,Z:-666,Y:-476,Active:!0},C:{X:710,Z:-676,Y:-476,Active:!0},D:{X:708,Z:-682,Y:-476,Active:!0},One:{X:690,Z:-673,Y:-476,Active:!0},Two:{X:705,Z:-666,Y:-476,Active:!0},Three:{X:705,Z:-683,Y:-476,Active:!0},Four:{X:726,Z:-678,Y:-476,Active:!0}}},{Name:`[国际服]老一`,Place:{A:{X:700,Y:-481,Z:360,ID:0,Active:!0},B:{X:0,Y:0,Z:0,ID:1,Active:!1},C:{X:700,Y:-481,Z:400,ID:2,Active:!0},D:{X:0,Y:0,Z:0,ID:3,Active:!1},One:{X:690,Y:-481,Z:370,ID:4,Active:!0},Two:{X:710,Y:-481,Z:370,ID:5,Active:!0},Three:{X:710,Y:-481,Z:390,ID:6,Active:!0},Four:{X:690,Y:-481,Z:390,ID:7,Active:!0}}},{Name:`[国际服]老二（温度计极限位置）`,Place:{A:{X:-800,Y:-876,Z:349,ID:0,Active:!0},B:{X:-789,Y:-876,Z:360,ID:1,Active:!0},C:{X:-800,Y:-876,Z:371,ID:2,Active:!0},D:{X:-811,Y:-876,Z:360,ID:3,Active:!0},One:{X:-807.778,Y:-876,Z:352.222,ID:4,Active:!0},Two:{X:-792.222,Y:-876,Z:352.222,ID:5,Active:!0},Three:{X:-792.222,Y:-876,Z:367.778,ID:6,Active:!0},Four:{X:-807.778,Y:-876,Z:367.778,ID:7,Active:!0}}},{Name:`[国际服]老三（标点外侧为十字范围边界）`,Place:{A:{X:-337,Y:-840,Z:147,ID:0,Active:!0},B:{X:-327,Y:-840,Z:157,ID:1,Active:!0},C:{X:-337,Y:-840,Z:167,ID:2,Active:!0},D:{X:-347,Y:-840,Z:157,ID:3,Active:!0},One:{X:-344,Y:-840,Z:150,ID:4,Active:!0},Two:{X:-330,Y:-840,Z:150,ID:5,Active:!0},Three:{X:-330,Y:-840,Z:164,ID:6,Active:!0},Four:{X:-344,Y:-840,Z:164,ID:7,Active:!0}}},{Name:`[国际服]老四（标点中心为钢铁月环范围）`,Place:{A:{X:682.6795,Y:-476,Z:-684,ID:0,Active:!0},B:{X:700,Y:-476,Z:-654,ID:1,Active:!0},C:{X:717.3205,Y:-476,Z:-684,ID:2,Active:!0},D:{X:0,Y:0,Z:0,ID:3,Active:!1},One:{X:700,Y:-476,Z:-684,ID:4,Active:!0},Two:{X:691.3397,Y:-476,Z:-669,ID:5,Active:!0},Three:{X:708.6603,Y:-476,Z:-669,ID:6,Active:!0},Four:{X:0,Y:0,Z:0,ID:7,Active:!1}}}],1257:[{Name:H(`XivStrat M5S`,`https://xivstrat.com/07/m5s`),Text:`/p  【职能分摊分散】|  【钢铁月环八方】       |【地火分摊分散】
/p 　 　H1　　　　  |　　 MT　    ST　     　 |　D3　 D4
/p  MT　　 远D　　 | 　H1　　　　 H2　　 |　H1　 H2
/p  ST　　   近D　    | 　D3　 　　　D4　　 |　D1 　D2
/p  　　H2　　　　  |　  　D1　 D2　　　   |　MT 　ST
/p 【第一次地板】西:MT组 东:ST组 内:近战 外:远程
/p 【αβ撞毒】从北到南倒计时从短到长排队
/p       【地板蓝火】              |          【诱导扇形】
/p            D3     D4    　 　   | 　        TH→DPS
/p 　D3 MT　 ST D4    　 　|
/p 　            ★        　　　　|　     MTD3　　STD4
/p 　H1 D1　 D2 H2  　　  |　　　　  　★
/p 　      H1　 H2       　　   |　　 H1D1　　 H2D2`},{Name:`Game8`,Text:`/p 【ジングル固定】|【ナイトフィーバー】|【ウェーブオンウェーブ】
/p 　　H1　　　　 |　　MT　 ST　　　　|　　MT　 ST
/p MT　　遠D　　 | 　H1　　　　 H2　　 |　　D1　 D2
/p ST　　 近D　　 | 　D3　 　　　D4　　|　　 H1 　H2
/p 　　H2　　　　|　　　D1　 D2　　　 |　　 D3　 D4
/p 【ディスコ1回目】西:MT組 東:ST組 内周:近接 外周:遠隔
/p 【音響爆弾】北から秒数短い順にペア整列
/p 【フロッグダンサー1回目】|【ディスコ・ダンサー2回目/後半ダンシング】
/p MT組:北西 ST組:南東 　　| 　(扇誘導) TH→DPS
/p 　ペア頭割り:横隣り　　　|
/p 　　　　 ★　　　　　　　|　MTD3　　H2D4
/p 　MT/ST　 D1/D2　　　|　　　　　★
/p 　H1/H2　 D3/D4　　　|　　H1D1　　 STD2`},{Name:H(`XivStrat M5S`,`https://xivstrat.com/07/m5s`),Place:{A:{X:100,Z:90,Y:0,Active:!0},B:{X:110,Z:100,Y:0,Active:!0},C:{X:100,Z:110,Y:0,Active:!0},D:{X:90,Z:100,Y:0,Active:!0},One:{X:87.5,Z:87.5,Y:0,Active:!0},Two:{X:112.5,Z:87.5,Y:0,Active:!0},Three:{X:112.5,Z:112.5,Y:0,Active:!0},Four:{X:87.5,Z:112.5,Y:0,Active:!0}}},{Name:`Standard`,Place:{A:{X:100,Y:0,Z:92.5,ID:0,Active:!0},B:{X:107.5,Y:0,Z:100,ID:1,Active:!0},C:{X:100,Y:0,Z:107.5,ID:2,Active:!0},D:{X:92.5,Y:0,Z:100,ID:3,Active:!0},One:{X:87.5,Y:0,Z:87.5,ID:4,Active:!0},Two:{X:112.5,Y:0,Z:87.5,ID:5,Active:!0},Three:{X:112.5,Y:0,Z:112.5,ID:6,Active:!0},Four:{X:87.5,Y:0,Z:112.5,ID:7,Active:!0}}},{Name:`Standard 2`,Place:{A:{X:100,Y:0,Z:85,ID:0,Active:!0},B:{X:115,Y:0,Z:100,ID:1,Active:!0},C:{X:100,Y:0,Z:115,ID:2,Active:!0},D:{X:85,Y:0,Z:100,ID:3,Active:!0},One:{X:92.5,Y:0,Z:92.5,ID:7,Active:!0},Two:{X:107.5,Y:0,Z:92.5,ID:4,Active:!0},Three:{X:107.5,Y:0,Z:107.5,ID:5,Active:!0},Four:{X:92.5,Y:0,Z:107.5,ID:6,Active:!0}}}],1259:[{Name:H(`XivStrat M6S`,`https://xivstrat.com/07/m6s`),Text:`/p ■ 基本分散 (BOSS面基、TBOSS脚下)
/p 　      D3  D4
/p      H1　☆ 　H2
/p      　 D1  D2
/p ■ 击飞分摊（2:2:2:2）
/p 　 　 　     BOSS
/p    MTD1　H1D3　STD2
/p 　　　　   H2D4
/p ■ 44分摊：←MT组 ST组→
/p ■ 沙漠阶段
/p ▼ 仙人掌(A点躲避) 　 ▼ 流沙双奶分散(场基) 　 ▼ 流沙双奶分散(危险角基)
/p 　　　6人 　　　 　｜　H1　   6人         ｜　H2　   6人
/p 　D　 　　　T　　  ｜　备选　 H2          ｜　危险　 H1
/p ■ 炸弹(流沙北)
/p H1/D3 MT/D1 ST/D2 H2/D4
/p ■ 山川　　　　　　　    ■ 雷云
/p 火：外侧MTH1D1D2　　 　 　 雷云为北
/p 　　内侧STH2D3D4　　TH←左　人群　右→DPS
/p 雷：D3              D4
/p         D1    MT    ST
/p         H1    D2    H2
/p ■ 踩塔　　　　　 　       ■ 第二次塔
/p H2D4　北　H1D3　 　4・2・2塔：近战4人基准顺逆时针
/p ※※※※※※※※※※ 　面向场中左←【D1MTSTD2】【H1D3】【H2D4】→右
/p 　　 MT　　ST　　　 　 　　　　▼ 南8塔
/p 　　 D1　　D2　　　　　　　　H1　MT　H2
/p 分摊：D诱导　　　　　  　D3　D1　 ST　 D2 　D4
/p ■小怪阶段（击杀顺序：马＞猫＞鱼＞松鼠＞羊）
/p wave1：MT松鼠　ST羊  近战羊→松鼠　远程羊→猫　远程奶妈羊脚下集合
/p wave2：D3引导D鱼　H2引导B鱼　北侧放水圈　MT拉松鼠到东→西鱼　其他DPS群攻
/p wave3：MT松鼠跟着马移动(眩晕：MT→D1→D2)　ST羊B点待机　点名奶妈东南
/p wave4：MT松鼠C　ST羊A(眩晕马：ST→MT→D1)　点名奶妈东南
/p D3拉D鱼　D4拉B鱼 北侧放水圈　MT拉松鼠到东鱼 ST拉羊到西鱼/p         D1    MT    ST`},{Name:`Game8`,Text:`/p ■基本散開:ねばねば(北基準、Tボス下)■カラークラッシュ（2:2:2:2）
/p 　 D3 D4　 　 | 　 　 　　　ボス
/p H1　☆　H2　| 　H1D3　MTD1　STD2
/p 　 D1 D2 　 　|　　　　　 H2D4　4:4は←MT組ST組→
/p ■砂漠フェーズ
/p ▼サボテン避け(北) 　　 ▼サボテン+流砂(北基準)
/p 　　　6人 　　　　｜　北西H1　北東6人
/p 　T　 　　　 D　　｜　予備　 　 南東H2
/p ■爆弾捨て(流砂北)
/p H1/D3 MT/D1 ST/D2 H2/D4 /p ■雑魚フェーズ（倒す順：ジャバ＞キャット＞フェザー＞ムー＞ヤーン）※リキャバースト
/p wave1：MTムー　ST＋近接ヤーン（リキャバーストで処理）　遠隔キャット　ヤーンの場所に遠隔ヒラ集合
/p wave2：D側フェザーD3　B側フェザーH2　北から捨てる　MTムーを東→西フェザーへ誘導　他全員で範囲焼き
/p wave3：ジャバ＋ムー行進(スタン：MT→D1→D2)　STヤーン北東待機　バインドヒラ南東
/p wave4：MTムーC　STヤーンA(スタン：ST→D1→D2)　D側フェザーD3　B側フェザーD4 南側から捨てる　MTムーを東→西フェザーへ誘導
/p ■山川　　　　　　　 　 ■雷雲
/p 火：内側MTH1D1D2　　 　 　雷雲見て
/p 　　外側STH2D3D4　　TH←左　他　右→DPS
/p 雷：基本散会
/p ■マグマ　　　　　 　 　 ■塔2回目
/p H1D3　北　D4H2　 　4・2・2の場合：近接4人基準時計or反時計
/p ※※※※※※※※※※ 　中央見て左←【D1MTSTD2】【D3H1】【D4H2】→右
/p 　　 MT　　ST　　　 　 　　　　▼南8塔の場合
/p 　　 D1　　D2　　　　　　　　H2　D3　D4
/p 頭割り：H誘導　　　　　　H1　D1　 MT　 ST 　D2`},{Name:H(`纸Sama P4雷分散标点`,`https://www.bilibili.com/video/BV1PdKszCEUJ/`),Place:{A:{X:100,Z:87,Y:0,Active:!0},B:{X:113,Z:100,Y:0,Active:!0},C:{X:100,Z:113,Y:0,Active:!0},D:{X:87,Z:100,Y:0,Active:!0},One:{X:87,Z:87,Y:0,Active:!0},Two:{X:113,Z:87,Y:0,Active:!0},Three:{X:113,Z:113,Y:0,Active:!0},Four:{X:87,Z:113,Y:0,Active:!0}}},{Name:H(`XivStrat M6S`,`https://xivstrat.com/07/m6s`),Place:{A:{X:100,Z:90,Y:0,Active:!0},B:{X:110,Z:100,Y:0,Active:!0},C:{X:100,Z:110,Y:0,Active:!0},D:{X:90,Z:100,Y:0,Active:!0},One:{X:90,Z:90,Y:0,Active:!0},Two:{X:110,Z:90,Y:0,Active:!0},Three:{X:110,Z:110,Y:0,Active:!0},Four:{X:90,Z:110,Y:0,Active:!0}}},{Name:`Standard`,Place:{A:{X:100,Y:0,Z:92,ID:0,Active:!0},B:{X:108,Y:0,Z:100,ID:1,Active:!0},C:{X:100,Y:0,Z:108,ID:2,Active:!0},D:{X:92,Y:0,Z:100,ID:3,Active:!0},One:{X:92,Y:0,Z:92,ID:4,Active:!0},Two:{X:108,Y:0,Z:92,ID:5,Active:!0},Three:{X:108,Y:0,Z:108,ID:6,Active:!0},Four:{X:92,Y:0,Z:108,ID:7,Active:!0}}}],1261:[{Name:`Game8(4.17)`,Text:`/p 【スキャッターシード1回目】
/p 【種】D3/MT　　 ST/D4　 |【エラプ】近接:南内側開始→上→中央→下
/p 　　 　　　　　★ 　　 　 　 | 遠隔:D北H南開始→東西→最後中央寄せ
/p 　　　H1/D1　　 D2/H2　|(頭割り)MT組:西 ST組:東
/p 【ブルートグラワー】　→　D1　★　D2
/p ーーーーーーーーーーー 　 MT　　　ST
/p 【ソーンスマッシュ】　　|　H1　 　　H2
/p ボス向き基準基本散開　 |　D3　 　　D4
/p 【ソーンデスマッチ・ビルディング さり式】 茨:東西D3南:D4
/p ①　　★　　②　　　　　③　(種捨て)
/p 　　　安　　　　安　　　　　D1D2:奇①偶a
/p 　a　　　 b 　 　　　　 c　　 TH:奇②偶b
/p 　d←D3偶数安置　　 　　 　 D3:奇③偶c/奇④偶a
/p 　　　　　　　　　 e　　　　D4:奇⑤偶e
/p ④　　　　　⑤　　　　　　　(頭割り)MTD1①/STD2②/D3H1③か④/D4H2⑤
/p 【ソーンデスマッチ・ウォール】
/p 　　　 MT/D3　　　　※石化視線：北西/南東避け
/p 　　　　　　　　　　　 雑魚石化後処理
/p H1/D1　★　H2/D2
/p 　　　　
/p 　 　 　ST/D4
/p 【スキャッターシード二回目】※近接北西集合
/p 近接AOE:北西から時計周り→南西安置 (遠隔)シード十字捨て 南側外周避け
/p 遠隔AOE:最外周捨て→中央安置 (近接)シード十字内側捨て(外から2マス) 中央避け
/p 【ウェポンツイン+ブロウシード】※一回目マップ北基準 二回目ラリアット後のボス北基準
/p (一回目) 　 　　　　　｜(二回目)　 ★
/p MT/D3 　　ST/D4　 ｜　MT/D1　 　ST/D2
/p 　 　　　★ 　 　 　　 ｜
/p H1/D1 　　H2/D2　｜　H1/D3　 　H2/D4`},{Name:`nukemaru`,Place:{A:{X:100,Y:-200,Z:-5,ID:0,Active:!0},B:{X:103.5,Y:0,Z:1.6,ID:1,Active:!0},C:{X:100,Y:-200,Z:15,ID:2,Active:!0},D:{X:96.5,Y:0,Z:8.4,ID:3,Active:!0},One:{X:90,Y:-200,Z:-5,ID:4,Active:!0},Two:{X:110,Y:-200,Z:-5,ID:5,Active:!0},Three:{X:110,Y:-200,Z:15,ID:6,Active:!0},Four:{X:90,Y:-200,Z:15,ID:7,Active:!0}}},{Name:`P1数字+P3字母`,Place:{A:{X:90,Y:-200,Z:-5,ID:0,Active:!0},B:{X:110,Y:-200,Z:-5,ID:1,Active:!0},C:{X:110,Y:-200,Z:15,ID:2,Active:!0},D:{X:90,Y:-200,Z:15,ID:3,Active:!0},One:{X:91,Y:0,Z:91,ID:4,Active:!0},Two:{X:109,Y:0,Z:91,ID:5,Active:!0},Three:{X:109,Y:0,Z:109,ID:6,Active:!0},Four:{X:91,Y:0,Z:109,ID:7,Active:!0}}},{Name:`P3`,Place:{A:{X:100,Y:-200,Z:-5,ID:0,Active:!0},B:{X:110,Y:-200,Z:5,ID:1,Active:!0},C:{X:100,Y:-200,Z:15,ID:2,Active:!0},D:{X:90,Y:-200,Z:5,ID:3,Active:!0},One:{X:90,Y:-200,Z:-5,ID:4,Active:!0},Two:{X:110,Y:-200,Z:-5,ID:5,Active:!0},Three:{X:110,Y:-200,Z:15,ID:6,Active:!0},Four:{X:90,Y:-200,Z:15,ID:7,Active:!0}}}],1263:[{Name:H(`XivStrat M8S`,`https://xivstrat.com/07/m8s`),Place:{A:{X:100,Z:91.5,Y:0,Active:!0},B:{X:108.5,Z:100,Y:0,Active:!0},C:{X:100,Z:108.5,Y:0,Active:!0},D:{X:91.5,Z:100,Y:0,Active:!0},One:{X:94,Z:94,Y:0,Active:!0},Two:{X:106,Z:94,Y:0,Active:!0},Three:{X:106,Z:106,Y:0,Active:!0},Four:{X:94,Z:106,Y:0,Active:!0}}},{Name:H(`XivStrat改本体C`,`https://nga.178.com/read.php?tid=44529364`),Place:{A:{X:100,Y:0,Z:91.5,ID:0,Active:!0},B:{X:108.5,Y:0,Z:100,ID:1,Active:!0},C:{X:100,Y:-150,Z:118,ID:2,Active:!0},D:{X:91.5,Y:0,Z:100,ID:3,Active:!0},One:{X:94,Y:0,Z:94,ID:4,Active:!0},Two:{X:106,Y:0,Z:94,ID:5,Active:!0},Three:{X:106,Y:0,Z:106,ID:6,Active:!0},Four:{X:94,Y:0,Z:106,ID:7,Active:!0}}},{Name:`M8S Aligned with Phase 2 C`,Place:{A:{X:100,Y:0,Z:88,ID:0,Active:!0},B:{X:112,Y:0,Z:100,ID:1,Active:!0},C:{X:100,Y:-150,Z:118,ID:2,Active:!0},D:{X:88,Y:0,Z:100,ID:3,Active:!0},One:{X:91.51472,Y:0,Z:91.51472,ID:4,Active:!0},Two:{X:108.48528,Y:0,Z:91.51472,ID:5,Active:!0},Three:{X:108.48528,Y:0,Z:108.48528,ID:6,Active:!0},Four:{X:91.51472,Y:0,Z:108.48528,ID:7,Active:!0}}},{Name:`Standard`,Place:{A:{X:100,Y:0,Z:89.331,ID:0,Active:!0},B:{X:110.796,Y:0,Z:100,ID:1,Active:!0},C:{X:100,Y:0,Z:110.996,ID:2,Active:!0},D:{X:88.61,Y:0,Z:100,ID:3,Active:!0},One:{X:92,Y:0,Z:92,ID:4,Active:!0},Two:{X:108,Y:0,Z:92,ID:5,Active:!0},Three:{X:108,Y:0,Z:108,ID:6,Active:!0},Four:{X:92,Y:0,Z:108,ID:7,Active:!0}}}],1271:[{Name:`Game8`,Text:`/p 【塔踏み 】 　 　 |【クライムクロス】
/p D3MT　 D4ST 　| 　 MT 　ST 　※基本THタゲサ内開始
/p 　　　　　　　 　| H1　 　　 H2
/p D1H1　 D2H2 　| D3　　 　 D4
/p 　　　　　　　 　| 　 D1　 D2
/p 【雑魚フェーズ】→西TH　東DPS
/p 【魔法陣展開：三式】くらぽん式
/p 【魔法陣展開：四式】
/p 薔薇床設置　　　茨頭割り：南集合→西TH　東DPS
/p 　　 中央 　　 ※頭割り時薔薇床踏む
/p D1MT　 D2ST
/p D3H1　 D4H2`}],1296:[{Name:`Game8`,Text:`/p 基本散開/ペア　 　 ┃ メメント・モリ+闇の一撃
/p MT D1 D2 ST　 　┃ 　 白　　│ 　 黒
/p H1 D3 D4 H2　　┃ D1　D2 │MT　ST
/p ※グランドクロス　 ┃ H1　H2 │
/p 時計ずれ 　　　 　 ┃ D3　D4 │
/p ------------------------------------------------------------------
/p 集団恐慌 　　　│ D1+D2：①→④→⑦→⑨
/p 　⑨　　　⑦　 │ D3+D4：②→③→⑧→⑩
/p ③　　①　　④ │ H1：②→⑤→⑧→⑩
/p ⑤　　②　　⑥ │ H2：②→⑥→⑦→⑨
/p 　⑧　　　⑩ 　│ MT：①→⑤→強攻撃
/p 　　　　　　　 │ ST：①→⑥→強攻撃`}],1306:[{Name:H(`子言`,`https://www.bilibili.com/video/BV15S1qBCEwn`),Text:`/p ■分摊(冲锋后以BOSS为北基准)
/p 　北MTH1D1D2　南STH2D3D4 ※冲锋前在面朝BOSS左侧集合
/p ■踩塔
/p 　D3 MT D4　
/p 　MT　　ST 　
/p 　D1 ST  D2 　
/p ■锁刃跃动
/p 　右手高(逆时针) 　 左手高(顺时针)
/p 　 　 　 ４　　 　　　　　４
/p 　　　　↑　 　 　 　 　　↑
/p 　１←　他　→３ 　３←　他　→１
/p 　　　　↓　　　　　　　↓
/p 　　　　２　　　　　　　 ２
/p （1/5、2/6、3/7、4/8互换位置）
/p ■龙闪炮引导：东 → 西 → 东`},{Name:`Clocks`,Place:{A:{X:100,Y:0,Z:82,ID:0,Active:!0},B:{X:118,Y:0,Z:100,ID:1,Active:!0},C:{X:100,Y:0,Z:118,ID:2,Active:!0},D:{X:82,Y:0,Z:100,ID:3,Active:!0},One:{X:87,Y:0,Z:87,ID:4,Active:!0},Two:{X:113,Y:0,Z:87,ID:5,Active:!0},Three:{X:113,Y:0,Z:113,ID:6,Active:!0},Four:{X:87,Y:0,Z:113,ID:7,Active:!0}}},{Name:H(`Game8`,`https://game8.jp/ff14/727152`),Text:`
/p ■頭割り (突進後ボス基準)
/p 　北MTH1D1D2　南STH2D3D4 ※突進前ボス見て左側に寄る
/p ■塔 (タンク以外マップ基準)
/p 　D3 MT D4　 T：MT北/西　ST南/東
/p 　MT　　ST 　 D：基本散開か基本散開から時計回り
/p 　D1 ST D2 　 H：Dのフォロー
/p ■サイコロ
/p 　右手引き(反時計)　左手引き(時計)
/p 　 　 　 ４　　 　　　　　４
/p 　　　　↑　 　 　 　 　　↑
/p 　１←　他　→３ 　３←　他　→１
/p 　　　　↓　　　　　　　↓
/p 　　　　２　　　　　　　 ２
/p （1/5、2/6、3/7、4/8受けたら交代）
/p ■ビーム捨て：東 → 西 → 東`}]}};U(`{"Name":"Standard","MapID":1010,"A":{"X":70.0,"Y":0.0,"Z":100.0,"ID":0,"Active":true},"B":{"X":100.0,"Y":0.0,"Z":81.0,"ID":1,"Active":true},"C":{"X":130.0,"Y":0.0,"Z":100.0,"ID":2,"Active":true},"D":{"X":0.0,"Y":0.0,"Z":0.0,"ID":3,"Active":false},"One":{"X":85.0,"Y":0.0,"Z":85.0,"ID":4,"Active":true},"Two":{"X":115.0,"Y":0.0,"Z":85.0,"ID":5,"Active":true},"Three":{"X":115.0,"Y":0.0,"Z":115.0,"ID":6,"Active":true},"Four":{"X":89.0,"Y":0.0,"Z":115.0,"ID":7,"Active":true}}
  `),U(`{"Name":"Briars","MapID":1010,"A":{"X":70.0,"Y":0.0,"Z":92.0,"ID":0,"Active":true},"B":{"X":130.0,"Y":0.0,"Z":92.0,"ID":1,"Active":true},"C":{"X":130.0,"Y":0.0,"Z":108.0,"ID":2,"Active":true},"D":{"X":70.0,"Y":0.0,"Z":107.0,"ID":3,"Active":true},"One":{"X":87.0,"Y":0.0,"Z":96.0,"ID":4,"Active":true},"Two":{"X":113.0,"Y":0.0,"Z":96.0,"ID":5,"Active":true},"Three":{"X":113.0,"Y":0.0,"Z":104.0,"ID":6,"Active":true},"Four":{"X":87.0,"Y":0.0,"Z":104.0,"ID":7,"Active":true}}
  `),U(`{"Name":"Clockspots","MapID":1062,"A":{"X":100.0,"Y":0.0,"Z":91.0,"ID":0,"Active":true},"B":{"X":109.0,"Y":0.0,"Z":100.0,"ID":1,"Active":true},"C":{"X":100.0,"Y":0.0,"Z":109.0,"ID":2,"Active":true},"D":{"X":91.0,"Y":0.0,"Z":100.0,"ID":3,"Active":true},"One":{"X":93.64,"Y":0.0,"Z":93.64,"ID":7,"Active":true},"Two":{"X":106.36,"Y":0.0,"Z":93.64,"ID":4,"Active":true},"Three":{"X":106.36,"Y":0.0,"Z":106.36,"ID":5,"Active":true},"Four":{"X":93.64,"Y":0.0,"Z":106.36,"ID":6,"Active":true}}
`),U(`{"Name":"Edges","MapID":1062,"A":{"X":100.0,"Y":0.0,"Z":91.0,"ID":0,"Active":true},"B":{"X":109.0,"Y":0.0,"Z":100.0,"ID":1,"Active":true},"C":{"X":100.0,"Y":0.0,"Z":109.0,"ID":2,"Active":true},"D":{"X":91.0,"Y":0.0,"Z":100.0,"ID":3,"Active":true},"One":{"X":95.0,"Y":0.0,"Z":86.5,"ID":4,"Active":true},"Two":{"X":105.0,"Y":0.0,"Z":86.5,"ID":5,"Active":true},"Three":{"X":105.0,"Y":0.0,"Z":106.0,"ID":6,"Active":true},"Four":{"X":95.0,"Y":0.0,"Z":106.0,"ID":7,"Active":true}}
`),U(`{"Name":"JP","MapID":1062,"A":{"X":100.0,"Y":0.0,"Z":92.0,"ID":0,"Active":true},"B":{"X":108.0,"Y":0.0,"Z":100.0,"ID":1,"Active":true},"C":{"X":100.0,"Y":0.0,"Z":108.0,"ID":2,"Active":true},"D":{"X":92.0,"Y":0.0,"Z":100.0,"ID":3,"Active":true},"One":{"X":95.0,"Y":0.0,"Z":86.5,"ID":4,"Active":true},"Two":{"X":105.0,"Y":0.0,"Z":86.5,"ID":5,"Active":true},"Three":{"X":103.0,"Y":0.0,"Z":92.0,"ID":6,"Active":true},"Four":{"X":97.0,"Y":0.0,"Z":92.0,"ID":7,"Active":true}}
`),U(`{"Name":"Four Seasons","MapID":1062,"A":{"X":83.25,"Y":0.0,"Z":92.0,"ID":0,"Active":true},"B":{"X":116.75,"Y":0.0,"Z":92.0,"ID":1,"Active":true},"C":{"X":108.0,"Y":0.0,"Z":98.0,"ID":2,"Active":true},"D":{"X":92.0,"Y":0.0,"Z":98.0,"ID":3,"Active":true},"One":{"X":95.0,"Y":0.0,"Z":86.0,"ID":4,"Active":true},"Two":{"X":105.0,"Y":0.0,"Z":86.0,"ID":5,"Active":true},"Three":{"X":102.2,"Y":0.0,"Z":92.667,"ID":6,"Active":true},"Four":{"X":97.8,"Y":0.0,"Z":92.674,"ID":7,"Active":true}}
`),U(`{"Name":"自用","MapID":1063,"A":{"X":-618,"Z":-314,"Y":0,"Active":true},"B":{"X":-610,"Z":-302,"Y":0,"Active":true},"C":{"X":-590,"Z":-293,"Y":0,"Active":true},"D":{"X":-581,"Z":-286,"Y":0,"Active":true},"One":{"X":-606,"Z":-314,"Y":0,"Active":true},"Two":{"X":-594,"Z":-314,"Y":0,"Active":true},"Three":{"X":-594,"Z":-286,"Y":0,"Active":true},"Four":{"X":-606,"Z":-286,"Y":0,"Active":true}}`),U(`{"Name":"M9S","MapID":1069,"A":{"X":100,"Z":90,"Y":0,"Active":true},"B":{"X":110,"Z":100,"Y":0,"Active":true},"C":{"X":100,"Z":110,"Y":0,"Active":true},"D":{"X":90,"Z":100,"Y":0,"Active":true},"One":{"X":90,"Z":90,"Y":0,"Active":true},"Two":{"X":110,"Z":90,"Y":0,"Active":true},"Three":{"X":110,"Z":110,"Y":0,"Active":true},"Four":{"X":90,"Z":110,"Y":0,"Active":true}}`),U(`{"Name":"M10S","MapID":1071,"A":{"X":100,"Z":87,"Y":0,"Active":true},"B":{"X":113,"Z":100,"Y":0,"Active":true},"C":{"X":100,"Z":113,"Y":0,"Active":true},"D":{"X":87,"Z":100,"Y":0,"Active":true},"One":{"X":87,"Z":87,"Y":0,"Active":true},"Two":{"X":113,"Z":87,"Y":0,"Active":true},"Three":{"X":113,"Z":113,"Y":0,"Active":true},"Four":{"X":87,"Z":113,"Y":0,"Active":true}}`),U(`{"Name":"NO CCHH","MapID":1073,"A":{"X":100.0,"Y":0.0,"Z":90.0,"ID":0,"Active":true},"B":{"X":110.0,"Y":0.0,"Z":100.0,"ID":1,"Active":true},"C":{"X":100.0,"Y":0.0,"Z":110.0,"ID":2,"Active":true},"D":{"X":90.0,"Y":0.0,"Z":100.0,"ID":3,"Active":true},"One":{"X":114.0,"Y":0.0,"Z":86.0,"ID":4,"Active":true},"Two":{"X":114.0,"Y":0.0,"Z":114.0,"ID":5,"Active":true},"Three":{"X":86.0,"Y":0.0,"Z":114.0,"ID":6,"Active":true},"Four":{"X":86.0,"Y":0.0,"Z":86.0,"ID":7,"Active":true}}`),U(`{"Name":"孤剑式","MapID":1073,"A":{"X":100,"Z":88.5,"Y":0,"Active":true},"B":{"X":115,"Z":100,"Y":0,"Active":true},"C":{"X":100,"Z":111,"Y":0,"Active":true},"D":{"X":85,"Z":100,"Y":0,"Active":true},"One":{"X":85,"Z":88.5,"Y":0,"Active":true},"Two":{"X":115,"Z":88.5,"Y":0,"Active":true},"Three":{"X":115,"Z":111,"Y":0,"Active":true},"Four":{"X":85,"Z":111,"Y":0,"Active":true}}`),U(`{"Name":"L改","MapID":1073,"A":{"X":100,"Z":90,"Y":0,"Active":true},"B":{"X":110,"Z":100,"Y":0,"Active":true},"C":{"X":100,"Z":110,"Y":0,"Active":true},"D":{"X":90,"Z":99.9,"Y":0,"Active":true},"One":{"X":83.9,"Z":88.5,"Y":0,"Active":true},"Two":{"X":116,"Z":88.9,"Y":0,"Active":true},"Three":{"X":116,"Z":111,"Y":0,"Active":true},"Four":{"X":83.8,"Z":111,"Y":0,"Active":true}}`),U(`{"Name":"CAD-L改${H(`@御琪幽然`,`https://www.bilibili.com/video/BV1EEzJBJERV`)}","MapID":1073,"A":{"X":100,"Y":0,"Z":90,"Active":true},"B":{"X":110,"Y":0,"Z":100,"Active":true},"C":{"X":100,"Y":0,"Z":110,"Active":true},"D":{"X":90,"Y":0,"Z":100,"Active":true},"One":{"X":84,"Y":0,"Z":88.19999694824219,"Active":true},"Two":{"X":116,"Y":0,"Z":88.19999694824219,"Active":true},"Three":{"X":116,"Y":0,"Z":111.80000305175781,"Active":true},"Four":{"X":84,"Y":0,"Z":111.80000305175781,"Active":true}}`),U(`{"Name":"门神一字长蛇","MapID":1075,"A":{"X":107.485,"Y":0.0,"Z":93.071,"ID":0,"Active":true},"B":{"X":111.367,"Y":0.0,"Z":99.774,"ID":1,"Active":true},"C":{"X":115.169,"Y":0.0,"Z":106.315,"ID":2,"Active":true},"D":{"X":119.314,"Y":0.0,"Z":112.643,"ID":3,"Active":true},"One":{"X":92.114,"Y":0.0,"Z":93.394,"ID":4,"Active":true},"Two":{"X":88.576,"Y":0.0,"Z":100.088,"ID":5,"Active":true},"Three":{"X":85.1,"Y":0.0,"Z":106.139,"ID":6,"Active":true},"Four":{"X":81.158,"Y":0.0,"Z":112.629,"ID":7,"Active":true}}`),U(`{"Name":"本体4A1","MapID":1075,"A":{"X":100.081,"Y":0.0,"Z":89.082,"ID":0,"Active":true},"B":{"X":110.969,"Y":0.0,"Z":100.16,"ID":1,"Active":true},"C":{"X":100.054,"Y":0.0,"Z":111.093,"ID":2,"Active":true},"D":{"X":89.13,"Y":0.0,"Z":100.063,"ID":3,"Active":true},"One":{"X":108.214,"Y":0.0,"Z":91.863,"ID":4,"Active":true},"Two":{"X":108.158,"Y":0.0,"Z":108.268,"ID":5,"Active":true},"Three":{"X":92.061,"Y":0.0,"Z":108.121,"ID":6,"Active":true},"Four":{"X":91.964,"Y":0.0,"Z":91.948,"ID":7,"Active":true}}`),U(`{"Name":"人鱼达莉娅","MapID":1079,"A":{"X":375,"Y":-29.5,"Z":514,"Active":true},"B":{"X":391,"Y":-29.5,"Z":530,"Active":true},"C":{"X":375,"Y":-29.5,"Z":546,"Active":true},"D":{"X":359,"Y":-29.5,"Z":530,"Active":true},"One":{"X":383,"Y":-29.5,"Z":522,"Active":true},"Two":{"X":383,"Y":-29.5,"Z":538,"Active":true},"Three":{"X":367,"Y":-29.5,"Z":538,"Active":true},"Four":{"X":367,"Y":-29.5,"Z":522,"Active":true}}`),U(`{"Name":"剑术大师","MapID":1079,"A":{"X":170,"Y":-16,"Z":-832.5,"Active":true},"B":{"X":188,"Y":-16,"Z":-815,"Active":true},"C":{"X":170,"Y":-16,"Z":-797.5,"Active":true},"D":{"X":151.995,"Y":-16,"Z":-815,"Active":true},"One":{"X":170,"Y":-15.999,"Z":-815,"Active":true},"Two":{"X":165,"Y":-16,"Z":-820,"Active":true},"Three":{"X":175,"Y":-15.999,"Z":-810,"Active":true},"Four":{"X":0,"Y":0,"Z":0,"Active":false}}`),U(`{"Name":"火仙女佩莉","MapID":1079,"A":{"X":-760,"Z":-815,"Y":-54,"Active":true},"B":{"X":-750,"Z":-805,"Y":-54,"Active":true},"C":{"X":-760,"Z":-795,"Y":-54,"Active":true},"D":{"X":-770,"Z":-805,"Y":-54,"Active":true},"One":{"X":-770,"Z":-815,"Y":-54,"Active":true},"Two":{"X":-750,"Z":-815,"Y":-54,"Active":true},"Three":{"X":-750,"Z":-795,"Y":-54,"Active":true},"Four":{"X":-770,"Z":-795,"Y":-54,"Active":true}}`);function H(e,t){return`<a href='${t}'target='_blank'>${e}</a>`}function U(e){let t=JSON.parse(e);if(!t.MapID)throw Error(`PPJSON 不存在 MapID`);let n={X:0,Y:0,Z:0,Active:!1},r=F(t.MapID);if(r===0){console.error(t.MapID,`无法获取地图ID`,r);return}V.zoneId[r]===void 0&&(V.zoneId[r]=[]),V.zoneId[r].push({Name:t.Name??`Imported`,Place:{A:t.A??n,B:t.B??n,C:t.C??n,D:t.D??n,One:t.One??n,Two:t.Two??n,Three:t.Three??n,Four:t.Four??n}})}Object.entries({1076:`1075`,1156:`1155`,1180:`1179`,1317:`1316`}).forEach(([e,t])=>{V.zoneId[e]=[...(V.zoneId[e]??[]).filter(e=>`Text`in e),...(V.zoneId[t]??[]).filter(e=>`Text`in e).map(e=>({...e,Name:e.Name.replace(`异闻`,`零式`)})),...(V.zoneId[e]??[]).filter(e=>`Place`in e),...(V.zoneId[t]??[]).filter(e=>`Place`in e).map(e=>({...e,Name:e.Name.replace(`异闻`,`零式`)}))]});var W=0,G=w(`macro-slot-index`,5);Ne(`PartyChanged`,e=>{W=e.party.length});var[K,q]=re(!0);function J(e){try{return JSON.parse(e)}catch{try{let t=e.replace(/,(\s*[}\]])/g,`$1`);return JSON.parse(t)}catch{throw Error(`无法解析 JSON 数据`)}}}function Y(e){let t=e;return t=t.replaceAll(/\n{2,}/g,`
`),t=t.replaceAll(/^\s+/gm,``),t=t.replaceAll(/ /g,`\xA0`),t}function X(e,t){let n=t instanceof Error?t.message:``;return n?`${e}: ${n}`:`${e}: 未知错误`}async function Z(e,t){t===`p`&&W===0&&R(`/e 单人时无法发送小队宏<se.3>`);let n=e.replaceAll(/^\s*\/[pe]\s/gm,``).split(`
`).map(e=>({c:`DoTextCommand`,p:`/${t} ${e}`,d:125}));try{await L(n),_.success(`已发送`)}catch(e){_.error(X(`发送失败`,e))}}var Be=ee(`macro`,{state:()=>({data:w(`my-macros`,V),selectZone:w(`my-zone`,`1226`),zoneNow:w(`my-zone-now`,`1226`),zoneNowName:w(`my-zone-now-name`,``),fastEntrance:[{text:{zhCn:`异闻商客`},value:`1317`},{text:{zhCn:`M9S`},value:`1321`},{text:{zhCn:`M10S`},value:`1323`},{text:{zhCn:`M11S`},value:`1325`},{text:{zhCn:`M12S`},value:`1327`}],show:K,toggleShow:q}),getters:{defaultX:e=>N[Number(e.selectZone)]?.offsetX??0,defaultY:e=>N[Number(e.selectZone)]?.offsetY??0,blankWaymark:e=>{let t=N[Number(e.selectZone)]?.offsetX??0,n=N[Number(e.selectZone)]?.offsetY??0;return{A:{X:-t,Y:0,Z:-n,Active:!1},B:{X:-t,Y:0,Z:-n,Active:!1},C:{X:-t,Y:0,Z:-n,Active:!1},D:{X:-t,Y:0,Z:-n,Active:!1},One:{X:-t,Y:0,Z:-n,Active:!1},Two:{X:-t,Y:0,Z:-n,Active:!1},Three:{X:-t,Y:0,Z:-n,Active:!1},Four:{X:-t,Y:0,Z:-n,Active:!1}}}},actions:{editMacroMacro(e){e.Editable=!0,e.Text=Y(e.Text)},submitMacroMacro(e){Reflect.deleteProperty(e,`Editable`),e.Text=Y(e.Text)},editMacroPlace(e){e.Editable=!0},submitMacroPlace(e){Reflect.deleteProperty(e,`Editable`)},newMacro(e){let t=Number(this.selectZone);this.data.zoneId[t]===void 0&&(this.data.zoneId[t]=[]),this.data.zoneId[t]&&this.data.zoneId[t].push({Name:`New Macro`,Text:e??``,Editable:!0,Deletability:!0})},newPlace(e){let t=Number(this.selectZone);if(e?.MapID){let n=F(e.MapID);n&&!Number.isNaN(n)&&(t=n)}this.data.zoneId[t]===void 0&&(this.data.zoneId[t]=[]),this.data.zoneId[t]&&this.data.zoneId[t].push({Name:e?.Name??`New WayMark`,Editable:e?.Editable??!0,Deletability:!0,Place:structuredClone(Object.assign(this.blankWaymark,e))})},importPPJSON(){s.prompt(`输入PPJSON`,`Import PPJSON`,{confirmButtonText:`确定`,cancelButtonText:`取消`,inputPattern:/^(\{.*\})$/,inputErrorMessage:`无效的格式`}).then(e=>{let{value:t}=e,n=Object.assign(this.blankWaymark,J(t));this.newPlace(n),_.success(`导入成功`)}).catch(()=>{})},deleteMacro(e){if(`Text`in e&&(e?.Text??``).length<=5||`Place`in e&&e.Place.A.Active===!1&&e.Place.B.Active===!1&&e.Place.C.Active===!1&&e.Place.D.Active===!1&&e.Place.One.Active===!1&&e.Place.Two.Active===!1&&e.Place.Three.Active===!1&&e.Place.Four.Active===!1){let t=this.data.zoneId[this.selectZone].indexOf(e);t>-1&&this.data.zoneId[this.selectZone].splice(t,1)}else s.confirm(`确定要删除吗?`,`警告`,{confirmButtonText:`确定`,cancelButtonText:`取消`,type:`warning`}).then(()=>{let t=this.data.zoneId[this.selectZone].indexOf(e);t>-1&&this.data.zoneId[this.selectZone].splice(t,1)}).catch(()=>{})},exportWaymarksJson(e){let t=JSON.parse(JSON.stringify(e.Place));t.MapID=Ie(Number(this.selectZone)),t.Name=e.Name,P(JSON.stringify({Name:t.Name,MapID:t.MapID,A:t.A,B:t.B,C:t.C,D:t.D,One:t.One,Two:t.Two,Three:t.Three,Four:t.Four})),_.success(`已复制到剪贴板`)},sendMacroParty(e){s.confirm(`确定要发送到队伍频道吗?`,`警告`,{confirmButtonText:`确定`,cancelButtonText:`取消`,type:`warning`}).then(()=>{Z(e,`p`)}).catch(()=>{})},sendMacroEcho(e){Z(e,`e`)},async doLocalWayMark(e,t=!1){try{await I(e,!0,t),t||_.success(`已尝试本地标点`)}catch(e){t||_.error(X(`本地标点失败`,e))}},async doPartyWayMark(e){try{await I(e,!1),_.success(`已尝试公开标点`)}catch(e){_.error(X(`公开标点失败`,e))}},doSlotWayMark(e){s({title:`选择插槽`,message:()=>D(T,{modelValue:G.value,min:1,max:30,size:`large`,"onUpdate:modelValue":e=>{typeof e==`number`&&(G.value=e)}}),showCancelButton:!0,confirmButtonText:`确定`,cancelButtonText:`取消`}).then(async()=>{try{await z(Number(this.selectZone),e,G.value),_.success(`已尝试写入至插槽${G.value}`)}catch(e){_.error(X(`写入插槽失败`,e))}}).catch(()=>{})},positioning(){this.selectZone=this.data.zoneId[Number(this.zoneNow)]?this.zoneNow:`-1`},handleChangeZone(e){this.zoneNow=e.zoneID.toString(),this.zoneNowName=e.zoneName,this.positioning()},resetZone(){s.confirm(`确定要重置当前地图的所有标点吗？`,`提示`,{confirmButtonText:`确定`,cancelButtonText:`取消`,type:`warning`}).then(()=>{this.data.zoneId[this.selectZone].length=0,this.data.zoneId[this.selectZone].push(...JSON.parse(JSON.stringify(V.zoneId[this.selectZone]))),_.success(`重置成功`)}).catch(()=>{})},resetAllData(){s.confirm(`要重置所有数据吗？`,`提示`,{confirmButtonText:`确定`,cancelButtonText:`取消`,type:`warning`}).then(()=>{s.confirm(`你确定吗？`,`警告`,{confirmButtonText:`确定！`,cancelButtonText:`取消`,type:`warning`}).then(()=>{this.data=JSON.parse(JSON.stringify(V)),_.success(`重置成功`)})}).catch(()=>{})}}}),Ve=b({__name:`MarksDiv`,props:{macro:{type:Object,required:!0},size:{type:Number,default:180}},setup(e){let t=e,n=Be(),r=[`A`,`B`,`C`,`D`,`1`,`2`,`3`,`4`],i=o(()=>{if(!t.macro?.Place)return[];let e=t.macro.Place;return Object.keys(e).map((t,n)=>{let i=e[t];return{key:t,label:r[n]??t,x:Number(i.X),z:Number(i.Z),active:i.Active}})});return(t,r)=>(x(),O(B,{"map-id":Number(l(n).selectZone),"force-territory-type":Number(l(n).selectZone),markers:i.value,size:e.size},null,8,[`map-id`,`force-territory-type`,`markers`,`size`]))}}),He={class:`header-row`},Ue={class:`fast-entrance-group`},We={class:`header-row`},Ge={class:`badge-group`},Ke={key:0,class:`subtle-badge from-user`},qe={key:1,class:`subtle-badge from-native`},Je=[`innerHTML`],Ye={key:0},Xe={key:0,class:`macro-content`},Ze={key:1},Qe={key:0,class:`duty-placeholder`},$e={key:1,class:`duty-placeholder`},et={key:2,class:`duty-placeholder`},tt={key:3,class:`duty-placeholder`},nt=[`innerHTML`],rt={class:`duty-card-footer`},it={style:{"margin-bottom":`10px`}},at={class:`dialog-footer`},ot=De(b({__name:`zoneMacro`,setup(s){let{t:ee}=a(),re=Ee(),b=Be(),D=o(()=>{let e=N[Number(b.selectZone)];if(!e)return!1;let t=Pe(e);return[`Dungeons`,`Trials`,`Raids`].includes(t)});w(`zoneMacroHideOnStartup`,p(!1)).value&&(b.show=!1),re.value||Me({allowClose:!0,addWsParam:!0});let De=o(()=>b.fastEntrance.map(e=>({text:Oe(e.text),value:e.value}))),P=p(null),L=p(null),R=p(!1),z=p(!0),B=p([]),H=w(`zoneMacroRealtimeLocalMode`,p(!1)),U=te(async e=>{if(H.value)try{await I(e,!0,!0)}catch{}},200),W=o(()=>Ie(Number(b.selectZone))),G=p(!1),K=p(``),q=p(`idle`),J=p(``),Y=w(`duty-best-proxy-index`,0),X=o(()=>W.value>0&&W.value!==Number(b.selectZone)?`https://ff14.org/duty/${W.value}.htm`:``),Z=je(`duty-cache`);function ot(e){if(!e)return``;let t=e.includes(`<!DOCTYPE`)||e.includes(`<html`),n=new DOMParser,r;if(t){let t=n.parseFromString(e,`text/html`).querySelector(`#root > div.main-container > div > div > main > div.content-container > article`);if(!t)return``;r=t}else{let t=document.createElement(`div`);t.innerHTML=e,r=t}return(r.innerHTML||``).replace(/<img[^>]*>/gi,``).replace(/>\s+/g,`>`).replace(/\s+</g,`<`).trim()}async function st(e=!1){if(!X.value)return;G.value=!0,q.value=`loading`,K.value=``,J.value=``;let t=X.value,n=Date.now();try{if(!e){let e=await Z.get(t);if(e&&e.expiry>n){K.value=e.content,q.value=e.content?`success`:`empty`,G.value=!1;return}}let r=X.value,i=``,a=!1,o=[e=>`https://corsproxy.io/?${encodeURIComponent(e)}`,e=>`https://api.allorigins.win/raw?url=${encodeURIComponent(e)}`,e=>`https://cors.lol/?url=${encodeURIComponent(e)}`,e=>`https://api.codetabs.com/v1/proxy?quest=${encodeURIComponent(e)}`],s=Y.value,c=Array.from({length:o.length},(e,t)=>t);s>0&&s<o.length&&(c.splice(s,1),c.unshift(s));for(let e of c){let t=o[e],n=t(r);try{console.log(`[Duty] Attempting proxy [${e}]: ${n}`);let t=await fetch(n,{cache:`no-cache`,referrerPolicy:`no-referrer`});if(t.ok){if(i=await t.text(),i){a=!0,Y.value=e;break}}else J.value=`Proxy[${e}] Error ${t.status}`}catch(t){J.value=`Proxy[${e}] ${t.message||`Failure`}`,console.warn(`[Duty] Proxy failed: ${n}`,t)}}a&&i?K.value=i:a||(q.value=`error`)}catch(e){console.error(`Load duty failed:`,e),q.value=`error`,J.value=e.message||`Unknown`}finally{G.value=!1}}j(X,async e=>{if(K.value=``,q.value=`idle`,J.value=``,!e)return;let t=await Z.get(e);t&&t.expiry>Date.now()&&(K.value=t.content,q.value=t.content?`success`:`empty`)},{immediate:!0}),j(K,async e=>{if(!e||q.value===`success`||q.value===`empty`)return;if(e.includes(`404 噗`)||e.includes(`Page Not Found`)){q.value=`empty`;return}let t=ot(e);if(t){q.value=`success`,K.value=t;let e=X.value,n=await Z.get(e);(!n||n.expiry<=Date.now()||n.content!==t)&&await Z.set({key:e,content:t,expiry:Date.now()+720*60*60*1e3})}else q.value=`empty`});let ct=o(()=>{if(!L.value)return[];let e=L.value.wayMarks.map((e,t)=>({mark:e,index:t})).filter(e=>e.mark.regionID!==0);return z.value&&(e=e.filter(e=>e.mark.regionID===W.value)),e});async function lt(e){let t=e.target,n=t.files?.[0];if(n)try{L.value=await Re(await n.arrayBuffer()),R.value=!0,z.value=!1}catch(e){_.error(`Parse failed: ${e}`)}finally{t.value=``}}function ut(e){B.value=e}function dt(){B.value.forEach(({mark:e})=>{let t={};ze.forEach(n=>{let r=e[n.key];r&&(t[n.key]={X:r.x/1e3,Y:r.y/1e3,Z:r.z/1e3,Active:(e.enableFlag&n.bit)>0})}),b.newPlace({...t,Name:`Imported ${new Date(e.timestamp*1e3).toLocaleString()}`,MapID:e.regionID,Editable:!1})}),R.value=!1,_.success(ee(`zoneMacro.importSelected`,[B.value.length]))}function Q(e){let t=F(e);if(!t)return`Unknown`;let n=N[t];return n?fe(n.name):`Unknown`}function ft(e,t){return Q(e.mark.regionID).localeCompare(Q(t.mark.regionID))}function $(e){!H.value||!e.Editable||U(e.Place)}return Ce(()=>{Ne(`ChangeZone`,b.handleChangeZone),j(ne(b,`selectZone`),()=>{let e=(b.data.zoneId[b.selectZone]?.map(e=>{let{Editable:t,...n}=e;return n})||V.zoneId[b.selectZone]||[]).filter(e=>e.Deletability),t=V.zoneId[b.selectZone]??[];b.data.zoneId[b.selectZone]=[...t,...e]},{immediate:!0})}),(a,o)=>{let s=ve(`loading`);return A((x(),O(l(pe),{class:`elcontainer`},{default:i(()=>[t(l(ke),{height:`auto`,class:`elheader`},{default:i(()=>[d(`div`,He,[t(l(c),{content:`定位到当前区域`,placement:`bottom`},{default:i(()=>[t(l(f),{type:`primary`,size:`small`,icon:l(_e),circle:``,onClick:o[0]||=e=>l(b).positioning()},null,8,[`icon`])]),_:1}),t(Fe,{"select-zone":l(b).selectZone,"onUpdate:selectZone":o[1]||=e=>l(b).selectZone=e},null,8,[`select-zone`]),d(`div`,Ue,[(x(!0),y(v,null,E(De.value,(e,t)=>(x(),O(l(f),{key:t,plain:``,size:`small`,onClick:t=>l(b).selectZone=e.value},{default:i(()=>[m(M(e.text),1)]),_:2},1032,[`onClick`]))),128))])]),d(`div`,We,[t(l(f),{type:`success`,size:`small`,onClick:o[2]||=e=>l(b).newMacro()},{default:i(()=>[m(M(a.$t(`zoneMacro.newMacro`)),1)]),_:1}),t(l(f),{type:`primary`,size:`small`,onClick:o[3]||=e=>l(b).newPlace()},{default:i(()=>[m(M(a.$t(`zoneMacro.newWaymark`)),1)]),_:1}),t(l(S),{direction:`vertical`,class:`toolbar-divider`}),t(l(f),{size:`small`,color:`#BA5783`,onClick:o[4]||=e=>l(b).importPPJSON()},{default:i(()=>[m(M(a.$t(`zoneMacro.importPP`)),1)]),_:1}),t(l(f),{size:`small`,color:`#9D5C63`,onClick:o[5]||=e=>P.value?.click()},{default:i(()=>[m(M(a.$t(`zoneMacro.importUISAVE`)),1)]),_:1}),t(l(S),{direction:`vertical`,class:`toolbar-divider`}),t(l(f),{type:`warning`,size:`small`,onClick:o[6]||=e=>l(b).resetZone()},{default:i(()=>[m(M(a.$t(`zoneMacro.resetZone`)),1)]),_:1}),t(l(f),{type:`danger`,size:`small`,onClick:o[7]||=e=>l(b).resetAllData()},{default:i(()=>[m(M(a.$t(`zoneMacro.resetAll`)),1)]),_:1}),t(l(S),{direction:`vertical`,class:`toolbar-divider`}),t(be,{"storage-key":`zone-macro-theme`}),t(Ae)])]),_:1}),t(l(se),{class:`main-content`},{default:i(()=>[t(l(k),{wrap:``,alignment:`flex-start`,class:`macro-grid`},{default:i(()=>[l(b).data.zoneId[l(b).selectZone]===void 0||l(b).data.zoneId[l(b).selectZone].length===0?(x(),O(l(he),{key:0,"w-100":``,"image-size":150,description:a.$t(`zoneMacro.noDataTip`)},null,8,[`description`])):(x(!0),y(v,{key:1},E(l(b).data.zoneId[l(b).selectZone],(n,s)=>(x(),O(l(ie),{key:s,shadow:`hover`,class:`main-box-card`},{default:i(()=>[d(`div`,Ge,[n.Deletability?(x(),y(`span`,Ke,M(a.$t(`zoneMacro.badgeUser`)),1)):(x(),y(`span`,qe,M(a.$t(`zoneMacro.badgeNative`)),1))]),A(d(`p`,{class:`macro-title`,innerHTML:n.Name},null,8,Je),[[r,!n.Editable]]),A(t(l(le),{modelValue:n.Name,"onUpdate:modelValue":e=>n.Name=e,size:`small`,placeholder:a.$t(`zoneMacro.placeholderMacroTitle`),style:{width:`calc(100% - 2em)`}},null,8,[`modelValue`,`onUpdate:modelValue`,`placeholder`]),[[r,n.Editable]]),`Text`in n?(x(),y(`div`,Ye,[n.Editable?u(``,!0):(x(),y(`article`,Xe,[(x(!0),y(v,null,E(n.Text?.split(`
`),(e,t)=>(x(),y(`div`,{key:t,class:`macroText`},M(e),1))),128))])),A(t(l(le),{modelValue:n.Text,"onUpdate:modelValue":e=>n.Text=e,type:`textarea`,size:`small`,placeholder:a.$t(`zoneMacro.placeholderMacroText`),wrap:`off`,autosize:{minRows:3},style:{width:`450px`,"max-width":`calc(100% - 2em)`}},null,8,[`modelValue`,`onUpdate:modelValue`,`placeholder`]),[[r,n.Editable]]),n.Editable?u(``,!0):(x(),O(l(g),{key:1,class:`buttonArea`,style:oe({maxHeight:n.Editable?`100px`:null,opacity:n.Editable?1:null})},{default:i(()=>[n.Deletability?(x(),O(l(f),{key:0,icon:l(we),size:`small`,onClick:e=>l(b).editMacroMacro(n)},null,8,[`icon`,`onClick`])):u(``,!0),t(l(f),{icon:l(de),type:`info`,size:`small`,onClick:e=>l(b).sendMacroEcho(n.Text)},{default:i(()=>[m(M(a.$t(`zoneMacro.sendEcho`)),1)]),_:1},8,[`icon`,`onClick`]),t(l(f),{icon:l(ue),type:`primary`,size:`small`,onClick:e=>l(b).sendMacroParty(n.Text)},{default:i(()=>[m(M(a.$t(`zoneMacro.sendParty`)),1)]),_:1},8,[`icon`,`onClick`])]),_:2},1032,[`style`])),n.Editable?(x(),O(l(g),{key:2,class:`buttonAreaEditing`},{default:i(()=>[t(l(f),{type:`success`,size:`small`,icon:l(h),onClick:e=>l(b).submitMacroMacro(n)},{default:i(()=>[m(M(a.$t(`zoneMacro.buttonDone`)),1)]),_:1},8,[`icon`,`onClick`]),n.Deletability?(x(),O(l(f),{key:0,type:`danger`,size:`small`,icon:l(C),onClick:e=>l(b).deleteMacro(n)},{default:i(()=>[m(M(a.$t(`zoneMacro.buttonDelete`)),1)]),_:1},8,[`icon`,`onClick`])):u(``,!0)]),_:2},1024)):u(``,!0)])):u(``,!0),`Place`in n?(x(),y(`div`,Ze,[A(t(l(k),null,{default:i(()=>[t(l(ae),{data:Object.entries(n.Place).filter(e=>[`A`,`B`,`C`,`D`,`One`,`Two`,`Three`,`Four`].includes(e[0])),border:``,size:`small`},{default:i(()=>[t(l(e),{align:`center`,label:a.$t(`zoneMacro.tableActive`),width:`50`},{default:i(e=>[t(l(ge),{modelValue:e.row[1].Active,"onUpdate:modelValue":t=>e.row[1].Active=t,size:`small`,style:{"--el-switch-on-color":`#13ce66`}},null,8,[`modelValue`,`onUpdate:modelValue`])]),_:1},8,[`label`]),t(l(e),{align:`center`,label:a.$t(`zoneMacro.tableMark`),width:`50`},{default:i(e=>[d(`span`,null,M(e.row[0]),1)]),_:1},8,[`label`]),t(l(e),{align:`center`,label:a.$t(`zoneMacro.tableX`),width:`120`},{default:i(e=>[A(d(`span`,null,M(e.row.X),513),[[r,!n.Editable]]),A(t(l(T),{modelValue:e.row[1].X,"onUpdate:modelValue":t=>e.row[1].X=t,step:.1,precision:2,"controls-position":`right`,size:`small`,style:{width:`8.5em`},onChange:e=>$(n)},null,8,[`modelValue`,`onUpdate:modelValue`,`onChange`]),[[r,n.Editable]])]),_:2},1032,[`label`]),t(l(e),{align:`center`,label:a.$t(`zoneMacro.tableZ`),width:`120`},{default:i(e=>[A(d(`span`,null,M(e.row.Z),513),[[r,!n.Editable]]),A(t(l(T),{modelValue:e.row[1].Z,"onUpdate:modelValue":t=>e.row[1].Z=t,step:.1,precision:2,"controls-position":`right`,size:`small`,style:{width:`8.5em`},onChange:e=>$(n)},null,8,[`modelValue`,`onUpdate:modelValue`,`onChange`]),[[r,n.Editable]])]),_:2},1032,[`label`]),t(l(e),{align:`center`,label:a.$t(`zoneMacro.tableY`),width:`120`},{default:i(e=>[A(d(`span`,null,M(e.row.Y),513),[[r,!n.Editable]]),A(t(l(T),{modelValue:e.row[1].Y,"onUpdate:modelValue":t=>e.row[1].Y=t,step:.1,precision:2,"controls-position":`right`,size:`small`,style:{width:`8.5em`},onChange:e=>$(n)},null,8,[`modelValue`,`onUpdate:modelValue`,`onChange`]),[[r,n.Editable]])]),_:2},1032,[`label`])]),_:2},1032,[`data`])]),_:2},1536),[[r,n.Editable]]),t(l(k),null,{default:i(()=>[(x(),O(Ve,{key:JSON.stringify(n.Place)+n.Name+s,macro:n,"zone-id":l(b).selectZone},null,8,[`macro`,`zone-id`]))]),_:2},1024),n.Editable?u(``,!0):(x(),O(l(g),{key:0,class:`buttonArea`,style:oe({maxHeight:n.Editable?`100px`:null,opacity:n.Editable?1:null})},{default:i(()=>[t(l(f),{type:`primary`,size:`small`,onClick:e=>l(b).doLocalWayMark(n.Place)},{default:i(()=>[m(M(a.$t(`zoneMacro.doLocal`)),1)]),_:1},8,[`onClick`]),t(l(f),{type:`primary`,size:`small`,onClick:e=>l(b).doPartyWayMark(n.Place)},{default:i(()=>[m(M(a.$t(`zoneMacro.doPublic`)),1)]),_:1},8,[`onClick`]),t(l(f),{icon:l(Te),size:`small`,class:`export`,onClick:e=>l(b).exportWaymarksJson(n)},null,8,[`icon`,`onClick`]),n.Deletability?(x(),O(l(f),{key:0,icon:l(we),size:`small`,onClick:e=>l(b).editMacroPlace(n)},null,8,[`icon`,`onClick`])):u(``,!0)]),_:2},1032,[`style`])),n.Editable?(x(),O(l(g),{key:1,class:`buttonAreaEditing`},{default:i(()=>[t(l(ge),{modelValue:l(H),"onUpdate:modelValue":o[8]||=e=>ce(H)?H.value=e:null,size:`small`,"inline-prompt":``,"active-text":`实时模式`,"inactive-text":`手动模式`},null,8,[`modelValue`]),t(l(f),{type:`success`,size:`small`,icon:l(h),onClick:e=>l(b).submitMacroPlace(n)},{default:i(()=>[m(M(a.$t(`zoneMacro.buttonDone`)),1)]),_:1},8,[`icon`,`onClick`]),n.Deletability?(x(),O(l(f),{key:0,type:`danger`,size:`small`,icon:l(C),onClick:e=>l(b).deleteMacro(n)},{default:i(()=>[m(M(a.$t(`zoneMacro.buttonDelete`)),1)]),_:1},8,[`icon`,`onClick`])):u(``,!0)]),_:2},1024)):u(``,!0)])):u(``,!0)]),_:2},1024))),128)),X.value&&D.value?A((x(),O(l(ie),{key:2,"element-loading-text":`正在加载...`,shadow:`hover`,class:`duty-card`},{default:i(()=>[q.value===`idle`?(x(),y(`div`,Qe,[t(l(f),{type:`primary`,plain:``,onClick:o[9]||=()=>st(!1)},{default:i(()=>[...o[14]||=[m(` 加载攻略 `,-1)]]),_:1})])):q.value===`loading`?(x(),y(`div`,$e)):q.value===`empty`?(x(),y(`div`,et,[...o[15]||=[d(`p`,null,`暂无攻略内容`,-1)]])):q.value===`error`?(x(),y(`div`,tt,[d(`p`,null,`加载失败 (`+M(J.value)+`)`,1),t(l(f),{size:`small`,type:`primary`,onClick:o[10]||=()=>st(!0)},{default:i(()=>[...o[16]||=[m(` 重试 `,-1)]]),_:1})])):(x(),y(`div`,{key:4,class:`duty-html-content`,innerHTML:K.value},null,8,nt)),d(`div`,rt,[t(l(me),{href:X.value,target:`_blank`,type:`primary`,size:`small`},{default:i(()=>[...o[17]||=[m(` 在 新大陆见闻录 查看完整攻略 `,-1)]]),_:1},8,[`href`])])]),_:1})),[[s,G.value]]):u(``,!0)]),_:1})]),_:1}),d(`input`,{ref_key:`fileInput`,ref:P,type:`file`,accept:`.DAT,.dat`,style:{display:`none`},onChange:lt},null,544),t(l(ye),{modelValue:R.value,"onUpdate:modelValue":o[13]||=e=>R.value=e,title:a.$t(`zoneMacro.uisaveDialogTitle`),width:`800px`},{footer:i(()=>[d(`div`,at,[t(l(f),{onClick:o[12]||=e=>R.value=!1},{default:i(()=>[m(M(a.$t(`zoneMacro.cancel`)),1)]),_:1}),t(l(f),{type:`primary`,disabled:B.value.length===0,onClick:dt},{default:i(()=>[m(M(a.$t(`zoneMacro.importSelected`,[B.value.length])),1)]),_:1},8,[`disabled`])])]),default:i(()=>[d(`div`,it,[t(l(Se),{modelValue:z.value,"onUpdate:modelValue":o[11]||=e=>z.value=e},{default:i(()=>[m(M(a.$t(`zoneMacro.onlyCurrentZone`,[W.value,Q(W.value)])),1)]),_:1},8,[`modelValue`])]),t(l(ae),{data:ct.value,style:{width:`100%`},height:`400`,onSelectionChange:ut},{default:i(()=>[t(l(e),{type:`selection`,width:`40`}),t(l(e),{label:a.$t(`zoneMacro.slot`),width:`80`,align:`center`,sortable:``,"sort-by":`index`},{default:i(({row:e})=>[m(M(e.index+1),1)]),_:1},8,[`label`]),t(l(e),{prop:`mark.regionID`,label:a.$t(`zoneMacro.mapID`),width:`100`,sortable:``,"sort-by":`mark.regionID`},{default:i(({row:e})=>[m(M(e.mark.regionID),1)]),_:1},8,[`label`]),t(l(e),{label:a.$t(`zoneMacro.mapName`),sortable:``,"sort-method":ft,"min-width":`150`},{default:i(({row:e})=>[m(M(Q(e.mark.regionID)),1)]),_:1},8,[`label`]),t(l(e),{label:a.$t(`zoneMacro.preview`),width:`70`,align:`center`},{default:i(({row:e})=>[t(l(n),{placement:`left`,width:280,trigger:`hover`},{reference:i(()=>[t(l(f),{icon:l(xe),circle:``,size:`small`},null,8,[`icon`])]),default:i(()=>[t(Le,{waymark:e.mark,size:250},null,8,[`waymark`])]),_:2},1024)]),_:1},8,[`label`]),t(l(e),{label:a.$t(`zoneMacro.timestamp`),width:`160`,sortable:``,"sort-by":`mark.timestamp`},{default:i(({row:e})=>[m(M(new Date(e.mark.timestamp*1e3).toLocaleString()),1)]),_:1},8,[`label`])]),_:1},8,[`data`])]),_:1},8,[`modelValue`,`title`])]),_:1},512)),[[r,l(b).show]])}}}),[[`__scopeId`,`data-v-77075208`]]);export{ot as default};