import chinese2IconRaw from '@/resources/chinese2Icon.json'

const chineseToIconMap: Record<string, string> = chinese2IconRaw

const userActionMap = new Map([
  ['任务指令', 123],
  ['冲刺', 104],
  ['坐骑', 118],
  ['攻击', 101],
])

const chineseAbbreviationMap = new Map([
  // PLD
  ['战逃', '战逃反应'],
  ['盾猛', '盾牌猛击'],
  ['无敌', '神圣领域'],
  ['幕帘', '圣光幕帘'],
  ['深仁', '深仁厚泽'],
  ['大翅膀', '武装戍卫'],
  ['大预警', '极致防御'],
  ['安魂', '绝对统治'],

  // WAR
  ['FC', '裂石飞环'],
  ['直觉', '原初的直觉'],
  ['泰然', '泰然自若'],
  ['解放', '原初的解放'],
  ['勇猛', '原初的勇猛'],
  ['血气', '原初的血气'],
  ['大复仇', '戮罪'],

  // DRK
  ['活死人', '行尸走肉'],
  ['布道', '暗黑布道'],
  ['黑盾', '至黑之夜'],

  // GNB
  ['超火', '超火流星'],
  ['刚玉', '刚玉之心'],

  // Caster
  ['即刻', '即刻咏唱'],
  ['病毒', '昏乱'],
  ['R3', '毁坏'],

  // WHM
  ['神速', '神速咏唱'],
  ['天赐', '天赐祝福'],
  ['白盾', '神祝祷'],
  ['红花', '苦难之心'],
  ['蓝花', '狂喜之心'],
  ['铃铛', '礼仪之铃'],

  // SCH
  ['小仙女', '朝日召唤'],
  ['低语', '仙光的低语'],
  ['单盾', '鼓舞激励之策'],
  ['小群盾', '士气高扬之策'],
  ['幻光', '异想的幻光'],
  ['活性法', '生命活性法'],
  ['野战', '野战治疗阵'],
  ['不屈', '不屈不挠之策'],
  ['扩散', '展开战术'],
  ['扩散盾', '展开战术'],
  ['应急', '应急战术'],
  ['绿帽', '深谋远虑之策'],
  ['融光', '以太契约'],
  ['祥光', '异想的祥光'],
  ['大天使', '炽天召唤'],
  ['炽天使', '炽天召唤'],
  ['回生法', '生命回生法'],
  ['跑快快', '疾风怒涛之计'],
  ['PKK', '疾风怒涛之计'],
  ['群盾', '意气轩昂之策'],

  // AST
  ['先天', '先天禀赋'],
  ['抽卡A', '星极抽卡'],
  ['抽卡B', '灵极抽卡'],
  ['合图', '星位合图'],
  ['命轮', '命运之轮'],
  ['天星', '天星冲日'],
  ['炸地星', '星体爆轰'],
  ['地星爆炸', '星体爆轰'],
  ['交错', '天星交错'],

  // SGE
  ['贤单盾', '均衡诊断'],
  ['贤小群盾', '均衡预后'],
  ['贤活性法', '灵橡清汁'],
  ['贤野战', '坚角清汁'],
  ['贤不屈', '寄生清汁'],
  ['贤低语', '自生II'],
  ['白牛', '白牛清汁'],
  ['贤绿帽', '白牛清汁'],
  ['海马', '输血'],
  ['群海马', '泛输血'],

  // MNK
  ['红莲', '红莲极意'],

  // DRG
  ['连祷', '战斗连祷'],

  // NIN
  ['背刺', '介毒之术'],
  ['生杀', '生杀予夺'],

  // SAM
  ['明镜', '明镜止水'],
  ['震天', '必杀剑·震天'],
  ['晓天', '必杀剑·晓天'],
  ['夜天', '必杀剑·夜天'],
  ['九天', '必杀剑·九天'],
  ['红莲', '必杀剑·红莲'],
  ['闪影', '必杀剑·闪影'],
  ['意气', '意气冲天'],
  ['斩浪', '奥义斩浪'],
  ['波切', '奥义斩浪'],
  ['回返波切', '回返斩浪'],

  // RPR

  // VPR

  // BRD
  ['猛者', '猛者强击'],
  ['贤者歌', '贤者的叙事谣'],
  ['光阴神', '光阴神的礼赞凯歌'],
  ['军神歌', '军神的赞美歌'],
  ['战歌', '战斗之声'],
  ['旅神歌', '放浪神的小步舞曲'],
  ['九天', '九天连箭'],
  ['伶牙', '伶牙俐齿'],
  ['侧风', '侧风诱导箭'],
  ['大地神', '大地神的抒情恋歌'],

  // MCH

  // DNC
  ['小舞', '标准舞步'],
  ['华尔兹', '治疗之华尔兹'],
  ['桑巴', '防守之桑巴'],
  ['探戈', '进攻之探戈'],
  ['大舞', '技巧舞步'],
  ['百花', '百花争艳'],
  ['即兴', '即兴表演'],

  // BLM
  ['火1', '火炎'],
  ['火2', '烈炎'],
  ['火3', '爆炎'],
  ['火4', '炽炎'],
  ['冰1', '冰结'],
  ['冰2', '冰冻'],
  ['冰3', '冰封'],
  ['冰4', '冰澈'],
  ['雷1', '闪雷'],
  ['雷2', '震雷'],
  ['雷3', '暴雷'],
  ['雷4', '霹雷'],
  ['高雷1', '高闪雷'],
  ['高雷2', '高震雷'],
  ['高火2', '高烈炎'],
  ['高冰2', '高冰冻'],
  ['三连', '三连咏唱'],
  ['激情', '激情咏唱'],
  ['星灵', '星灵移位'],
  ['转魔', '魔泉'],
  ['P', '悖论'],
  ['D', '绝望'],
  ['FS', '耀星'],

  // SMN
  ['火神', '火神召唤II'],
  ['土神', '土神召唤II'],
  ['风神', '风神召唤II'],
  ['灵护', '灼热之光'],
  ['风圈', '螺旋气流'],

  // RDM
  ['倍增', '魔元化'],

  // PCT
  ['坦培拉', '坦培拉涂层'],
  ['蛋壳', '坦培拉涂层'],
  ['减色', '坦培拉涂层'],
  ['白豆', '神圣之白'],
  ['黑豆', '彗星之黑'],
])

function chineseToIcon(chinese: string): number | undefined {
  chinese = chineseAbbreviationMap.get(chinese.toUpperCase()) ?? chinese

  const iconStr =
    userActionMap.get(chinese)?.toString() ?? chineseToIconMap[chinese]
  const iconNum = Number(iconStr)

  if (!iconStr || Number.isNaN(iconNum) || iconNum === 0) {
    return undefined
  }
  return iconNum
}

export { chineseToIcon, chineseToIconMap }
