// 只应当记录共享CD的技能组。
// 技能进化不应当在这里处理。
const compareSameGroup = {
  16484: 16486, // 回返彼岸花→回返纷乱雪月花
  16485: 16486, // 回返天下五剑→回返纷乱雪月花
  7496: 16481, // 必杀剑·红莲→必杀剑·闪影
  16003: 16192, /// 0色标准舞步结束→双色标准舞步结束
  16191: 16192, // 单色标准舞步→双色标准舞步结束
  16004: 16196, // 0色技巧舞步结束→四色技巧舞步结束
  16193: 16196, // 单色技巧舞步结束→四色技巧舞步结束
  16194: 16196, // 双色技巧舞步结束→四色技巧舞步结束
  16195: 16196, // 三色技巧舞步结束→四色技巧舞步结束
  3551: 25751, // 原初的直觉→原初的血气
  16464: 25751, // 原初的勇猛→原初的血气
  16510: 16508, // 能量抽取→能量吸收
  16499: 16498, // 毒菌冲击→钻头
  23287: 23290, // 如意大旋风→月下彼岸花
  18324: 18325, // 类星体→正义飞踢
  23272: 23285, // 天使的点心→马特拉魔术
  23280: 23285, // 龙之力→马特拉魔术
  23273: 23275, // 玄结界→斗灵弹
  11426: 11427, // 飞翎雨→地火喷发
  11428: 11429, // 山崩→轰雷
} as const

const compareSameMap = new Map<number, number>(
  Object.entries(compareSameGroup).map(([k, v]) => [Number(k), v]),
)

function compareSame(id: number) {
  return compareSameMap.get(id) || id
}

export { compareSame }
