const compareSameGroup = {
  16483: 0, // 根本用不出来的燕回返→0
  16484: 16486, // 回返彼岸花→回返纷乱雪月花
  16485: 16486, // 回返天下五剑→回返纷乱雪月花
  25779: 16487, // 无名照破→照破
  7496: 16481, // 必杀剑·红莲→必杀剑·闪影
  2874: 0, // 虹吸弹
  2890: 0, // 弹射
  2872: 16500, // 热弹→空气锚
  16003: 16192, /// 0色标准舞步结束→双色标准舞步结束
  16191: 16192, // 单色标准舞步→双色标准舞步结束
  16004: 16196, // 0色技巧舞步结束→四色技巧舞步结束
  16193: 16196, // 单色技巧舞步结束→四色技巧舞步结束
  16194: 16196, // 双色技巧舞步结束→四色技巧舞步结束
  16195: 16196, // 三色技巧舞步结束→四色技巧舞步结束
  3551: 25751, // 原初的直觉→原初的血气
  16464: 25751, // 原初的勇猛→原初的血气
  25752: 7387, // 造山运动→动乱
  16510: 16508, // 能量抽取→能量吸收
  3581: 16549, // 龙神附体→不死鸟附体
  16494: 3562, // 影噬箭→侧风诱导箭
  16499: 16498, // 毒菌冲击→钻头
  16527: 7515, // 交剑→移转
  38: 7389, // 狂暴→原初的解放
  7415: 16502, // 超档车式炮塔→超档后式人偶
  92: 16478, // 跳跃→高跳
  23287: 23290, // 如意大旋风→月下彼岸花
  18324: 18325, // 类星体→正义飞踢
  23272: 23285, // 天使的点心→马特拉魔术
  23280: 23285, // 龙之力→马特拉魔术
  23273: 23275, // 玄结界→斗灵弹
  11426: 11427, // 飞翎雨→地火喷发
  11428: 11429, // 山崩→轰雷
  52: 0, // 战壕→0
  48: 0, // 守护→0
  3629: 0, // 深恶痛绝→0
  3580: 0, // 三重灾祸→0
  7429: 0, // 龙神迸发→0
  7449: 0, // 死亡轮回→0
  16516: 0, // 不死鸟迸发→0
  3631: 0, // 血债→0
  16142: 0, // 王室亲卫→0
  28: 0, // 钢铁信念→0
  2259: 0, // 天之印→0
  2261: 0, // 地之印→0
  2262: 0, // 缩地→0
  2263: 0, // 人之印→0
  3582: 0, // 死星核爆→0
  110: 0, // 失血箭→0
  117: 0, // 死亡箭雨→0
  16161: 25758, // 石之心→刚玉之心
  16144: 16165, // 危险领域→爆破领域
  3641: 3643, // 吸血深渊→精雕怒斩
  25755: 0, // 暗魂(吸血深渊的二段)
  16546: 0, // 慰籍
  16548: 0, // 炽天的幕帘
  802: 0, // 仙光的拥抱
  8324: 0, // 星体爆轰
  24307: 24313, // 炎稠液质
  2246: 0, // 断绝,梦幻三段的派生技能
  24402: 24401, // 镰刀位移
  24403: 0, // 镰刀的位移派生技
  17206: 0, // 滚轮冲
  24288: 24302, // 自愈→自然愈合
  24289: 24313, // 白黏液→黑黏液
  17: 36920, // 预警→极限防御
  44: 36923, // 复仇→天谴
  3636: 36927, // 暗影墙→暗影守护
  16148: 36935, // 星云→大星云
  2248: 36957, // 夺取→毒盛之术
} as const

const compareSameMap = new Map<number, number>(
  Object.entries(compareSameGroup).map(([k, v]) => [Number(k), v]),
)

function compareSame(id: number) {
  return compareSameMap.get(id) || id
}

export { compareSame }
